
<!DOCTYPE HTML>
<html lang="bn" >
    
<!-- Mirrored from pybook.subeen.com/list-tuple-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:31 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল · পাইথন প্রোগ্রামিং</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Tamim Shahriar">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="set-dictionary-python.html" />
    
    
    <link rel="prev" href="string-python.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="অনুসন্ধান" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/subeen/python-programming-bangla" target="_blank" class="custom-link">পাইথন প্রোগ্রামিং</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="index.html">
            
                    
                    ভূমিকা
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="programming-and-python.html">
            
                <a href="programming-and-python.html">
            
                    
                    প্রোগ্রামিং ও পাইথন 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello-world-python.html">
            
                <a href="hello-world-python.html">
            
                    
                    পাইথন দিয়ে প্রথম প্রোগ্রাম
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="variable-data-type-python.html">
            
                <a href="variable-data-type-python.html">
            
                    
                    ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="conditional-logic-python.html">
            
                <a href="conditional-logic-python.html">
            
                    
                    কন্ডিশনাল লজিক
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="turtle-python.html">
            
                <a href="turtle-python.html">
            
                    
                    টার্টলের সঙ্গে পরিচয়
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="loop-python.html">
            
                <a href="loop-python.html">
            
                    
                    লুপ - একই কাজ অনেকবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="function-python.html">
            
                <a href="function-python.html">
            
                    
                    ফাংশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="string-python.html">
            
                <a href="string-python.html">
            
                    
                    স্ট্রিং নিয়ে কাজকারবার
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="list-tuple-python.html">
            
                <a href="list-tuple-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="set-dictionary-python.html">
            
                <a href="set-dictionary-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="module-package.html">
            
                <a href="module-package.html">
            
                    
                    মডিউল ও প্যাকেজ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="object-class-python.html">
            
                <a href="object-class-python.html">
            
                    
                    অবজেক্ট ও ক্লাস
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix.html">
            
                <a href="appendix.html">
            
                    
                    বই ও ওয়েবসাইটের তালিকা
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com/" target="blank" class="gitbook-link">
            গিটবুকের মাধ্যমে প্রকাশিত
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="" >পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0;-&#x9A1;&#x9C7;&#x99F;&#x9BE;-&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0;---&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;-&#x993;-&#x99F;&#x9BE;&#x9AA;&#x9B2;">&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; - &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x993; &#x99F;&#x9BE;&#x9AA;&#x9B2;</h1>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x98F;&#x9A4;&#x995;&#x9CD;&#x9B7;&#x9A3; &#x99B;&#x9C7;&#x9BE;&#x99F; &#x99B;&#x9C7;&#x9BE;&#x99F; &#x985;&#x9A8;&#x9C7;&#x995; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF;, &#x9AF;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982;&#x9DF;&#x9C7;&#x9B0; &#x996;&#x9C1;&#x9AC;&#x987; &#x9AE;&#x9C7;&#x9D7;&#x9B2;&#x9BF;&#x995; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x964; &#x9A4;&#x9AC;&#x9C7; &#x98F;&#x995;&#x9A5;&#x9BE;&#x993; &#x9A0;&#x9BF;&#x995; &#x9AF;&#x9C7; &#x98F;&#x9B8;&#x9AC; &#x9AC;&#x9BF;&#x9B7;&#x9DF; &#x9B8;&#x9B9;&#x99C; &#x9B9;&#x9B2;&#x9C7;&#x993; &#x986;&#x9DF;&#x9A4;&#x9CD;&#x9AC;&#x9C7; &#x986;&#x9A8;&#x9BE; &#x996;&#x9C1;&#x9AC; &#x9B8;&#x9B9;&#x99C; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AC;&#x9CD;&#x9AF;&#x9BE;&#x9AA;&#x9BE;&#x9B0; &#x9A8;&#x9DF;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE;&#x9B0; &#x9B6;&#x9C1;&#x9B0;&#x9C1;&#x9B0; &#x9A6;&#x9BF;&#x995;&#x9C7; &#x995;&#x9DF;&#x9C7;&#x995;&#x9AE;&#x9BE;&#x9B8; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x9A6;&#x9BF;&#x9A8; &#x98F;&#x995;&#x9A8;&#x9BE;&#x997;&#x9BE;&#x9DC;&#x9C7; &#x9AA;&#x9BE;&#x981;&#x99A;-&#x99B;&#x9DF; &#x998;&#x9A3;&#x9CD;&#x99F;&#x9BE; &#x99A;&#x9B0;&#x9CD;&#x99A;&#x9BE; &#x995;&#x9B0;&#x9BE; &#x99C;&#x9B0;&#x9C1;&#x9B0;&#x9C0;&#x964; &#x986;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9AF;&#x9C7;&#x9B9;&#x9C7;&#x9A4;&#x9C1; &#x98F;&#x995;&#x99F;&#x9BE; &#x9A6;&#x995;&#x9CD;&#x9B7;&#x9A4;&#x9BE;, &#x9A4;&#x9BE;&#x987; &#x9AC;&#x987; &#x9AA;&#x9DC;&#x9BE;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x99F;&#x9BF;&#x9B8; &#x995;&#x9B0;&#x9BE;&#x99F;&#x9BE; &#x99C;&#x9B0;&#x9C1;&#x9B0;&#x9C0;&#x964;</p>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x98F;&#x995;&#x99F;&#x9C1; &#x9AC;&#x9DC; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9C7;&#x99B;&#x9BF; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B0;&#x9BE;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x98F;&#x987; &#x985;&#x9A7;&#x9CD;&#x9AF;&#x9BE;&#x9DF;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9B8;&#x9AE;&#x9CD;&#x9AA;&#x9B0;&#x9CD;&#x995;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x99C;&#x9BE;&#x9A8;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x99B;&#x9BE;&#x9DC;&#x9BE; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BF; &#x997;&#x9C1;&#x9B0;&#x9C1;&#x9A4;&#x9CD;&#x9AC;&#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; - &#x99F;&#x9BE;&#x9AA;&#x9B2;, &#x9B8;&#x9C7;&#x99F; &#x993; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9B8;&#x9AE;&#x9CD;&#x9AA;&#x9B0;&#x9CD;&#x995;&#x9C7;&#x993; &#x99C;&#x9BE;&#x9A8;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x9AC;&#x9B2;&#x9C7; &#x995;&#x9C7;&#x9A8;? &#x995;&#x9BE;&#x9B0;&#x9A3; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9A6;&#x9BF;&#x9B7;&#x9CD;&#x99F; &#x989;&#x9AA;&#x9BE;&#x9DF;&#x9C7; &#x9AC;&#x9BE; &#x9AC;&#x9BF;&#x9A8;&#x9CD;&#x9AF;&#x9BE;&#x9B8;&#x9C7; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B0;&#x9BE;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9AF;&#x996;&#x9A8;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x996;&#x9A8;&#x987; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8; &#x9AA;&#x9DC;&#x9AC;&#x9C7;&#x964; &#x9AF;&#x9A6;&#x9BF;&#x993; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x996;&#x9C1;&#x9AC; &#x9AC;&#x9DC; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x9B8;&#x9AC; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x986;&#x9DF;&#x9A4;&#x9CD;&#x9AC;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9BE;&#x99F;&#x9BE; &#x996;&#x9C1;&#x9AC; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0;, &#x9AF;&#x9C7;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8;&#x9C7;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x9B8;&#x9A0;&#x9BF;&#x995; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AC;&#x9C7;&#x997; &#x9AA;&#x9C7;&#x9A4;&#x9C7; &#x9A8;&#x9BE; &#x9B9;&#x9DF;&#x964;</p>
<h2 id="&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;-list">&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; (list)</h2>
<p>&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AF;&#x9C7;&#x9B9;&#x9C7;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9AC;&#x9C7;&#x987; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;, &#x9A4;&#x9BE;&#x987; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x9AE;&#x9C7;&#x9D7;&#x9B2;&#x9BF;&#x995; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x986;&#x9B2;&#x9C7;&#x9BE;&#x99A;&#x9A8;&#x9BE;&#x9DF; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;&#x964; &#x9AC;&#x9B0;&#x982; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x993; &#x9A4;&#x9BE;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x986;&#x9B0; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x995;&#x996;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x996;&#x9A8;&#x9C7;&#x9BE; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;, &#x995;&#x996;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x996;&#x9A8;&#x9C7;&#x9BE; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9B6;&#x9AC;&#x9CD;&#x9A6;&#x99F;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x99B;&#x9BF;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x987; &#x9AC;&#x987;&#x9DF;&#x9C7;&#x9B0; &#x9AA;&#x9B0;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9BF; &#x996;&#x9A3;&#x9CD;&#x9A1;&#x9C7; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x993; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7;&#x9B0; &#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x995;&#x9CD;&#x9AF; &#x9AC;&#x9BF;&#x9B8;&#x9CD;&#x9A4;&#x9BE;&#x9B0;&#x9BF;&#x9A4; &#x99C;&#x9BE;&#x9A8;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x996;&#x9A8; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x9AE;&#x9BE;&#x9A5;&#x9BE; &#x9A8;&#x9BE; &#x998;&#x9BE;&#x9AE;&#x9BE;&#x9B2;&#x9C7;&#x993; &#x99A;&#x9B2;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7;&#x9C7; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9B0;&#x9BE; append() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>saarc = [<span class="hljs-string">&quot;Bangladesh&quot;</span>, <span class="hljs-string">&quot;India&quot;</span>, <span class="hljs-string">&quot;Sri Lanka&quot;</span>, <span class="hljs-string">&quot;Pakistan&quot;</span>, <span class="hljs-string">&quot;Nepal&quot;</span>, <span class="hljs-string">&quot;Bhutan&quot;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>print(saarc)
[<span class="hljs-string">&apos;Bangladesh&apos;</span>, <span class="hljs-string">&apos;India&apos;</span>, <span class="hljs-string">&apos;Sri Lanka&apos;</span>, <span class="hljs-string">&apos;Pakistan&apos;</span>, <span class="hljs-string">&apos;Nepal&apos;</span>, <span class="hljs-string">&apos;Bhutan&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>saarc.append(<span class="hljs-string">&quot;Afganistan&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>print(saarc)
[<span class="hljs-string">&apos;Bangladesh&apos;</span>, <span class="hljs-string">&apos;India&apos;</span>, <span class="hljs-string">&apos;Sri Lanka&apos;</span>, <span class="hljs-string">&apos;Pakistan&apos;</span>, <span class="hljs-string">&apos;Nepal&apos;</span>, <span class="hljs-string">&apos;Bhutan&apos;</span>, <span class="hljs-string">&apos;Afganistan&apos;</span>]
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9BE;&#x9AE; &#x9AF;&#x9C7; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x995;&#x9AD;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x9A6;&#x9C7;&#x9B6;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x9A4;&#x9BE;&#x9B2;&#x9BF;&#x995;&#x9BE;&#x9DF; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9A6;&#x9C7;&#x9B6;&#x995;&#x9C7; &#x9AF;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x9DF;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x99A;&#x9BE;&#x9B2;&#x9BF;&#x9DF;&#x9C7;&#x99B;&#x9BF; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;, &#x9A4;&#x996;&#x9A8; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AE;&#x9C2;&#x9B2; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x9DF;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x9B9;&#x9DF; &#x9A8;&#x9BF;, &#x9AC;&#x9B0;&#x982; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AC;&#x9C7;&#x9B2;&#x9BE;&#x9DF; &#x9AE;&#x9C2;&#x9B2; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9BF;&#x9A4; &#x9B9;&#x9DF;&#x9C7; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x995;&#x9BE;&#x9B0;&#x9A3; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AE;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9AC;&#x9B2; (mutable)&#x964; &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE;, &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AE;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x9AC;&#x9BE; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x99A;&#x9BE;&#x987;, &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9A6;&#x9BF;&#x9B7;&#x9CD;&#x99F; &#x995;&#x9CD;&#x9B0;&#x9AE;&#x9C7; &#x9B8;&#x9BE;&#x99C;&#x9BE;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; sort() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>saarc.sort()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(saarc)
[<span class="hljs-string">&apos;Afganistan&apos;</span>, <span class="hljs-string">&apos;Bangladesh&apos;</span>, <span class="hljs-string">&apos;Bhutan&apos;</span>, <span class="hljs-string">&apos;India&apos;</span>, <span class="hljs-string">&apos;Nepal&apos;</span>, <span class="hljs-string">&apos;Pakistan&apos;</span>, <span class="hljs-string">&apos;Sri Lanka&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-number">1</span>, <span class="hljs-number">3</span>, <span class="hljs-number">7</span>, <span class="hljs-number">2</span>, <span class="hljs-number">4</span>, <span class="hljs-number">6</span>, <span class="hljs-number">1</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li.sort()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(li)
[<span class="hljs-number">1</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">6</span>, <span class="hljs-number">7</span>]
&gt;&gt;&gt;
</code></pre>
<p>&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x989;&#x9B2;&#x9CD;&#x99F;&#x9C7;&#x9BE; &#x995;&#x9CD;&#x9B0;&#x9AE;&#x9C7; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9B8;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;&#x9B2; reverse() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li.reverse()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(li)
[<span class="hljs-number">4</span>, <span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-string">&quot;mango&quot;</span>, <span class="hljs-string">&quot;banana&quot;</span>, <span class="hljs-string">&quot;orange&quot;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li.reverse()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(li)
[<span class="hljs-string">&apos;orange&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>]
&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9C7;&#x99B;&#x9BF; &#x9AF;&#x9C7;, append() &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7;&#x9C7; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x99A;&#x9BE;&#x987; &#x9AF;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B6;&#x9C1;&#x9B0;&#x9C1;&#x9A4;&#x9C7; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x985;&#x9AC;&#x9B8;&#x9CD;&#x9A5;&#x9BE;&#x9A8;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; insert() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x98F;&#x987; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9C7;&#x9BE; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, insert(index, item)&#x964; index &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A8; &#x987;&#x9A8;&#x9A1;&#x9C7;&#x995;&#x9CD;&#x9B8;&#x9C7; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x99F;&#x9BF; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7; &#x986;&#x9B0; item &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9C7;&#x987; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x99F;&#x9BF; &#x9AA;&#x9B0;&#x9BF;&#x9B7;&#x9CD;&#x995;&#x9BE;&#x9B0; &#x9B9;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>fruits = [<span class="hljs-string">&quot;mango&quot;</span>, <span class="hljs-string">&quot;banana&quot;</span>, <span class="hljs-string">&quot;orange&quot;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits.insert(<span class="hljs-number">0</span>, <span class="hljs-string">&quot;apple&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>, <span class="hljs-string">&apos;orange&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits.insert(<span class="hljs-number">2</span>, <span class="hljs-string">&quot;coconut&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;coconut&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>, <span class="hljs-string">&apos;orange&apos;</span>]
&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9AC;&#x9BE;&#x9A6; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; remove() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AF;&#x9C7;&#x987; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BE;&#x9A6; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9B8;&#x9C7;&#x99F;&#x9BF; remove() &#x98F;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x986;&#x995;&#x9BE;&#x9B0;&#x9C7; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x986;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x993;&#x987; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9C7; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x98F;&#x9B0;&#x9B0; &#x9AE;&#x9C7;&#x9B8;&#x9C7;&#x99C; &#x986;&#x9B8;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;coconut&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>, <span class="hljs-string">&apos;orange&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits.remove(<span class="hljs-string">&quot;coconut&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>, <span class="hljs-string">&apos;orange&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits.remove(<span class="hljs-string">&quot;pineapple&quot;</span>)
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
ValueError: list.remove(x): x <span class="hljs-keyword">not</span> <span class="hljs-keyword">in</span> list
&gt;&gt;&gt;
</code></pre>
<p>&#x9A4;&#x9BE;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B6;&#x9B0;&#x9CD;&#x9A4; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x9AF;&#x9C7;&#x9A8; &#x98F;&#x9B0;&#x9B0; &#x9AE;&#x9C7;&#x9B8;&#x9C7;&#x99C; &#x9A8;&#x9BE; &#x986;&#x9B8;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>, <span class="hljs-string">&apos;orange&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>item = <span class="hljs-string">&quot;pineapple&quot;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">if</span> item <span class="hljs-keyword">in</span> fruits:
<span class="hljs-meta">... </span>    remove(item)
<span class="hljs-meta">... </span><span class="hljs-keyword">else</span>:
<span class="hljs-meta">... </span>    print(item, <span class="hljs-string">&quot;not in list&quot;</span>)
<span class="hljs-meta">... </span>
pineapple <span class="hljs-keyword">not</span> <span class="hljs-keyword">in</span> list
&gt;&gt;&gt;
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE; pop() &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0;, &#x9AF;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x99F;&#x9BF; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9C7;, &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9B8;&#x9C7;&#x987; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9AE;&#x9C1;&#x99B;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>, <span class="hljs-string">&apos;orange&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>item = fruits.pop()
<span class="hljs-meta">&gt;&gt;&gt; </span>item
<span class="hljs-string">&apos;orange&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>]
</code></pre>
<p>&#x986;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x99A;&#x9BE;&#x987;&#x9A4;&#x9BE;&#x9AE; &#x9AF;&#x9C7;, &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9A6;&#x9BF;&#x9B7;&#x9CD;&#x99F; &#x987;&#x9A8;&#x9A1;&#x9C7;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9AC;&#x9C7;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; pop()-&#x98F;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x987;&#x9A8;&#x9A1;&#x9C7;&#x995;&#x9CD;&#x9B8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9A6;&#x9BF;&#x9B2;&#x9C7;&#x987; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;mango&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>item = fruits.pop(<span class="hljs-number">1</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>item
<span class="hljs-string">&apos;mango&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>fruits
[<span class="hljs-string">&apos;apple&apos;</span>, <span class="hljs-string">&apos;banana&apos;</span>]
&gt;&gt;&gt;
</code></pre>
<p>&#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7;&#x9C7; &#x9AF;&#x9A6;&#x9BF; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AF;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; extend() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li2 = [<span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li.extend(li2)
<span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
</code></pre>
<p>&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x995;&#x9A4;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; count() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li.count(<span class="hljs-number">3</span>)
<span class="hljs-number">2</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>li.count(<span class="hljs-number">5</span>)
<span class="hljs-number">1</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>li.count(<span class="hljs-number">10</span>)
<span class="hljs-number">0</span>
&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9AE;&#x9C1;&#x99B;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x9B8;&#x9AE;&#x9CD;&#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AE;&#x9C1;&#x99B;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; del() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">del</span>(li[<span class="hljs-number">1</span>])
<span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">1</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">del</span>(li[<span class="hljs-number">0</span>])
<span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">del</span>(li)
<span class="hljs-meta">&gt;&gt;&gt; </span>li
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
NameError: name <span class="hljs-string">&apos;li&apos;</span> <span class="hljs-keyword">is</span> <span class="hljs-keyword">not</span> defined
</code></pre>
<p>&#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x996;&#x9A8;&#x993; &#x995;&#x996;&#x9A8;&#x993; &#x98F;&#x9AE;&#x9A8; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B2;&#x9BE;&#x997;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7; &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1;&#x9A4;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x9A4;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9AB;&#x9BE;&#x981;&#x995;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x964; li = [] &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AB;&#x9BE;&#x981;&#x995;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = []
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> x <span class="hljs-keyword">in</span> range(<span class="hljs-number">10</span>):
<span class="hljs-meta">... </span>    li.append(x)
<span class="hljs-meta">... </span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(li)
[<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>, <span class="hljs-number">9</span>]
</code></pre>
<p>&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x993; &#x997;&#x9C1;&#x9A3; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x9B9;&#x9DF; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li1 = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li2 = [<span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li = li1 + li2
<span class="hljs-meta">&gt;&gt;&gt; </span>print(li)
[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>
<span class="hljs-meta">&gt;&gt;&gt; </span>li1 = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li2 = li1 * <span class="hljs-number">3</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(li2)
[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
&gt;&gt;&gt;
</code></pre>
<p>&#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9A5;&#x9BE;&#x995;&#x9C7;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AF;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AF;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x995;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x995;&#x9C0; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AF;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9B8;&#x9C7;&#x99F;&#x9BF;&#x993; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9A7;&#x9BE;&#x9B0;&#x9A8; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; -</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-string">&quot;a&quot;</span>, <span class="hljs-string">&quot;b&quot;</span>, <span class="hljs-string">&quot;c&quot;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>print(li)
[<span class="hljs-string">&apos;a&apos;</span>, <span class="hljs-string">&apos;b&apos;</span>, <span class="hljs-string">&apos;c&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>str = <span class="hljs-string">&quot;&quot;</span>.join(li)
<span class="hljs-meta">&gt;&gt;&gt; </span>print(str)
abc
<span class="hljs-meta">&gt;&gt;&gt; </span>str = <span class="hljs-string">&quot;,&quot;</span>.join(li)
<span class="hljs-meta">&gt;&gt;&gt; </span>print(str)
a,b,c
<span class="hljs-meta">&gt;&gt;&gt; </span>str = <span class="hljs-string">&quot; - &quot;</span>.join(li)
<span class="hljs-meta">&gt;&gt;&gt; </span>print(str)
a - b - c
</code></pre>
<p><strong>&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x995;&#x9AE;&#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9B9;&#x9C7;&#x9A8;&#x9B6;&#x9A8;&#x9B8; (list comprehensions)</strong></p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x996;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x99C;&#x9BE;&#x9B0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE;, &#x9AF;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x995;&#x9AE;&#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9B9;&#x9C7;&#x9A8;&#x9B6;&#x9A8;&#x9B8;&#x964; &#x9A7;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x995;, &#x986;&#x9AE;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x986;&#x99B;&#x9C7; &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x986;&#x9AE;&#x9BF; &#x99A;&#x9BE;&#x987; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7;, &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x9AC;&#x9C7; &#x986;&#x997;&#x9C7;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x9C7;&#x9B0; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x997;&#x9C1;&#x9A3;&#x964; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>new_li = []
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> x <span class="hljs-keyword">in</span> li:
<span class="hljs-meta">... </span>    new_li.append(<span class="hljs-number">2</span> * x)
<span class="hljs-meta">... </span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(new_li)
[<span class="hljs-number">2</span>, <span class="hljs-number">4</span>, <span class="hljs-number">6</span>, <span class="hljs-number">8</span>]
</code></pre>
<p>&#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x995;&#x9AE;&#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9B9;&#x9C7;&#x9A8;&#x9B6;&#x9A8;&#x9B8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF; &#x996;&#x9C1;&#x9AC; &#x9B8;&#x982;&#x995;&#x9CD;&#x9B7;&#x9C7;&#x9AA;&#x9C7; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>new_li = [<span class="hljs-number">2</span> * x <span class="hljs-keyword">for</span> x <span class="hljs-keyword">in</span> li]
<span class="hljs-meta">&gt;&gt;&gt; </span>new_li
[<span class="hljs-number">2</span>, <span class="hljs-number">4</span>, <span class="hljs-number">6</span>, <span class="hljs-number">8</span>]
</code></pre>
<p>&#x986;&#x9AE;&#x9BE;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A5;&#x9BE;&#x995;&#x9C7; &#x98F;&#x9AC;&#x982; &#x9B8;&#x9C7;&#x987; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x99C;&#x9C7;&#x9BE;&#x9DC; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9B8;&#x9C7;&#x987; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF;&#x993; &#x99C;&#x9A8;&#x9CD;&#x9AF;&#x993; &#x986;&#x9AE;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x995;&#x9AE;&#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9B9;&#x9C7;&#x9A8;&#x9B6;&#x9A8;&#x9B8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AF;&#x9A6;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x995;&#x9AE;&#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9B9;&#x9C7;&#x9A8;&#x9B6;&#x9A8;&#x9B8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x9A8;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9BE;&#x9AE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9BE;&#x9AE; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>, <span class="hljs-number">9</span>, <span class="hljs-number">10</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>even_numbers = []
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> x <span class="hljs-keyword">in</span> li:
<span class="hljs-meta">... </span>    <span class="hljs-keyword">if</span> x % <span class="hljs-number">2</span> == <span class="hljs-number">0</span>:
<span class="hljs-meta">... </span>        even_numbers.append(x)
<span class="hljs-meta">... </span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(even_numbers)
[<span class="hljs-number">2</span>, <span class="hljs-number">4</span>, <span class="hljs-number">6</span>, <span class="hljs-number">8</span>, <span class="hljs-number">10</span>]
</code></pre>
<p>&#x986;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x995;&#x9AE;&#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9B9;&#x9C7;&#x9A8;&#x9B6;&#x9A8;&#x9B8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py">even_numbers = [x <span class="hljs-keyword">for</span> x <span class="hljs-keyword">in</span> range(<span class="hljs-number">1</span>, <span class="hljs-number">11</span>) <span class="hljs-keyword">if</span> x % <span class="hljs-number">2</span> == <span class="hljs-number">0</span>]
</code></pre>
<p>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0; : &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;, &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x986;&#x997;&#x9C7;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x9C7;&#x9B0; &#x9AC;&#x9B0;&#x9CD;&#x997;&#x964; &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE;, [1, 2, 3, 4] &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9B2;&#x9C7; [1, 4, 9, 16] &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x995;&#x9AE;&#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9B9;&#x9C7;&#x9A8;&#x9B6;&#x9A8;&#x9B8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<h2 id="&#x99F;&#x9BE;&#x9AA;&#x9B2;-tuple">&#x99F;&#x9BE;&#x9AA;&#x9B2; (Tuple)</h2>
<p>&#x99F;&#x9BE;&#x9AA;&#x9B2; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0;&#x964; &#x98F;&#x99F;&#x9BF; &#x985;&#x9A8;&#x9C7;&#x995;&#x99F;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE;&#x987;&#x964; &#x9A4;&#x9AC;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9C7;&#x9AE;&#x9A8; &#x9A4;&#x9C3;&#x9A4;&#x9C0;&#x9DF; &#x9AC;&#x9A8;&#x9CD;&#x9A7;&#x9A8;&#x9C0; &#x9AC;&#x9BE; &#x9B8;&#x9CD;&#x995;&#x9DF;&#x9BE;&#x9B0; &#x9AC;&#x9CD;&#x9B0;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99F; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9BE;&#x9AE;, &#x99F;&#x9BE;&#x9AA;&#x9B2;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9AC;&#x9A8;&#x9CD;&#x9A7;&#x9A8;&#x9C0; (&#x98F;&#x995;&#x9C7; &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9C0;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9C7;&#x9A8;&#x9CD;&#x9A5;&#x9C7;&#x9B8;&#x9BF;&#x9B8;) &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; x = (1, 2, 3)
&gt;&gt;&gt; type(x)
&lt;class &apos;tuple&apos;&gt;
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x99C;&#x9BE;&#x9B0; &#x9AC;&#x9BF;&#x9B7;&#x9DF; &#x9A6;&#x9C7;&#x996;&#x9BF;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; x = 1, 2, 3
&gt;&gt;&gt; type(x)
&lt;class &apos;tuple&apos;&gt;
&gt;&gt;&gt;
</code></pre>
<p>&#x9A4;&#x9BE;&#x9B0;&#x9AE;&#x9BE;&#x9A8;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9AC;&#x9A8;&#x9CD;&#x9A7;&#x9A8;&#x9C0; &#x9A8;&#x9BE; &#x9A6;&#x9BF;&#x9B2;&#x9C7;&#x993; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; x-&#x995;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9AA;&#x9B2; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7;&#x987; &#x9AC;&#x9BF;&#x9AC;&#x9C7;&#x99A;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x99B;&#x9C7;&#x964; &#x98F;&#x996;&#x9A8; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9A8;&#x9C7;&#x9B0; &#x99F;&#x9BE;&#x9AA;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B8;&#x9AE;&#x9CD;&#x9AD;&#x9AC;? &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B8;&#x9C7;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8;&#x9C7;&#x9B0; &#x989;&#x9A4;&#x9CD;&#x9A4;&#x9B0; &#x9A6;&#x9C7;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py">&gt;&gt;&gt; x = 1
&gt;&gt;&gt; type(x)
&lt;class &apos;int&apos;&gt;
&gt;&gt;&gt; x = 1, 
&gt;&gt;&gt; type(x)
&lt;class &apos;tuple&apos;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x995;&#x996;&#x9A8;&#x9C7;&#x9BE; &#x996;&#x9BE;&#x9B2;&#x9BF; &#x99F;&#x9BE;&#x9AA;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B2;&#x9BE;&#x997;&#x9C7;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; :</p>
<pre><code class="lang-py">&gt;&gt;&gt; t = ()
&gt;&gt;&gt; type(x)
&lt;class &apos;tuple&apos;&gt;
</code></pre>
<p>&#x99F;&#x9BE;&#x9AA;&#x9B2;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x987;&#x9A8;&#x9A1;&#x9C7;&#x995;&#x9CD;&#x9B8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9AA;&#x9C7;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x986;&#x9B0; &#x98F;&#x987; &#x987;&#x9A8;&#x9A1;&#x9C7;&#x995;&#x9CD;&#x9B8;&#x993; 0 &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1; &#x9B9;&#x9DF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>tpl = (<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>tpl[<span class="hljs-number">0</span>]
<span class="hljs-number">1</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>tpl[<span class="hljs-number">1</span>]
<span class="hljs-number">2</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>tpl[<span class="hljs-number">2</span>]
<span class="hljs-number">3</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>tpl[<span class="hljs-number">3</span>]
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
IndexError: tuple index out of range
</code></pre>
<p>&#x98F;&#x996;&#x9A8;, &#x99F;&#x9BE;&#x9AA;&#x9B2; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AE;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9AC;&#x9B2; (mutable) &#x9A8;&#x9DF;&#x964; &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE;, &#x98F;&#x987; &#x9AF;&#x9C7; tpl &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9AA;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE; &#x9AF;&#x9BE;&#x9B0; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9AF;&#x9A5;&#x9BE;&#x995;&#x9CD;&#x9B0;&#x9AE;&#x9C7; 1, 2 &#x993; 3, &#x98F;&#x996;&#x9A8; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9BF; &#x986;&#x9B0; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;, &#x9AF;&#x9C7;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AC;&#x9C7;&#x9B2;&#x9BE;&#x9A4;&#x9C7; &#x9B8;&#x9AE;&#x9CD;&#x9AD;&#x9AC;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>li[<span class="hljs-number">0</span>] = <span class="hljs-number">5</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">5</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>tpl = (<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>tpl
(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>tpl[<span class="hljs-number">0</span>] = <span class="hljs-number">5</span>
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
TypeError: <span class="hljs-string">&apos;tuple&apos;</span> object does <span class="hljs-keyword">not</span> support item assignment
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x985;&#x9A8;&#x9C7;&#x995;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x98F;&#x995;&#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995; (pack) &#x995;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9AA;&#x9B2;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x986;&#x9AC;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9AA;&#x9B2;&#x995;&#x9C7; &#x986;&#x9A8;&#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995; (unpack) &#x995;&#x9B0;&#x9C7; &#x9A4;&#x9BE;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; numbers = (10, 20, 30, 40)
&gt;&gt;&gt; n1, n2, n3, n4 = numbers
&gt;&gt;&gt; n1
10
&gt;&gt;&gt; n2
20
&gt;&gt;&gt; n3
30
&gt;&gt;&gt; n4
40
&gt;&gt;&gt; t = n3, n4
&gt;&gt;&gt; t
(30, 40)
&gt;&gt;&gt; type(t)
&lt;class &apos;tuple&apos;&gt;
</code></pre>
<p>&#x99F;&#x9BE;&#x9AA;&#x9B2;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x98F;&#x9AC;&#x982; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x993;&#x9AA;&#x9B0; &#x9B2;&#x9C1;&#x9AA;&#x993; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; items = (1, 2, 5.5, [&quot;a&quot;, &quot;b&quot;, &quot;c&quot;], (&quot;apple&quot;, &quot;mango&quot;))
&gt;&gt;&gt; for item in items:
...     print(item, type(item))
... 
1 &lt;class &apos;int&apos;&gt;
2 &lt;class &apos;int&apos;&gt;
5.5 &lt;class &apos;float&apos;&gt;
[&apos;a&apos;, &apos;b&apos;, &apos;c&apos;] &lt;class &apos;list&apos;&gt;
(&apos;apple&apos;, &apos;mango&apos;) &lt;class &apos;tuple&apos;&gt;
&gt;&gt;&gt; items[3]
[&apos;a&apos;, &apos;b&apos;, &apos;c&apos;]
&gt;&gt;&gt; items[3][0]
&apos;a&apos;
&gt;&gt;&gt; items[4][1]
&apos;mango&apos;
&gt;&gt;&gt; items[4]
(&apos;apple&apos;, &apos;mango&apos;)
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x985;&#x9A8;&#x9C7;&#x995;&#x9C7;&#x9B0; &#x9AE;&#x9A8;&#x9C7;&#x987; &#x9A8;&#x9BF;&#x9B6;&#x9CD;&#x99A;&#x9DF;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8; &#x99C;&#x9BE;&#x997;&#x99B;&#x9C7;, &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7;&#x993; &#x995;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9B0;&#x9BE;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9DF;? &#x9B9;&#x9CD;&#x9AF;&#x9BE;&#x981;, &#x9A4;&#x9AC;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9B2;&#x9BE;&#x9AE; &#x9A8;&#x9BE;, &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x99F;&#x9BE;&#x9AA;&#x9B2;&#x9C7;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9B8;&#x9B9;&#x99C;&#x9C7;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>tpl = (<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>li = list(tpl)
<span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="string-python.html" class="navigation navigation-prev " aria-label="Previous page: স্ট্রিং নিয়ে কাজকারবার">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="set-dictionary-python.html" class="navigation navigation-next " aria-label="Next page: পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল","level":"1.10","depth":1,"next":{"title":"পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি","level":"1.11","depth":1,"path":"set-dictionary-python.md","ref":"set-dictionary-python.md","articles":[]},"previous":{"title":"স্ট্রিং নিয়ে কাজকারবার","level":"1.9","depth":1,"path":"string-python.md","ref":"string-python.md","articles":[]},"dir":"ltr"},"config":{"plugins":[""],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Tamim Shahriar","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"পাইথন প্রোগ্রামিং","language":"bn","links":{"sidebar":{"পাইথন প্রোগ্রামিং":"https://www.gitbook.com/book/subeen/python-programming-bangla"},"gitbook":true},"gitbook":"*","description":"পাইথন প্রোগ্রামিং ভাষা (ভার্শন ৩) শেখার বাংলা বই। বইটি প্রোগ্রামিংয়ে যারা নতুন, তাদের জন্য উপযোগি। এছাড়া যারা অন্য প্রোগ্রামিং ভাষা জানে কিন্তু পাইথন শিখতে চায়, তারাও বইটি পড়ে পাইথন শিখতে পারবে।"},"file":{"path":"list-tuple-python.md","mtime":"2018-03-06T03:14:11.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-03-06T03:33:35.750Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    
<div><script style="display: none;" type="application/javascript">
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','../www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-57505611-7', 'auto', {name: 'microcdn'});
  ga('microcdn.send', 'pageview');

  var _cdn_prev_loc = window.location.pathname;
  window.setInterval(function () {
    if (window.location.pathname !== _cdn_prev_loc) {
      _cdn_prev_loc = window.location.pathname;
      ga('microcdn.send', 'pageview');
    }
  }, 100);

</script></div>
</body>

<!-- Mirrored from pybook.subeen.com/list-tuple-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:31 GMT -->
</html>

