
<!DOCTYPE HTML>
<html lang="bn" >
    
<!-- Mirrored from pybook.subeen.com/module-package.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:31 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>মডিউল ও প্যাকেজ · পাইথন প্রোগ্রামিং</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Tamim Shahriar">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="object-class-python.html" />
    
    
    <link rel="prev" href="set-dictionary-python.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="অনুসন্ধান" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/subeen/python-programming-bangla" target="_blank" class="custom-link">পাইথন প্রোগ্রামিং</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="index.html">
            
                    
                    ভূমিকা
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="programming-and-python.html">
            
                <a href="programming-and-python.html">
            
                    
                    প্রোগ্রামিং ও পাইথন 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello-world-python.html">
            
                <a href="hello-world-python.html">
            
                    
                    পাইথন দিয়ে প্রথম প্রোগ্রাম
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="variable-data-type-python.html">
            
                <a href="variable-data-type-python.html">
            
                    
                    ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="conditional-logic-python.html">
            
                <a href="conditional-logic-python.html">
            
                    
                    কন্ডিশনাল লজিক
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="turtle-python.html">
            
                <a href="turtle-python.html">
            
                    
                    টার্টলের সঙ্গে পরিচয়
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="loop-python.html">
            
                <a href="loop-python.html">
            
                    
                    লুপ - একই কাজ অনেকবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="function-python.html">
            
                <a href="function-python.html">
            
                    
                    ফাংশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="string-python.html">
            
                <a href="string-python.html">
            
                    
                    স্ট্রিং নিয়ে কাজকারবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="list-tuple-python.html">
            
                <a href="list-tuple-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="set-dictionary-python.html">
            
                <a href="set-dictionary-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="module-package.html">
            
                <a href="module-package.html">
            
                    
                    মডিউল ও প্যাকেজ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="object-class-python.html">
            
                <a href="object-class-python.html">
            
                    
                    অবজেক্ট ও ক্লাস
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix.html">
            
                <a href="appendix.html">
            
                    
                    বই ও ওয়েবসাইটের তালিকা
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com/" target="blank" class="gitbook-link">
            গিটবুকের মাধ্যমে প্রকাশিত
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="" >মডিউল ও প্যাকেজ</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;-&#x993;-&#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;">&#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x993; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;</h1>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9C7;&#x996;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x985;&#x9A8;&#x9C7;&#x995; &#x9B0;&#x995;&#x9AE; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x995;&#x9C0; &#x995;&#x9C0; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9A4;&#x9BE; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9AD;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x986;&#x9B8;&#x9B2;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9C0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF; &#x9A4;&#x9BE;&#x9B0; &#x989;&#x9AA;&#x9B0;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9BE;&#x9A7;&#x9BE;&#x9A8;&#x9C7;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x99F;&#x9BF;&#x982; &#x9B8;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9AE;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9A8;&#x9C7;&#x99F;&#x9C7; &#x9AF;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x9B9;&#x9DF;&#x9C7; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x986;&#x9A6;&#x9BE;&#x9A8;-&#x9AA;&#x9CD;&#x9B0;&#x9A6;&#x9BE;&#x9A8;&#x9C7;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x99B;&#x9AC;&#x9BF;-&#x9AD;&#x9BF;&#x9A1;&#x9BF;&#x993; &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x997;&#x9C7;&#x9AE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x98F;&#x9B0;&#x995;&#x9AE; &#x995;&#x9A4; &#x995;&#x9C0; &#x9AF;&#x9C7; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x995;&#x9B0;&#x9C7;, &#x9A4;&#x9BE;&#x9B0; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC; &#x9A8;&#x9C7;&#x987;&#x964; &#x98F;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BE;&#x9B0;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9B8;&#x9B9;&#x99C; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x985;&#x9A8;&#x9C7;&#x995; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x98F;&#x995;&#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x995;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x993; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9A4;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9A1;&#x9C7;&#x99F;&#x9BE;, &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x993; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; (class)&#x964; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x995;&#x9C0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9AA;&#x9B0;&#x9C7; &#x9B6;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; print(), input(), type(), sum() &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A8;&#x9BF;&#x99C;&#x9C7;&#x9B0;&#x9BE; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BF; &#x9A8;&#x9BF;, &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF; &#x995;&#x9C7;&#x9AC;&#x9B2;&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;&#x987;&#x9A8; (builtin) &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9B2;&#x9C7;&#x964; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;&#x987;&#x9A8; &#x9B6;&#x9AC;&#x9CD;&#x9A6;&#x9C7;&#x9B0; &#x985;&#x9B0;&#x9CD;&#x9A5; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, &#x9AF;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE;&#x995;&#x9BF;&#x99B;&#x9C1;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x99F;&#x9C7;&#x9B2;&#x9BF;&#x9AD;&#x9BF;&#x9B6;&#x9A8; &#x985;&#x9A8;-&#x985;&#x9AB; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;&#x987;&#x9A8; &#x9B8;&#x9C1;&#x987;&#x99A; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9C7;&#x964; &#x993;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9A8;&#x9BF;&#x99C;&#x9C7;&#x9A6;&#x9C7;&#x9B0; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B2;&#x9BE;&#x997;&#x9A4; &#x98F;&#x9AC;&#x982; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AC;&#x9C7;&#x9B6; &#x996;&#x9BE;&#x9A8;&#x9BF;&#x995;&#x99F;&#x9BE; &#x9B8;&#x9AE;&#x9DF; &#x9AC;&#x9CD;&#x9AF;&#x9BE;&#x9DF; &#x9B9;&#x9A4;&#x9C7;&#x9BE;&#x964; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x987;&#x9A4;&#x9BF;&#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x986;&#x99B;&#x9C7; builtins &#x9A8;&#x9BE;&#x9AE;&#x995; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x964; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x99F;&#x9BE;&#x9B0; &#x99A;&#x9BE;&#x9B2;&#x9C1; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x98F;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x986;&#x9AA;&#x9A8;&#x9BE;&#x986;&#x9AA;&#x9A8;&#x9BF; &#x99A;&#x9B2;&#x9C7; &#x986;&#x9B8;&#x9C7;, &#x9A8;&#x987;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; (import) &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9A4;&#x9C7;&#x9BE;&#x964; &#x995;&#x9BE;&#x9B0;&#x9C7;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x987;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x995;&#x9B0;&#x9C7; &#x9AF;&#x9C7;, &#x98F;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x995;&#x9C0; &#x986;&#x99B;&#x9C7;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x99C;&#x9BE;&#x9A8;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x99F;&#x9BE;&#x9B0; &#x99A;&#x9BE;&#x9B2;&#x9C1; &#x995;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9A6;&#x9C1;&#x987; &#x9B2;&#x9BE;&#x987;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> builtins
<span class="hljs-meta">&gt;&gt;&gt; </span>dir(builtins)
</code></pre>
<p>dir() &#x9A8;&#x9BF;&#x99C;&#x9C7;&#x993; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;&#x987;&#x9A8; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;, &#x9AF;&#x9BE;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9B2;&#x9C7; &#x993;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x995;&#x9C0; &#x997;&#x9CD;&#x9B2;&#x9C7;&#x9BE;&#x9AC;&#x9BE;&#x9B2; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;, &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;, &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF; &#x986;&#x99B;&#x9C7; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9B8;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9C7;&#x964;</p>
<h2 id="&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9A1;&#x9BE;&#x9B0;&#x9CD;&#x9A1;-&#x9B2;&#x9BE;&#x987;&#x9AC;&#x9CD;&#x9B0;&#x9C7;&#x9B0;&#x9BF;-standard-library">&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9A1;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9B2;&#x9BE;&#x987;&#x9AC;&#x9CD;&#x9B0;&#x9C7;&#x9B0;&#x9BF; (Standard Library)</h2>
<p> &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;&#x987;&#x9A8; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x99B;&#x9BE;&#x9DC;&#x9BE;&#x993; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, math &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF; &#x9AE;&#x9C7;&#x9D7;&#x9B2;&#x9BF;&#x995; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9C7;&#x996;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF;&#x964; &#x98F;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;, import math&#x964; &#x98F;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x99F;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9A1;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9B2;&#x9BE;&#x987;&#x9AC;&#x9CD;&#x9B0;&#x9C7;&#x9B0;&#x9BF;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x964; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x987; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x995;&#x9BF;&#x99B;&#x9C1; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x9A7;&#x9CD;&#x9B0;&#x9C1;&#x9AC;&#x995; (constant)-&#x993; &#x9B8;&#x982;&#x99C;&#x9CD;&#x99E;&#x9BE;&#x9DF;&#x9BF;&#x9A4; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x995;&#x9BF;&#x99B;&#x9C1; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x996;&#x9BF; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> math
<span class="hljs-meta">&gt;&gt;&gt; </span>math.pi
<span class="hljs-number">3.141592653589793</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>math.pow(<span class="hljs-number">2</span>, <span class="hljs-number">3</span>)
<span class="hljs-number">8.0</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>math.pow(<span class="hljs-number">3</span>, <span class="hljs-number">2</span>)
<span class="hljs-number">9.0</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>math.sqrt(<span class="hljs-number">25</span>)
<span class="hljs-number">5.0</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>math.floor(<span class="hljs-number">5.2</span>)
<span class="hljs-number">5</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>math.ceil(<span class="hljs-number">5.2</span>)
<span class="hljs-number">6</span>
</code></pre>
<p>math &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x995;&#x9C0; &#x995;&#x9C0; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x986;&#x99B;&#x9C7; &#x98F;&#x9AC;&#x982; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x995;&#x9BE;&#x99C; &#x995;&#x9C0;, &#x9A4;&#x9BE; &#x9AA;&#x9C1;&#x9B0;&#x9C7;&#x9BE;&#x9AA;&#x9C1;&#x9B0;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x9B9;&#x9B2;&#x9C7; &#x9A1;&#x995;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x993;&#x9DF;&#x9C7;&#x9AC;&#x9B8;&#x9BE;&#x987;&#x99F;&#x9C7; &#x9A1;&#x995;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7; (<a href="https://docs.python.org/3/library/math.html/" target="_blank">https://docs.python.org/3/library/math.html\</a>) &#x986;&#x9AC;&#x9BE;&#x9B0; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9A1;&#x9BE;&#x989;&#x9A8;&#x9B2;&#x9C7;&#x9BE;&#x9A1;&#x993; &#x995;&#x9B0;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; math &#x99B;&#x9BE;&#x9DC;&#x9BE;&#x993; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x987;&#x9A4;&#x9BF;&#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9AC;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE; &#x9AC;&#x987;&#x9A4;&#x9C7; turtle, random, timeit &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x995;&#x9DF;&#x9C7;&#x995;&#x99F;&#x9BF; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x987;&#x964;</p>
<p>&#x9A6;&#x9BF;&#x9A8;-&#x9A4;&#x9BE;&#x9B0;&#x9BF;&#x996; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C;-&#x995;&#x9B0;&#x9CD;&#x9AE; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x99B;&#x9C7; datetime &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x964; &#x98F;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x986;&#x99B;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B8;&#x9C7;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x986;&#x99C;&#x995;&#x9C7;&#x9B0; &#x9A4;&#x9BE;&#x9B0;&#x9BF;&#x996; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; datetime &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; date &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; today() &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x995;&#x9C7; &#x995;&#x9B2; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> datetime
<span class="hljs-meta">&gt;&gt;&gt; </span>today = datetime.date.today()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(today)
<span class="hljs-number">2017</span><span class="hljs-number">-06</span><span class="hljs-number">-10</span>
</code></pre>
<p>&#x986;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x986;&#x99C;&#x995;&#x9C7;&#x9B0; &#x9A4;&#x9BE;&#x9B0;&#x9BF;&#x996; &#x993; &#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9AE;&#x9BE;&#x9A8; &#x9B8;&#x9AE;&#x9DF; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x996;&#x9A8; datetime &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; datetime &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; today() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x995;&#x9B2; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> datetime
<span class="hljs-meta">&gt;&gt;&gt; </span>today = datetime.datetime.today()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(today)
<span class="hljs-number">2017</span><span class="hljs-number">-06</span><span class="hljs-number">-10</span> <span class="hljs-number">15</span>:<span class="hljs-number">51</span>:<span class="hljs-number">28.951772</span>
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9BE;&#x9AE; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;, &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x99F;, &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;, &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x99F; &#x993; &#x9B8;&#x9AC;&#x9B6;&#x9C7;&#x9B7;&#x9C7; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x995;&#x9B2; &#x995;&#x9B0;&#x99B;&#x9BF;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x99F;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9A4;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9A1;&#x99F; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9A4;&#x9C7;&#x9BE; &#x98F;&#x9AC;&#x982; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;, &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;, &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9A4;&#x9C7;&#x9BE;&#x964; &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE;, package_name.module_name.function_name() &#x986;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x995;&#x9C7; &#x995;&#x9B2; &#x995;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; package_name.module_name.class_name.function_name()&#x964;</p>
<p>&#x986;&#x997;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; datetime &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x995;&#x9C7;&#x9AC;&#x9B2; datetime &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x99F;&#x9BF; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9A4;&#x9BE;&#x9AE;&#x964; &#x9A4;&#x996;&#x9A8; datetime.today() &#x9B2;&#x9BF;&#x996;&#x9B2;&#x9C7;&#x987; &#x995;&#x9BE;&#x99C; &#x9B9;&#x9DF;&#x9C7; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> datetime <span class="hljs-keyword">import</span> datetime
<span class="hljs-meta">&gt;&gt;&gt; </span>d = datetime.today()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(d)
<span class="hljs-number">2017</span><span class="hljs-number">-06</span><span class="hljs-number">-10</span> <span class="hljs-number">17</span>:<span class="hljs-number">08</span>:<span class="hljs-number">56.428959</span>
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x993;&#x9DF;&#x9C7;&#x9AC;&#x9B8;&#x9BE;&#x987;&#x99F;, &#x993;&#x9DF;&#x9C7;&#x9AC; &#x9AC;&#x9CD;&#x9B0;&#x9BE;&#x989;&#x99C;&#x9BE;&#x9B0;&#x9C7;&#x9B0; &#x9AE;&#x9BE;&#x9A7;&#x9CD;&#x9AF;&#x9AE;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF;&#x993; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7; webbrowser &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> webbrowser
<span class="hljs-meta">&gt;&gt;&gt; </span>url = <span class="hljs-string">&quot;http://subeen.com&quot;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>webbrowser.open(url)
<span class="hljs-keyword">True</span>
</code></pre>
<p>webbrowser &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; open() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x993;&#x9DF;&#x9C7;&#x9AC;&#x9B8;&#x9BE;&#x987;&#x99F; &#x993;&#x9AA;&#x9C7;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; webbrowser &#x9B6;&#x9AC;&#x9CD;&#x9A6;&#x99F;&#x9BF; &#x9AA;&#x9C1;&#x9B0;&#x9CB;&#x99F;&#x9BE; &#x9AC;&#x9BE;&#x9B0; &#x9AC;&#x9BE;&#x9B0; &#x99F;&#x9BE;&#x987;&#x9AA; &#x995;&#x9B0;&#x9BE; &#x985;&#x9A8;&#x9C7;&#x995;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99B;&#x9C7; &#x9AC;&#x9BF;&#x9B0;&#x995;&#x9CD;&#x9A4;&#x9BF;&#x995;&#x9B0; &#x9B2;&#x9BE;&#x997;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B6;&#x9B0;&#x9CD;&#x99F;&#x995;&#x9BE;&#x99F;&#x993; &#x986;&#x99B;&#x9C7;, &#x9AF;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x98F;&#x9B2;&#x9BF;&#x9DF;&#x9BE;&#x9B8;&#x9BF;&#x982; (aliasing)&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9C7;&#x987; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> webbrowser <span class="hljs-keyword">as</span> wb
<span class="hljs-meta">&gt;&gt;&gt; </span>url = <span class="hljs-string">&quot;http://subeen.com&quot;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>wb.open(url)
<span class="hljs-keyword">True</span>
</code></pre>
<p>&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9A1;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9B2;&#x9BE;&#x987;&#x9AC;&#x9CD;&#x9B0;&#x9C7;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x995;&#x9C0; &#x995;&#x9C0; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x993; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C; &#x986;&#x99B;&#x9C7;, &#x9A4;&#x9BE; &#x99C;&#x9BE;&#x9A8;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; : <a href="https://docs.python.org/3/library/index.html।" target="_blank">https://docs.python.org/3/library/index.html&#x964;</a> &#x985;&#x9AC;&#x9B8;&#x9B0; &#x9B8;&#x9AE;&#x9DF;&#x9C7; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x9AA;&#x9DC;&#x9BE;&#x9B6;&#x9C7;&#x9BE;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;, &#x9A4;&#x9AC;&#x9C7; &#x9A4;&#x9BE;&#x9DC;&#x9BE;&#x9B9;&#x9C1;&#x9DC;&#x9C7;&#x9BE; &#x9A8;&#x9C7;&#x987;&#x964; &#x986;&#x9B0; &#x9B8;&#x9AC; &#x9B2;&#x9BE;&#x987;&#x9AC;&#x9CD;&#x9B0;&#x9C7;&#x9B0;&#x9BF;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0;&#x993; &#x9B6;&#x9C7;&#x996;&#x9BE;&#x9B0; &#x9AC;&#x9BE; &#x9AE;&#x9C1;&#x996;&#x9B8;&#x9CD;&#x9A5; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9A8;&#x9C7;&#x987;&#x964; &#x9B8;&#x9AE;&#x9DF;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8;&#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9AE;&#x9A8;&#x9BF;&#x9A4;&#x9C7;&#x987; &#x9B6;&#x9BF;&#x996;&#x9C7; &#x9A8;&#x9C7;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<p>&#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AE;&#x9BE;&#x99D;&#x9C7;-&#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x98F;&#x9AE;&#x9A8; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9AA;&#x9B0;&#x9AC;&#x9C7;, &#x9AF;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x995;&#x9C7;&#x989; &#x98F;&#x995;&#x99C;&#x9A8; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9AC;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9B0;&#x9C7;&#x996;&#x9C7;&#x99B;&#x9C7;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9A1;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9B2;&#x9BE;&#x987;&#x9AC;&#x9CD;&#x9B0;&#x9C7;&#x9B0;&#x9BF; &#x985;&#x9A8;&#x9CD;&#x9A4;&#x9B0;&#x9CD;&#x9AD;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x9A8;&#x9DF;&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9B2;&#x9C7; &#x9A5;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C; &#x9AC;&#x9BE; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9B2;&#x9C7; &#x995;&#x9AE;&#x9CD;&#x9AA;&#x9BF;&#x989;&#x99F;&#x9BE;&#x9B0;&#x9C7; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x964; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9AA;&#x9B0;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9BF; &#x985;&#x982;&#x9B6;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE;, &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9A5;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x993; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x964;</p>
<h2 id="&#x9A8;&#x9A4;&#x9C1;&#x9A8;-&#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;-&#x9A4;&#x9C8;&#x9B0;&#x9BF;-&#x995;&#x9B0;&#x9BE;">&#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;</h2>
<p>&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE; &#x9AC;&#x987;&#x9DF;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;, &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AB;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x9A8;&#x9BE;&#x99A;&#x9CD;&#x99A;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x964; n-&#x9A4;&#x9AE; &#x9AB;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x9A8;&#x9BE;&#x99A;&#x9CD;&#x99A;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x996;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">find_fib</span><span class="hljs-params">(n)</span>:</span>
    <span class="hljs-keyword">if</span> n &lt;= <span class="hljs-number">2</span>:
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>
    fib_x, fib_next = <span class="hljs-number">1</span>, <span class="hljs-number">1</span>

    i = <span class="hljs-number">3</span>
    <span class="hljs-keyword">while</span> i &lt;= n:
        i += <span class="hljs-number">1</span>
        fib_x, fib_next = fib_next, fib_x + fib_next

    <span class="hljs-keyword">return</span> fib_next

<span class="hljs-keyword">for</span> x <span class="hljs-keyword">in</span> range(<span class="hljs-number">1</span>, <span class="hljs-number">11</span>):
    print(find_fib(x))
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; find_fib() &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;, &#x9AF;&#x9C7;&#x99F;&#x9BF;&#x9B0; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; n &#x98F;&#x9AC;&#x982; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; n-&#x9A4;&#x9AE; &#x9AB;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x9A8;&#x9BE;&#x99A;&#x9CD;&#x99A;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9C1;&#x9AA; &#x99A;&#x9BE;&#x9B2;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x993;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x995;&#x9B2; &#x995;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9A6;&#x9B6;&#x99F;&#x9BF; &#x9AB;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x9A8;&#x9BE;&#x99A;&#x9CD;&#x99A;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; - &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9A6;&#x9B6;&#x99F;&#x9BF; &#x9AB;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x9A8;&#x9BE;&#x99A;&#x9CD;&#x99A;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; :</p>
<pre><code>$ python fibo.py 
1
1
2
3
5
8
13
21
34
55
</code></pre><p>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0; :</p>
<ul>
<li>&#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; return fib_next &#x9A8;&#x9BE; &#x9B2;&#x9BF;&#x996;&#x9C7; return fib_x &#x9B2;&#x9BF;&#x996;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x9B9;&#x9A4;&#x9C7;&#x9BE;? &#x98F;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x995;&#x99F;&#x9C1; &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BE;&#x9AD;&#x9BE;&#x9AC;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>&#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9AF;&#x9BE;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; n &#x9A8;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x98F;&#x9AC;&#x982; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; n-&#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x995; &#x9AB;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x9A8;&#x9BE;&#x99A;&#x9CD;&#x99A;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9BE;&#x964; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9AF;&#x9A6;&#x9BF; &#x9B9;&#x9DF; list_fib(), &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; print(list_fib(10)) &#x9B2;&#x9BF;&#x996;&#x9B2;&#x9C7; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; :</li>
</ul>
<p><code>[1, 1, 2, 3, 5, 8, 13, 21, 34, 55]</code></p>
<p>list_fib() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF;&#x993; &#x986;&#x9AE;&#x9B0;&#x9BE; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x985;&#x9A7;&#x9BF;&#x995;&#x9BE;&#x982;&#x9B6; &#x9AA;&#x9BE;&#x9A0;&#x995;&#x9C7;&#x9B0;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x998;&#x9A3;&#x9CD;&#x99F;&#x9BE;&#x996;&#x9BE;&#x9A8;&#x9C7;&#x995; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;, &#x9A4;&#x9BE;&#x9A4;&#x9C7; &#x9B9;&#x9A4;&#x9BE;&#x9B6; &#x9B9;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9A8;&#x9C7;&#x987;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x9AF;&#x9C7; &#x9AF;&#x9A4; &#x9AC;&#x9C7;&#x9B6;&#x9BF; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9AC;&#x9C7;, &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BE;&#x9AD;&#x9BE;&#x9AC;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x9AC;&#x9C7;, &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;, &#x9A4;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE; &#x9A4;&#x9A4; &#x9AD;&#x9BE;&#x9B2;&#x9C7;&#x9BE; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x98F;&#x995;-&#x9A6;&#x9C1;&#x987; &#x998;&#x9A3;&#x9CD;&#x99F;&#x9BE; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9C7;&#x993; list_fib() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x9B2;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9A8;&#x9BE; &#x9AA;&#x9BE;&#x9B0;&#x9B2;&#x9C7; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x986;&#x997;&#x9BE;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x986;&#x9AE;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x98F;&#x995;&#x99F;&#x9C1; &#x9AA;&#x9B0;&#x9C7;&#x987; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9A6;&#x9BF;&#x9DF;&#x9C7;&#x99B;&#x9BF;&#x964;</p>
<p>&#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9B0; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9A6;&#x9BE;&#x981;&#x9DC;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code class="lang-py">
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">find_fib</span><span class="hljs-params">(n)</span>:</span>
    <span class="hljs-keyword">if</span> n &lt;= <span class="hljs-number">2</span>:
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>

    fib_x, fib_next = <span class="hljs-number">1</span>, <span class="hljs-number">1</span>

    i = <span class="hljs-number">3</span>
    <span class="hljs-keyword">while</span> i &lt;= n:
        i += <span class="hljs-number">1</span>
        fib_x, fib_next = fib_next, fib_x + fib_next

    <span class="hljs-keyword">return</span> fib_next


<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">list_fib</span><span class="hljs-params">(n)</span>:</span>
    fib_list = [<span class="hljs-number">1</span>, <span class="hljs-number">1</span>]
    <span class="hljs-keyword">if</span> n &lt;= <span class="hljs-number">2</span>:
        <span class="hljs-keyword">return</span> fib_list[:n]

    fib_x, fib_next = <span class="hljs-number">1</span>, <span class="hljs-number">1</span>

    i = <span class="hljs-number">3</span>
    <span class="hljs-keyword">while</span> i &lt;= n:
        i += <span class="hljs-number">1</span>
        fib_x, fib_next = fib_next, fib_x + fib_next
        fib_list.append(fib_next)

    <span class="hljs-keyword">return</span> fib_list


<span class="hljs-keyword">for</span> x <span class="hljs-keyword">in</span> range(<span class="hljs-number">1</span>, <span class="hljs-number">11</span>):
    print(find_fib(x))

print(list_fib(<span class="hljs-number">1</span>))
print(list_fib(<span class="hljs-number">2</span>))
print(list_fib(<span class="hljs-number">10</span>))
</code></pre>
<p>&#x98F;&#x9AC;&#x9BE;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x995;&#x9BE;&#x99C; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9CB;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x99C; &#x9A8;&#x9BF;&#x99C; &#x995;&#x9AE;&#x9CD;&#x9AA;&#x9BF;&#x989;&#x99F;&#x9BE;&#x9B0;&#x9C7; &#x99F;&#x9BE;&#x987;&#x9AA; &#x995;&#x9B0;&#x9C7; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x964; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code>$ python fibo.py 
1
1
2
3
5
8
13
21
34
55
[1]
[1, 1]
[1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
</code></pre><p>&#x986;&#x9AE;&#x9BF; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x9B6;&#x9CD;&#x99A;&#x9BF;&#x9A4; &#x9B9;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF; &#x9AF;&#x9C7;, &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9A0;&#x9BF;&#x995;&#x9A0;&#x9BE;&#x995; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9C7;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9AF;&#x9C7; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF; &#x9AC;&#x9BE; &#x9AB;&#x9C7;&#x9BE;&#x9B2;&#x9CD;&#x9A1;&#x9BE;&#x9B0;&#x9C7; &#x986;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x987;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, program.py &#x986;&#x9B0; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE; :</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> fibo

print(<span class="hljs-string">&quot;Hello, I am inside program.py!&quot;</span>)

n = fibo.find_fib(<span class="hljs-number">15</span>)

print(<span class="hljs-string">&quot;15th fibonacci number is,&quot;</span>, n)
</code></pre>
<p>&#x98F;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x986;&#x9B8;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;? &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; &#x98F;&#x995;&#x9CD;&#x9B8;&#x99F;&#x9C7;&#x9A8;&#x9B6;&#x9A8; .py &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8; &#x9A8;&#x9C7;&#x987;, &#x9A4;&#x9BE;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF; import fibo&#x964; &#x98F;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x989;&#x9A6;&#x9CD;&#x9A6;&#x9C7;&#x9B6;&#x9CD;&#x9AF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9AF;&#x9C7;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AF;&#x9C7;&#x9A8; &#x986;&#x9AE;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x986;&#x99B;&#x9C7; - find_fib() &#x993; list_fib()&#x964; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9A6;&#x9C1;&#x99F;&#x9BF;&#x995;&#x9C7; &#x995;&#x9B2; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9AF;&#x9A5;&#x9BE;&#x995;&#x9CD;&#x9B0;&#x9AE;&#x9C7; fibo.find_fib() &#x993; fibo.list_fib()&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x9A4;&#x9C3;&#x9A4;&#x9C0;&#x9DF; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF; n = fibo.find_fib(15), &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; &#x986;&#x9AE;&#x9BF; 15-&#x9A4;&#x9AE; &#x9AB;&#x9BF;&#x9AC;&#x9C7;&#x9BE;&#x9A8;&#x9BE;&#x99A;&#x9CD;&#x99A;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9C7;, &#x9B8;&#x9C7;&#x987; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9BF; n-&#x98F;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x99B;&#x9BF;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x99B;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BF;, &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x995;&#x9C0; &#x986;&#x9B8;&#x9C7;?</p>
<pre><code class="lang-py">$ python program.py 
<span class="hljs-number">1</span>
<span class="hljs-number">1</span>
<span class="hljs-number">2</span>
<span class="hljs-number">3</span>
<span class="hljs-number">5</span>
<span class="hljs-number">8</span>
<span class="hljs-number">13</span>
<span class="hljs-number">21</span>
<span class="hljs-number">34</span>
<span class="hljs-number">55</span>
[<span class="hljs-number">1</span>]
[<span class="hljs-number">1</span>, <span class="hljs-number">1</span>]
[<span class="hljs-number">1</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">5</span>, <span class="hljs-number">8</span>, <span class="hljs-number">13</span>, <span class="hljs-number">21</span>, <span class="hljs-number">34</span>, <span class="hljs-number">55</span>]
Hello, I am inside program.py!
<span class="hljs-number">15</span>th fibonacci number <span class="hljs-keyword">is</span>, <span class="hljs-number">610</span>
</code></pre>
<p>&#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B2;&#x9BE;&#x987;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x995;&#x9A5;&#x9BE;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A0;&#x9BF;&#x995;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9A4;&#x9BE;&#x9B0; &#x986;&#x997;&#x9C7; &#x986;&#x9AC;&#x9BE;&#x9B0; fibo.py &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; &#x9AF;&#x9BE; &#x9AF;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9A6;&#x9BF;&#x9DF;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x993; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x995;&#x9C7;&#x9A8; &#x98F;&#x9AE;&#x9A8; &#x9B9;&#x9B2;&#x9C7;&#x9BE;? &#x98F;&#x995;&#x99F;&#x9C1; &#x9A4;&#x9A6;&#x9A8;&#x9CD;&#x9A4; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x995;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; program.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;, &#x9B6;&#x9C7;&#x9B7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9AC;&#x9BE;&#x9A6; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9A6;&#x9C7;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9B9;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> fibo

print(<span class="hljs-string">&quot;Hello, I am inside program.py!&quot;</span>)
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code>$ python program.py 
1
1
2
3
5
8
13
21
34
55
[1]
[1, 1]
[1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
Hello, I am inside program.py!
</code></pre><p>&#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x99B;&#x9BF;, &#x9AF;&#x996;&#x9A8;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; import fibo &#x9B2;&#x9BF;&#x996;&#x99B;&#x9BF;, &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x995;&#x9B0;&#x99B;&#x9C7; &#x995;&#x9C0;, fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x99B;&#x9C7;, &#x9A4;&#x9BE;&#x987; &#x993;&#x987; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9C7;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F;&#x993; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;&#x964;</p>
<p>&#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; (module)&#x964; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7; &#x9B8;&#x9BE;&#x9A7;&#x9BE;&#x9B0;&#x9A3;&#x9A4; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AD;&#x9C7;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x993; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A1;&#x9C7;&#x9AB;&#x9BF;&#x9A8;&#x9C7;&#x9B6;&#x9A8; &#x9A5;&#x9BE;&#x995;&#x9C7;&#x964; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x993; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7; (&#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9B8;&#x9AE;&#x9CD;&#x9AA;&#x9B0;&#x9CD;&#x995;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9AA;&#x9B0;&#x9C7; &#x99C;&#x9BE;&#x9A8;&#x9AC;&#x9C7;&#x9BE;)&#x964; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x99F;&#x9BF; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9C7; &#x9A4;&#x9BE;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7;&#x9B0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x98F;&#x995;&#x99F;&#x9C1; &#x986;&#x997;&#x9C7;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A4;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9C7;&#x99B;&#x9BF;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9B7;&#x9DF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AD;&#x9BE;&#x9AC;&#x9BF;&#x9DF;&#x9C7; &#x9A4;&#x9C1;&#x9B2;&#x99B;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987; &#x9AF;&#x9C7;, fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x9B8;&#x9B0;&#x9BE;&#x9B8;&#x9B0;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AF;&#x9C7;&#x9A8; &#x9A4;&#x9BE;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9B2; &#x995;&#x9B0;&#x9C7; &#x9AF;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x99A;&#x9B2;&#x9AC;&#x9C7;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x985;&#x9A8;&#x9CD;&#x9AF; &#x9AB;&#x9BE;&#x987;&#x9B2; &#x9A5;&#x9C7;&#x995;&#x9C7; fibo-&#x995;&#x9C7; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x993;&#x987; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x99A;&#x9B2;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964; &#x98F;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x997;&#x9CD;&#x9B2;&#x9C7;&#x9BE;&#x9AC;&#x9BE;&#x9B2; (global) &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x9B0; &#x9B8;&#x9BE;&#x9B9;&#x9BE;&#x9AF;&#x9CD;&#x9AF; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9AF;&#x9BE;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, __name__&#x964; &#x986;&#x9B0; &#x98F;&#x987; &#x997;&#x9CD;&#x9B2;&#x9C7;&#x9BE;&#x9AC;&#x9BE;&#x9B2; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x99F;&#x9BF; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A8;&#x9BF;&#x99C;&#x9C7;&#x9B0;&#x9BE; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;, &#x9AA;&#x9CD;&#x9B0;&#x9CB;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A5;&#x9C7;&#x995;&#x9C7;&#x987; &#x98F;&#x9B0; &#x9AE;&#x9BE;&#x9A8; &#x9A0;&#x9BF;&#x995; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x9DF;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; trial.py &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x987;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x98F;&#x995; &#x9B2;&#x9BE;&#x987;&#x9A8; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; fibo.py &#x993; program.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9AF;&#x9C7; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x986;&#x99B;&#x9C7;, trial.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF;&#x993; &#x9B8;&#x9C7;&#x987; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py">print(<span class="hljs-string">&quot;My name is&quot;</span>, __name__)
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9BF; :</p>
<pre><code>$ python trial.py 
My name is __main__
</code></pre><p>&#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A4;&#x9C7;&#x9BE; &#x9B9;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9A5;&#x9BE; &#x99B;&#x9BF;&#x9B2; trial, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x99B;&#x9BF; __main__&#x964; &#x98F;&#x9B0; &#x995;&#x9BE;&#x9B0;&#x9A3; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9AF;&#x996;&#x9A8; trial.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9B8;&#x9B0;&#x9BE;&#x9B8;&#x9B0;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x99B;&#x9BF;, &#x9A4;&#x996;&#x9A8; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9A4;&#x9BE;&#x995;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9AC;&#x9BF;&#x9AC;&#x9C7;&#x99A;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x99B;&#x9C7; &#x9A8;&#x9BE;, &#x9A4;&#x9BE;&#x987; &#x9A4;&#x9BE;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7; __main__&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; program.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; trial &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> trial

print(<span class="hljs-string">&quot;Hello, I am inside program.py!&quot;</span>)
print(trial.__name__)
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code>$ python program.py 
My name is trial
Hello, I am inside program.py!
trial
</code></pre><p>&#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x9AF;&#x996;&#x9A8; import trial &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF;, &#x9A4;&#x996;&#x9A8; trial.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9C7; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x9A6;&#x9BF;&#x9DF;&#x9C7;&#x99B;&#x9C7; My name is trial&#x964; &#x98F;&#x996;&#x9A8; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B8;&#x9C7; &#x9A4;&#x9BE;&#x9B0; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A0;&#x9BF;&#x995;&#x9A0;&#x9BE;&#x995; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9B2;&#x9C7;&#x9BE;&#x964; &#x995;&#x9BE;&#x9B0;&#x9A3; &#x985;&#x9A8;&#x9CD;&#x9AF; &#x995;&#x9C7;&#x989; &#x9A4;&#x9BE;&#x995;&#x9C7; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF; &#x9AF;&#x9C7; &#x9AC;&#x9BE;&#x987;&#x9B0;&#x9C7; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9B8;&#x9A0;&#x9BF;&#x995; &#x9A8;&#x9BE;&#x9AE; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9DF;, &#x986;&#x9B0; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9B8;&#x9B0;&#x9BE;&#x9B8;&#x9B0;&#x9BF; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9B2;&#x9C7; &#x9A8;&#x9BE;&#x9AE; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9DF; __main__&#x964; &#x98F;&#x987; &#x9AC;&#x9CD;&#x9AF;&#x9BE;&#x9AA;&#x9BE;&#x9B0;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9BE;&#x99C;&#x9C7; &#x9B2;&#x9BE;&#x997;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x9AE;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B8;&#x9CD;&#x9A5;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; &#x9AF;&#x9C7;&#x9A8; trial.py &#x9B8;&#x9B0;&#x9BE;&#x9B8;&#x9B0;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; Hello from trial &#x995;&#x9A5;&#x9BE;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9AC;&#x9C7;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AC;&#x9BE;&#x987;&#x9B0;&#x9C7; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x98F;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964; trial.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B9;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code class="lang-py"><span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&quot;__main__&quot;</span>:
    print(<span class="hljs-string">&quot;Hello from trial&quot;</span>)
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9BF; :</p>
<pre><code>$ python trial.py 
Hello from trial
</code></pre><p>&#x98F;&#x9AC;&#x9BE;&#x9B0;&#x9C7; program.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9BF; :</p>
<pre><code>$ python program.py 
Hello, I am inside program.py!
trial
</code></pre><p>&#x98F;&#x996;&#x9A8; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9B0; trial.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; print &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x99B;&#x9C7; &#x9A8;&#x9BE;, &#x995;&#x9BE;&#x9B0;&#x9A3; if &#x995;&#x9A8;&#x9CD;&#x9A1;&#x9BF;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; __name__ -&#x98F;&#x9B0; &#x9AE;&#x9BE;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; trial, &#x9A4;&#x9BE;&#x987; &#x9B6;&#x9B0;&#x9CD;&#x9A4;&#x99F;&#x9BF; &#x9AE;&#x9BF;&#x9A5;&#x9CD;&#x9AF;&#x9BE; &#x9B9;&#x9DF;&#x9C7; &#x9AF;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7;&#x964;</p>
<p><strong>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0;&#x983; </strong>fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x98F;&#x9AE;&#x9A8;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9AF;&#x9C7;&#x9A8; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x986;&#x995;&#x9BE;&#x9B0;&#x9C7; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9B0; &#x9B6;&#x9C7;&#x9B7;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9DF;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; fibo.py &#x9AB;&#x9BE;&#x987;&#x9B2;&#x99F;&#x9BF; &#x9B8;&#x9B0;&#x9BE;&#x9B8;&#x9B0;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9AF;&#x9C7;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9DF;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9A4;&#x995;&#x9CD;&#x9B7;&#x9A3; &#x9B8;&#x9AC;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AB;&#x9BE;&#x987;&#x9B2; &#x98F;&#x995;&#x987; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9B0;&#x9C7;&#x996;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964; &#x9A4;&#x9BE;&#x9B0; &#x995;&#x9BE;&#x9B0;&#x9A3; &#x995;&#x9C0;? &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; &#x9AF;&#x996;&#x9A8; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;, &#x9A4;&#x996;&#x9A8; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x99C;&#x9BE;&#x9A8;&#x9AC;&#x9C7; &#x9AF;&#x9C7;, &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x995;&#x9C7;&#x9BE;&#x9A8; &#x99C;&#x9BE;&#x9DF;&#x997;&#x9BE;&#x9DF; &#x986;&#x99B;&#x9C7;? &#x9AF;&#x996;&#x9A8; &#x995;&#x9CB;&#x9A8;&#x9CB; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9AE;&#x9AA;&#x9CB;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF; &#x9A4;&#x996;&#x9A8; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x996;&#x9C1;&#x981;&#x99C;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x993;&#x987; &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x995;&#x9CB;&#x9A8;&#x9CB; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;-&#x987;&#x9A8; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x986;&#x99B;&#x9C7; &#x995;&#x9BF; &#x9A8;&#x9BE;&#x964; &#x993;&#x987; &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x995;&#x9CB;&#x9A8;&#x9CB; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;-&#x987;&#x9A8; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9B2;&#x9C7; &#x9A4;&#x9BE;&#x9B0; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x99A; &#x9AA;&#x9BE;&#x9A5;&#x9C7;&#x9B0; &#x9B8;&#x9AC;&#x997;&#x9C1;&#x9B2;&#x9CB; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF; &#x993; &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9B8;&#x9BE;&#x9AC;-&#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x98F;&#x995;&#x9C7; &#x98F;&#x995;&#x9C7; &#x996;&#x9C1;&#x981;&#x99C;&#x9A4;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9C7; &#x9AF;&#x9C7;, &#x9B8;&#x9C7;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x99F;&#x9BF; &#x9AA;&#x9BE;&#x993;&#x9DF;&#x9BE; &#x9AF;&#x9BE;&#x9DF; &#x995;&#x9BF; &#x9A8;&#x9BE;&#x964; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x99A; &#x9AA;&#x9BE;&#x9A5; (search path) &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AE;&#x9C2;&#x9B2;&#x9A4; &#x985;&#x9A8;&#x9C7;&#x995;&#x997;&#x9C1;&#x9B2;&#x9CB; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A4;&#x9BE;&#x9B2;&#x9BF;&#x995;&#x9BE; &#x9AC;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x964; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x99A; &#x9AA;&#x9BE;&#x9A5;&#x9C7;&#x9B0; &#x9A4;&#x9BE;&#x9B2;&#x9BF;&#x995;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x98F;&#x9B2;&#x9BF;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9AC;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &apos;&apos;, &#x9AF;&#x9C7;&#x99F;&#x9BE; &#x9AC;&#x9CB;&#x99D;&#x9BE;&#x9DF; &#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9AE;&#x9BE;&#x9A8; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF; (&#x995;&#x9BE;&#x9B0;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x993;&#x9DF;&#x9BE;&#x9B0;&#x9CD;&#x995;&#x9BF;&#x982; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF; - <strong>c</strong>urrent <strong>w</strong>orking <strong>d</strong>irectory &#x9AC;&#x9BE; cwd), &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;&#x964; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x99A; &#x9AA;&#x9BE;&#x9A5;&#x9C7;&#x9B0; &#x9B8;&#x9AC;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> sys
<span class="hljs-meta">&gt;&gt;&gt; </span>sys.path
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-comment"># &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7;</span>
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x99F;&#x9BF; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x99A; &#x9AA;&#x9BE;&#x9A5;&#x9C7;&#x9B0; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9B0;&#x9C7;&#x996;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AA;&#x9B0;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9BF; &#x9B8;&#x9AE;&#x9DF;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9B8;&#x9C7;&#x99F;&#x9BF;&#x995;&#x9C7; &#x9B8;&#x9B9;&#x99C;&#x9C7; &#x996;&#x9C1;&#x981;&#x99C;&#x9C7; &#x9AA;&#x9BE;&#x9AC;&#x9C7;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x9AE;&#x9A8; &#x9B9;&#x9DF; &#x9AF;&#x9C7;, &#x986;&#x9AE;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9AC;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;, &#x9AF;&#x9BE; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x985;&#x9A8;&#x9C7;&#x995; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BE;&#x9B0;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C;&#x9C7; &#x9B2;&#x9BE;&#x997;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; &#x9B8;&#x9C7;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9AC;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x99F;&#x9BF; &#x9AA;&#x9BE;&#x9AC;&#x9B2;&#x9BF;&#x9B6; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9A4;&#x9AC;&#x9C7; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;&#x964; &#x995;&#x9BE;&#x9B0;&#x9C7;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8; &#x9B9;&#x9B2;&#x9C7; &#x9B8;&#x9C7; &#x9B6;&#x9BF;&#x996;&#x9C7; &#x9A8;&#x9C7;&#x9AC;&#x9C7;, &#x986;&#x9AE;&#x9BF; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x99F;&#x9BF; &#x99C;&#x9BE;&#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9B2;&#x9BE;&#x9AE; &#x9AE;&#x9BE;&#x9A4;&#x9CD;&#x9B0;&#x964;</p>
<p>&#x9A8;&#x9CB;&#x99F;: &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9AF;&#x9A6;&#x9BF; &#x9AC;&#x9C7;&#x9B6; &#x9AC;&#x9DC;&#x9B8;&#x9DC; &#x9B9;&#x9DF;&#x9C7; &#x9AF;&#x9BE;&#x9DF;, &#x9A4;&#x996;&#x9A8; &#x9A4;&#x9BE;&#x995;&#x9C7; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9AD;&#x9C7;&#x999;&#x9CD;&#x997;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9B0;&#x9C7;&#x996;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C; &#x9A4;&#x9C8;&#x9B0;&#x9C0; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;, &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;, &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;; &#x9A4;&#x9C7;&#x9AE;&#x9A8;&#x9BF;, &#x98F;&#x995;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x9AB;&#x9BE;&#x987;&#x9B2; &#x9AC;&#x9BE; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;, &#x9B8;&#x9BE;&#x9AC;-&#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF; (&#x9AF;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9B8;&#x9BE;&#x9AC;-&#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x993; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF;) &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x9C7;&#x9B0; &#x9AE;&#x9C2;&#x9B2; &#x9A1;&#x9BF;&#x9B0;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9B0;&#x9BF;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; __init__.py &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x987;&#x9B2; &#x9A4;&#x9C8;&#x9B0;&#x9C0; &#x995;&#x9B0;&#x9C7; &#x9A4;&#x9BE;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9DF;, &#x98F;&#x987; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x995;&#x9C0; &#x995;&#x9C0; &#x9B8;&#x9BE;&#x9AC;-&#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99C; &#x993; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="set-dictionary-python.html" class="navigation navigation-prev " aria-label="Previous page: পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="object-class-python.html" class="navigation navigation-next " aria-label="Next page: অবজেক্ট ও ক্লাস">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"মডিউল ও প্যাকেজ","level":"1.12","depth":1,"next":{"title":"অবজেক্ট ও ক্লাস","level":"1.13","depth":1,"path":"object-class-python.md","ref":"object-class-python.md","articles":[]},"previous":{"title":"পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি","level":"1.11","depth":1,"path":"set-dictionary-python.md","ref":"set-dictionary-python.md","articles":[]},"dir":"ltr"},"config":{"plugins":[""],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Tamim Shahriar","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"পাইথন প্রোগ্রামিং","language":"bn","links":{"sidebar":{"পাইথন প্রোগ্রামিং":"https://www.gitbook.com/book/subeen/python-programming-bangla"},"gitbook":true},"gitbook":"*","description":"পাইথন প্রোগ্রামিং ভাষা (ভার্শন ৩) শেখার বাংলা বই। বইটি প্রোগ্রামিংয়ে যারা নতুন, তাদের জন্য উপযোগি। এছাড়া যারা অন্য প্রোগ্রামিং ভাষা জানে কিন্তু পাইথন শিখতে চায়, তারাও বইটি পড়ে পাইথন শিখতে পারবে।"},"file":{"path":"module-package.md","mtime":"2018-03-06T03:14:11.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-03-06T03:33:35.750Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    
<div><script style="display: none;" type="application/javascript">
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','../www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-57505611-7', 'auto', {name: 'microcdn'});
  ga('microcdn.send', 'pageview');

  var _cdn_prev_loc = window.location.pathname;
  window.setInterval(function () {
    if (window.location.pathname !== _cdn_prev_loc) {
      _cdn_prev_loc = window.location.pathname;
      ga('microcdn.send', 'pageview');
    }
  }, 100);

</script></div>
</body>

<!-- Mirrored from pybook.subeen.com/module-package.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:31 GMT -->
</html>

