
<!DOCTYPE HTML>
<html lang="bn" >
    
<!-- Mirrored from pybook.subeen.com/object-class-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:31 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>অবজেক্ট ও ক্লাস · পাইথন প্রোগ্রামিং</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Tamim Shahriar">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="appendix.html" />
    
    
    <link rel="prev" href="module-package.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="অনুসন্ধান" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/subeen/python-programming-bangla" target="_blank" class="custom-link">পাইথন প্রোগ্রামিং</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="index.html">
            
                    
                    ভূমিকা
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="programming-and-python.html">
            
                <a href="programming-and-python.html">
            
                    
                    প্রোগ্রামিং ও পাইথন 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello-world-python.html">
            
                <a href="hello-world-python.html">
            
                    
                    পাইথন দিয়ে প্রথম প্রোগ্রাম
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="variable-data-type-python.html">
            
                <a href="variable-data-type-python.html">
            
                    
                    ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="conditional-logic-python.html">
            
                <a href="conditional-logic-python.html">
            
                    
                    কন্ডিশনাল লজিক
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="turtle-python.html">
            
                <a href="turtle-python.html">
            
                    
                    টার্টলের সঙ্গে পরিচয়
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="loop-python.html">
            
                <a href="loop-python.html">
            
                    
                    লুপ - একই কাজ অনেকবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="function-python.html">
            
                <a href="function-python.html">
            
                    
                    ফাংশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="string-python.html">
            
                <a href="string-python.html">
            
                    
                    স্ট্রিং নিয়ে কাজকারবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="list-tuple-python.html">
            
                <a href="list-tuple-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="set-dictionary-python.html">
            
                <a href="set-dictionary-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="module-package.html">
            
                <a href="module-package.html">
            
                    
                    মডিউল ও প্যাকেজ
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="object-class-python.html">
            
                <a href="object-class-python.html">
            
                    
                    অবজেক্ট ও ক্লাস
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix.html">
            
                <a href="appendix.html">
            
                    
                    বই ও ওয়েবসাইটের তালিকা
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com/" target="blank" class="gitbook-link">
            গিটবুকের মাধ্যমে প্রকাশিত
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="" >অবজেক্ট ও ক্লাস</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;-&#x993;-&#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;">&#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x993; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;</h1>
<p>&#x98F;&#x987; &#x985;&#x9A7;&#x9CD;&#x9AF;&#x9BE;&#x9DF;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x993;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9A1; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B8;&#x9AE;&#x9CD;&#x9AA;&#x9B0;&#x9CD;&#x995;&#x9C7; &#x99C;&#x9BE;&#x9A8;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9AB;&#x9C7;&#x9B0;&#x9A4; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99B;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x986;&#x997;&#x9C7;&#x9B0; &#x9AC;&#x987;&#x9A4;&#x9C7; (&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE;) &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x995;&#x9B2; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9B0;&#x995;&#x9AE;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x98F;&#x996;&#x9A8; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AC;&#x9C3;&#x9A4;&#x9CD;&#x9A4; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> turtle

turtle.circle(<span class="hljs-number">50</span>)

turtle.done()
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9C3;&#x9A4;&#x9CD;&#x9A4; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9C7;&#x9BE; &#x98F;&#x987; &#x9A7;&#x9B0;&#x9A3;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; (&#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x98F;&#x9AC;&#x982; &#x9A4;&#x9BE;&#x9B0; &#x986;&#x997;&#x9C7;&#x9B0; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9AC;&#x9C7;&#x9B6;&#x9BF;&#x9B0;&#x9AD;&#x9BE;&#x997; &#x9B8;&#x9AE;&#x9DF;&#x987; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;)&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF;&#x987; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B8;&#x9C7;&#x99C;&#x9A8;&#x9CD;&#x9AF; turtle &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; Turtle &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; (class) &#x986;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; Turtle &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9AC;&#x9BE; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9B8; (instance) &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x996;&#x9A8; &#x98F;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;, &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;, &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9B8; - &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9C0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;?</p>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x987;, &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x986;&#x9B0; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9B8; &#x98F;&#x995;&#x987; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x964; &#x98F;&#x995;&#x9C7;&#x995; &#x9B8;&#x9AE;&#x9DF; &#x98F;&#x995;&#x9C7;&#x995; &#x9A8;&#x9BE;&#x9AE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;&#x964; &#x986;&#x9B0; &#x9AF;&#x996;&#x9A8;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; (&#x9AC;&#x9BE; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9B8;)-&#x98F;&#x9B0; &#x995;&#x9A5;&#x9BE; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8; &#x9AF;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9DF;, &#x9AF;&#x9C7; &#x98F;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x99F;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A8; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;? &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AE;&#x9C2;&#x9B2; &#x9A8;&#x995;&#x9B6;&#x9BE; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x98F;&#x995; &#x9AC;&#x9BE; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;, &#x9AF;&#x9BE;&#x9B0;&#x9BE; &#x993;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9B8;&#x9AC; &#x9AC;&#x9C8;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x9CD;&#x9AF; &#x9A7;&#x9BE;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x98F;&#x995;&#x99F;&#x9BF; &#x997;&#x9BE;&#x9DC;&#x9BF;&#x9B0; &#x9A1;&#x9BF;&#x99C;&#x9BE;&#x987;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x987; &#x9A1;&#x9BF;&#x99C;&#x9BE;&#x987;&#x9A8; &#x985;&#x9A8;&#x9C1;&#x9B8;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9C7; &#x9AF;&#x9A4; &#x997;&#x9BE;&#x9DC;&#x9BF; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;, &#x9B8;&#x9C7;&#x987; &#x997;&#x9BE;&#x9DC;&#x9BF;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x993;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x964; &#x9A4;&#x9C7;&#x9AE;&#x9A8;&#x9BF; turtle &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; Turtle &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x986;&#x99B;&#x9C7; &#x9AF;&#x9C7;, &#x98F;&#x995;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0; &#x995;&#x9C0; &#x995;&#x9C0; &#x9AC;&#x9C8;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x9CD;&#x9AF; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7; &#x98F;&#x9AC;&#x982; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9C0; &#x995;&#x9C0; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7; &#x993; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x964; &#x98F;&#x987; &#x9AC;&#x9C8;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; (data attribute) &#x986;&#x9B0; &#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF; &#x9AE;&#x9C7;&#x9A5;&#x9A1; (method)&#x964; &#x986;&#x9B8;&#x9B2;&#x9C7; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;, &#x9A4;&#x9AC;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x993; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AC;&#x9C7;&#x9B2;&#x9BE;&#x9DF; &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9B2;&#x9BF;&#x964; &#x98F;&#x995;&#x9BE;&#x9B0;&#x9A3;&#x9C7;&#x987; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x98F;&#x9AC;&#x982; &#x986;&#x997;&#x9C7;&#x9B0; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A5;&#x9BE;&#x993; &#x995;&#x9C7;&#x9BE;&#x9A5;&#x9BE;&#x993; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;, &#x995;&#x9C7;&#x9BE;&#x9A5;&#x9BE;&#x993; &#x995;&#x9C7;&#x9BE;&#x9A5;&#x9BE;&#x993; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9B6;&#x9AC;&#x9CD;&#x9A6; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964;</p>
<h2 id="&#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;-&#x9A4;&#x9C8;&#x9B0;&#x9BF;-&#x993;-&#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0;">&#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x993; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0;</h2>
<p>&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE; &#x995;&#x9C0;&#x9AD;&#x9BE;&#x9AC;&#x9C7;? &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x99F;&#x9BE;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9BF; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> turtle
<span class="hljs-meta">&gt;&gt;&gt; </span>tom = turtle.Turtle()
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; turtle &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9AE;&#x9AA;&#x9C7;&#x9BE;&#x9B0;&#x9CD;&#x99F; &#x995;&#x9B0;&#x99B;&#x9BF;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; tom &#x9A8;&#x9BE;&#x9AE;&#x9C7; Turtle &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x99B;&#x9BF;&#x964; &#x98F;&#x9B0;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; (turtle), &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x99F; (.), &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; (Turtle) &#x98F;&#x9AC;&#x982; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9AC;&#x9A8;&#x9CD;&#x9A7;&#x9A8;&#x9C0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x985;&#x995;&#x9CD;&#x9B7;&#x9B0; &#x9B8;&#x9BE;&#x9A7;&#x9BE;&#x9B0;&#x9A3;&#x9A4; &#x9AC;&#x9DC; &#x9B9;&#x9BE;&#x9A4;&#x9C7;&#x9B0; (capital letter) &#x9B9;&#x9DF;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; tom &#x9A8;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x98F;&#x987; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x995;&#x9C7; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9BE;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; 100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9AC;&#x9CD;&#x9AF;&#x9BE;&#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x9A7;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9C3;&#x9A4;&#x9CD;&#x9A4; &#x986;&#x981;&#x995;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>tom.circle(<span class="hljs-number">100</span>)
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987; &#x9AF;&#x9C7;, tom &#x995;&#x9C0; &#x99F;&#x9BE;&#x987;&#x9AA;&#x9C7;&#x9B0; (&#x9AC;&#x9BE; &#x995;&#x9CB;&#x9A8; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0;) &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x995;&#x9C7; type() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; type(tom)
&lt;class &apos;turtle.Turtle&apos;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;, tom &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; turtle &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x985;&#x9A8;&#x9CD;&#x9A4;&#x9B0;&#x9CD;&#x997;&#x9A4; Turtle &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7;&#x9BE; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x986;&#x9AE;&#x9BF; &#x98F;&#x996;&#x9A8; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>nonte = turtle.Turtle()
<span class="hljs-meta">&gt;&gt;&gt; </span>fonte = turtle.Turtle()
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x986;&#x995;&#x9C3;&#x9A4;&#x9BF; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; nonte-&#x995;&#x9C7; 30 &#x9A1;&#x9BF;&#x997;&#x9CD;&#x9B0;&#x9C0; &#x9AC;&#x9BE;&#x9AE; &#x9A6;&#x9BF;&#x995;&#x9C7; &#x998;&#x9C1;&#x9B0;&#x9C7; 100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x986;&#x9B0; Fonte-&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9AC; 50 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9AA;&#x9C7;&#x99B;&#x9A8;&#x9C7; &#x99A;&#x9B2;&#x9C7; &#x986;&#x9B8;&#x9A4;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>nonte.shape(<span class="hljs-string">&quot;circle&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>fonte.shape(<span class="hljs-string">&quot;square&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>nonte.left(<span class="hljs-number">30</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>nonte.forward(<span class="hljs-number">100</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>fonte.backward(<span class="hljs-number">50</span>)
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7;&#x9B0; &#x9AA;&#x9B0;&#x9AA;&#x9B0; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9A8; &#x9B9;&#x9BE;&#x9B2;&#x9A8;&#x9BE;&#x997;&#x9BE;&#x9A6; (&#x986;&#x9AA;&#x9A1;&#x9C7;&#x99F;) &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x9AF;&#x9C7;, &#x995;&#x9C7;&#x9BE;&#x9A8; &#x9B2;&#x9BE;&#x987;&#x9A8; &#x995;&#x9C0; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x99B;&#x9C7;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE; &#x98F;&#x9AC;&#x982; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>monte = turlte.Turtle()
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
NameError: name <span class="hljs-string">&apos;turlte&apos;</span> <span class="hljs-keyword">is</span> <span class="hljs-keyword">not</span> defined
<span class="hljs-meta">&gt;&gt;&gt; </span>monte = turtle.Turtle()
<span class="hljs-meta">&gt;&gt;&gt; </span>monte.setpos(<span class="hljs-number">-100</span>, <span class="hljs-number">-100</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>
<span class="hljs-meta">&gt;&gt;&gt; </span>monte.foward(<span class="hljs-number">30</span>)
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
AttributeError: <span class="hljs-string">&apos;Turtle&apos;</span> object has no attribute <span class="hljs-string">&apos;foward&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>monte.forward(<span class="hljs-number">30</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>monte.clear()
<span class="hljs-meta">&gt;&gt;&gt; </span>monte.clear()
<span class="hljs-meta">&gt;&gt;&gt; </span>fonte.clear()
<span class="hljs-meta">&gt;&gt;&gt; </span>fonte.shape(<span class="hljs-string">&quot;triangle&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>monte.shape(<span class="hljs-string">&quot;square&quot;</span>)
&gt;&gt;&gt;
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9B2;&#x9C7; &#x9B6;&#x9C7;&#x9B7; &#x9AA;&#x9B0;&#x9CD;&#x9AF;&#x9A8;&#x9CD;&#x9A4; &#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9A8; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9AC;&#x9C7; :</p>
<p><img src="assets/Screen%20Shot%202018-03-04%20at%2010.26.59%20AM.png" alt=""></p>
<p>&#x98F;&#x996;&#x9A8; &#x993;&#x9AA;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x98F;&#x9B0;&#x9B0; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;, &#x98F;&#x995;&#x99F;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; NameError, &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; AttributeError&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x98F;&#x9B0;&#x9B0;&#x99F;&#x9BF; &#x9AC;&#x9B2;&#x99B;&#x9C7;, NameError: name &apos;turlte&apos; is not defined, &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x99F;&#x9BE;&#x9B0; turlte &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x996;&#x9C1;&#x981;&#x99C;&#x9C7; &#x9AA;&#x9BE;&#x9DF; &#x9A8;&#x9BF; (&#x995;&#x9BE;&#x9B0;&#x9A3;, &#x986;&#x9AE;&#x9BF; &#x9AC;&#x9BE;&#x9A8;&#x9BE;&#x9A8; &#x9AD;&#x9C1;&#x9B2; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;)&#x964; &#x986;&#x9B0; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x98F;&#x9B0;&#x9B0;&#x99F;&#x9BF; &#x9AC;&#x9B2;&#x99B;&#x9C7;, AttributeError: &apos;Turtle&apos; object has no attribute &apos;foward&apos;, &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; Turtle &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7; foward &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9A8;&#x9C7;&#x987; (&#x995;&#x9BE;&#x9B0;&#x9A3;, &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7;&#x993; &#x986;&#x9AE;&#x9BF; &#x9AC;&#x9BE;&#x9A8;&#x9BE;&#x9A8; &#x9AD;&#x9C1;&#x9B2; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;)&#x964; &#x9A4;&#x9BE;&#x9B0; &#x9AE;&#x9BE;&#x9A8;&#x9C7;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x9B8;&#x9C7;&#x9B8;&#x9AC; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x987; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9AF;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964;</p>
<p>&#x98F;&#x9A4;&#x995;&#x9CD;&#x9B7;&#x9A3; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B6;&#x9BF;&#x996;&#x9B2;&#x9BE;&#x9AE;, &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF;, &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9C1; &#x9AD;&#x9C1;&#x9B2; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x993; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9DC; &#x9B8;&#x9C1;&#x9AC;&#x9BF;&#x9A7;&#x9BE; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x9AC;&#x9C8;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9B0; &#x995;&#x9A5;&#x9BE; &#x9AC;&#x9B2;&#x9BE; &#x986;&#x99B;&#x9C7;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x9B8;&#x9C7;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9B8;&#x9C7;&#x987; &#x9AC;&#x9C8;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; nonte, fonte, monte - &#x98F;&#x987; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x995;&#x9C7; &#x9A4;&#x9BF;&#x9A8; &#x9B0;&#x995;&#x9AE; &#x986;&#x995;&#x9C3;&#x9A4;&#x9BF; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE; &#x9B0;&#x982;&#x993; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x995;&#x9AE;&#x9BE;&#x9A8;&#x9CD;&#x9A1; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE; &#x99C;&#x9BE;&#x9DF;&#x997;&#x9BE;&#x9DF; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x98F;&#x995;&#x99C;&#x9A8;&#x9C7;&#x9B0; &#x9AC;&#x9C8;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x9CD;&#x9AF; &#x9AC;&#x9BE; &#x986;&#x99A;&#x9B0;&#x9A3; &#x985;&#x9A8;&#x9CD;&#x9AF;&#x99C;&#x9A8;&#x9C7;&#x9B0; &#x993;&#x9AA;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9AD;&#x9BE;&#x9AC; &#x9AB;&#x9C7;&#x9B2;&#x9C7; &#x9A8;&#x9BE;&#x964; nonte-&#x995;&#x9C7; 100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9B2;&#x9C7; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x9B8;&#x9C7;-&#x987; &#x9B8;&#x9C7;&#x987; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;, &#x9AC;&#x9BE;&#x995;&#x9C0; &#x9B8;&#x9AC;&#x9BE;&#x987; &#x9A8;&#x9BF;&#x99C;&#x9C7;&#x9A6;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x98F;&#x995;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x995;&#x9C0; &#x995;&#x9C0; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; (&#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x993; &#x9AE;&#x9C7;&#x9A5;&#x9A1;) &#x986;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BE; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; dir() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x98F;&#x9B8;&#x9AC; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x985;&#x9AC;&#x9B6;&#x9CD;&#x9AF; &#x996;&#x9C1;&#x9AC; &#x9AC;&#x9C7;&#x9B6;&#x9BF; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9AC;&#x9C7;&#x9BE;&#x99D;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964; &#x9AC;&#x9B0;&#x982; &#x9A1;&#x995;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x9AA;&#x9DC;&#x9B2;&#x9C7;&#x987; &#x9AC;&#x9BF;&#x9B8;&#x9CD;&#x9A4;&#x9BE;&#x9B0;&#x9BF;&#x9A4; &#x99C;&#x9BE;&#x9A8;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x986;&#x997;&#x9C7;&#x9B0; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B6;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x9AF;&#x996;&#x9A8; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;, &#x9B8;&#x9C7;&#x987; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x986;&#x9B8;&#x9B2;&#x9C7; list &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; li = [1, 10, 2, 20]
&gt;&gt;&gt; type(li)
&lt;class &apos;list&apos;&gt;
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF; &#x9AF;&#x9C7;, li &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; list &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x964; &#x98F;&#x996;&#x9A8; &#x98F;&#x987; li-&#x98F;&#x9B0; &#x995;&#x9C0; &#x995;&#x9C0; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x986;&#x99B;&#x9C7;, &#x9A4;&#x9BE;&#x993; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>dir(li)
[<span class="hljs-string">&apos;__add__&apos;</span>, <span class="hljs-string">&apos;__class__&apos;</span>, <span class="hljs-string">&apos;__contains__&apos;</span>, <span class="hljs-string">&apos;__delattr__&apos;</span>, <span class="hljs-string">&apos;__delitem__&apos;</span>,
<span class="hljs-string">&apos;__dir__&apos;</span>, <span class="hljs-string">&apos;__doc__&apos;</span>, <span class="hljs-string">&apos;__eq__&apos;</span>, <span class="hljs-string">&apos;__format__&apos;</span>, <span class="hljs-string">&apos;__ge__&apos;</span>, <span class="hljs-string">&apos;__getattribute__&apos;</span>,
<span class="hljs-string">&apos;__getitem__&apos;</span>, <span class="hljs-string">&apos;__gt__&apos;</span>, <span class="hljs-string">&apos;__hash__&apos;</span>, <span class="hljs-string">&apos;__iadd__&apos;</span>, <span class="hljs-string">&apos;__imul__&apos;</span>, <span class="hljs-string">&apos;__init__&apos;</span>,
<span class="hljs-string">&apos;__iter__&apos;</span>, <span class="hljs-string">&apos;__le__&apos;</span>, <span class="hljs-string">&apos;__len__&apos;</span>, <span class="hljs-string">&apos;__lt__&apos;</span>, <span class="hljs-string">&apos;__mul__&apos;</span>, <span class="hljs-string">&apos;__ne__&apos;</span>, <span class="hljs-string">&apos;__new__&apos;</span>,
<span class="hljs-string">&apos;__reduce__&apos;</span>, <span class="hljs-string">&apos;__reduce_ex__&apos;</span>, <span class="hljs-string">&apos;__repr__&apos;</span>, <span class="hljs-string">&apos;__reversed__&apos;</span>, <span class="hljs-string">&apos;__rmul__&apos;</span>,
<span class="hljs-string">&apos;__setattr__&apos;</span>, <span class="hljs-string">&apos;__setitem__&apos;</span>, <span class="hljs-string">&apos;__sizeof__&apos;</span>, <span class="hljs-string">&apos;__str__&apos;</span>, <span class="hljs-string">&apos;__subclasshook__&apos;</span>,
<span class="hljs-string">&apos;append&apos;</span>, <span class="hljs-string">&apos;clear&apos;</span>, <span class="hljs-string">&apos;copy&apos;</span>, <span class="hljs-string">&apos;count&apos;</span>, <span class="hljs-string">&apos;extend&apos;</span>, <span class="hljs-string">&apos;index&apos;</span>, <span class="hljs-string">&apos;insert&apos;</span>, <span class="hljs-string">&apos;pop&apos;</span>,
<span class="hljs-string">&apos;remove&apos;</span>, <span class="hljs-string">&apos;reverse&apos;</span>, <span class="hljs-string">&apos;sort&apos;</span>]
</code></pre>
<p>&#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x986;&#x9A8;&#x9CD;&#x9A1;&#x9BE;&#x9B0;&#x9B8;&#x9CD;&#x995;&#x9C7;&#x9BE;&#x9B0; &#x99A;&#x9BF;&#x9B9;&#x9CD;&#x9A8; (_) &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x986;&#x9AA;&#x9BE;&#x9A4;&#x9A4; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AC;&#x9C7;&#x9BE;&#x99D;&#x9BE;&#x9B0; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9A8;&#x9C7;&#x987;&#x964; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9BE;&#x9A6; &#x9A6;&#x9BF;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;, &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x98F;&#x987; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; : &apos;append&apos;, &apos;clear&apos;, &apos;copy&apos;, &apos;count&apos;, &apos;extend&apos;, &apos;index&apos;, &apos;insert&apos;, &apos;pop&apos;, &apos;remove&apos;, &apos;reverse&apos;, &apos;sort&apos;&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x9AC;&#x9C7;&#x9B6; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x986;&#x997;&#x9C7;&#x9B0; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9C7;&#x99B;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9A8;&#x9BF;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BE; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7; &#x9AF;&#x9C7;, &#x995;&#x9C7;&#x9BE;&#x9A8; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x995;&#x9C0; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9C7;&#x964; &#x986;&#x9B0; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x985;&#x9AB;&#x9BF;&#x9B6;&#x9BF;&#x9DF;&#x9BE;&#x9B2; &#x9A1;&#x995;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9B6;&#x9A8;&#x9C7;&#x993; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x995;&#x9BE;&#x99C;&#x9C7;&#x9B0; &#x9AC;&#x9B0;&#x9CD;&#x9A3;&#x9A8;&#x9BE; &#x9B2;&#x9C7;&#x996;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9B9;&#x9C7;&#x9A4;&#x9C1; li &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; list &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;, &#x9A4;&#x9BE;&#x987; &#x98F;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;, &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9A1;&#x99F;, &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; : li.sort()&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>li.sort()
<span class="hljs-meta">&gt;&gt;&gt; </span>li
[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">10</span>, <span class="hljs-number">20</span>]
</code></pre>
<h2 id="&#x9A8;&#x9A4;&#x9C1;&#x9A8;-&#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;-&#x9A4;&#x9C8;&#x9B0;&#x9BF;-&#x995;&#x9B0;&#x9BE;">&#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;</h2>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9A7;&#x9B0;&#x9A3;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A7;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x995;, &#x986;&#x9AE;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9BE;&#x9B0; &#x9B0;&#x9C7;&#x9B8;&#x9BF;&#x982; &#x997;&#x9C7;&#x9AE;&#x9B8; &#x9AC;&#x9BE;&#x9A8;&#x9BE;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x9B8;&#x9C7;&#x987; &#x997;&#x9C7;&#x9AE;&#x9B8;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9C2;&#x9B2; &#x9AC;&#x9BF;&#x9B7;&#x9DF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x995;&#x9BE;&#x9B0; (Car) &#x9AC;&#x9BE; &#x997;&#x9BE;&#x9DC;&#x9BF;&#x964; &#x986;&#x9AE;&#x9BE;&#x995;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995; &#x995;&#x9BE;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; Car &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7; &#x995;&#x9C0; &#x995;&#x9C0; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x993; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;? &#x98F;&#x996;&#x9A8; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A4;&#x9BE;&#x9B2;&#x9BF;&#x995;&#x9BE; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x986;&#x9AE;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9B9;&#x99C; &#x9A4;&#x9BE;&#x9B2;&#x9BF;&#x995;&#x9BE; &#x9A6;&#x9BF;&#x99A;&#x9CD;&#x99B;&#x9BF;&#x964; &#x9A4;&#x9AC;&#x9C7;, &#x98F;&#x99F;&#x9BF; &#x995;&#x9CB;&#x9A8;&#x9CB; &#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3;&#x9BE;&#x999;&#x9CD;&#x997; &#x9A4;&#x9BE;&#x9B2;&#x9BF;&#x995;&#x9BE; &#x9A8;&#x9DF;, &#x985;&#x9A8;&#x9C7;&#x995;&#x9C7;&#x9B0; &#x9AE;&#x9BE;&#x9A5;&#x9BE;&#x9DF; &#x985;&#x9A8;&#x9CD;&#x9AF;&#x995;&#x9BF;&#x99B;&#x9C1;&#x993; &#x986;&#x9B8;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964;</p>
<p>&#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;:</p>
<ul>
<li>&#x9A8;&#x9BE;&#x9AE; (name)</li>
<li>&#x989;&#x9CE;&#x9AA;&#x9BE;&#x9A6;&#x9A8;&#x995;&#x9BE;&#x9B0;&#x9C0; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x9B7;&#x9CD;&#x9A0;&#x9BE;&#x9A8; (manufacturer)</li>
<li>&#x9B0;&#x982; (color)</li>
<li>&#x9A4;&#x9C8;&#x9B0;&#x9BF;&#x9B0; &#x9B8;&#x9BE;&#x9B2; (year)</li>
<li>&#x987;&#x99E;&#x9CD;&#x99C;&#x9BF;&#x9A8;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B7;&#x9AE;&#x9A4;&#x9BE; (&#x9B8;&#x9BF;&#x9B8;&#x9BF;) (cc)</li>
</ul>
<p>&#x9AE;&#x9C7;&#x9A5;&#x9A1; :</p>
<ul>
<li>&#x987;&#x99E;&#x9CD;&#x99C;&#x9BF;&#x9A8; &#x99A;&#x9BE;&#x9B2;&#x9C1; &#x995;&#x9B0;&#x9BE; (start)</li>
<li>&#x9AC;&#x9CD;&#x9B0;&#x9C7;&#x995; &#x995;&#x9B0;&#x9BE; (brake)</li>
<li>&#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9A8;&#x9C7;&#x9BE; (drive)</li>
<li>&#x9A1;&#x9BE;&#x9A8;&#x9C7;-&#x9AC;&#x9BE;&#x981;&#x9DF;&#x9C7; &#x998;&#x9C7;&#x9BE;&#x9B0;&#x9BE; (turn)</li>
<li>&#x997;&#x9BF;&#x9DF;&#x9BE;&#x9B0; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; (change gear)</li>
</ul>
<p>&#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A1;&#x9BF;&#x99C;&#x9BE;&#x987;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A1;&#x9BE;&#x9DF;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; (class diagram) &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9A4;&#x9AC;&#x9C7; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9BF; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;, &#x9A4;&#x9BE;&#x987; &#x986;&#x9AA;&#x9BE;&#x9A4;&#x9A4; &#x98F;&#x99F;&#x9BF; &#x9A8;&#x9BE; &#x9B6;&#x9BF;&#x996;&#x9B2;&#x9C7;&#x993; &#x99A;&#x9B2;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x99F;&#x9BF; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9AC;&#x9C7;&#x9BE; &#x9AF;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;? &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x9B8;&#x9AB;&#x99F;&#x993;&#x9DF;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x98F;&#x99F;&#x9BF; &#x9AF;&#x9C7;&#x987; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9BE;&#x9A7;&#x9BE;&#x9A8;&#x9C7;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9A4;&#x9C8;&#x9B0;&#x9BF;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9BF;&#x9B6;&#x9C7;&#x9B7;&#x9CD;&#x9AF; &#x9AA;&#x9A6;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; (Noun) &#x996;&#x9C1;&#x981;&#x99C;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A6;&#x9C7;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x9AC;&#x9C7;&#x9B6;&#x9BF;&#x9B0;&#x9AD;&#x9BE;&#x997;&#x9C7;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF;&#x987; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x995;&#x9BE;&#x9B0; &#x9B0;&#x9C7;&#x9B8;&#x9BF;&#x982; &#x997;&#x9C7;&#x9AE;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0;&#x9C7;, Car, Player, Track &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9B8;&#x9CD;&#x995;&#x9C1;&#x9B2; &#x9AE;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9C7;&#x99C;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9AB;&#x99F;&#x993;&#x9DF;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; Student, Teacher, Employee, ClassRoom, Subject, Result &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x9B8;&#x9AC;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x987; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AC;&#x9BF;&#x9B6;&#x9C7;&#x9B7;&#x9CD;&#x9AF; &#x9AA;&#x9A6;, &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; Noun&#x964;</p>
<p>&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9B2;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; class &#x9B2;&#x9BF;&#x996;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9CD;&#x9AA;&#x9C7;&#x9B8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9B2;&#x9C7;&#x996;&#x9BE; &#x9B9;&#x9DF;&#x964; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7;&#x993; &#x987;&#x9A8;&#x9A1;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x964; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9B2;&#x9BE;&#x987;&#x9A8; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9AF;&#x9A4;&#x99F;&#x9C1;&#x995;&#x9C1; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7;, &#x9A4;&#x9BE;&#x9B0;&#x9BE; &#x98F;&#x995; &#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9AC; (tab) &#x9A1;&#x9BE;&#x9A8; &#x9A6;&#x9BF;&#x995; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">ClassName</span>:</span>
    &lt;statement<span class="hljs-number">-1</span>&gt;
    .
    .
    .
    &lt;statement-N&gt;
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7; ClassName &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9C7;&#x987; &#x9A8;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9B8;&#x9C7;&#x987; &#x9A8;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x986;&#x9B0; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;-&#x98F;&#x9B0; &#x99C;&#x9BE;&#x9DF;&#x997;&#x9BE;&#x9DF; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7; &#x9AE;&#x9BE;&#x9A8; &#x9B0;&#x9BE;&#x996;&#x9BE; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    name = <span class="hljs-string">&quot;Premio&quot;</span>
    color = <span class="hljs-string">&quot;white&quot;</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">()</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; Car &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; name &#x993; color &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9B0;&#x9BE;&#x996;&#x9B2;&#x9BE;&#x9AE;, &#x986;&#x9B0; start &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x987; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7; :</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    name = <span class="hljs-string">&quot;Premio&quot;</span>
    color = <span class="hljs-string">&quot;white&quot;</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">()</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)


print(<span class="hljs-string">&quot;Name of the car:&quot;</span>, Car.name)
print(<span class="hljs-string">&quot;Color:&quot;</span>, Car.color)

Car.start()
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x9AD; &#x995;&#x9B0;&#x9C7; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py">$ python car.py 
Name of the car: Premio
Color: white
Starting the engine
</code></pre>
<p>[&#x9A8;&#x9C7;&#x9BE;&#x99F;: &#x995;&#x9BE;&#x9B0; &#x9B0;&#x9C7;&#x9B8;&#x9BF;&#x982; &#x997;&#x9C7;&#x9AE; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; start() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BE;&#x987;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x9AC;&#x9B0;&#x982; &#x997;&#x9BE;&#x9DC;&#x9BF; &#x99A;&#x9BE;&#x9B2;&#x9C1; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BE; &#x9B6;&#x9AC;&#x9CD;&#x9A6; &#x9B9;&#x9AC;&#x9C7;, &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9BF;&#x9AE;&#x9C7;&#x9B6;&#x9A8; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x986;&#x9AE;&#x9BE;&#x9B0; &#x98F;&#x987; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x986;&#x9B2;&#x9C7;&#x9BE;&#x99A;&#x9A8;&#x9BE;&#x9B0; &#x9AC;&#x9BF;&#x9B7;&#x9DF; &#x9A8;&#x9DF;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9B0;&#x982; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x993;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9A1; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x99B;&#x9BF;&#x964;]</p>
<p>&#x98F;&#x996;&#x9A8; &#x995;&#x9C7;&#x989; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7; &#x9AF;&#x9C7;, &#x9B8;&#x9AC; &#x997;&#x9BE;&#x9DC;&#x9BF;&#x9B0; &#x9B0;&#x982; &#x9A4;&#x9C7;&#x9BE; &#x9B8;&#x9BE;&#x9A6;&#x9BE; &#x9B9;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x986;&#x9B0; &#x9B8;&#x9AC; &#x997;&#x9BE;&#x9DC;&#x9BF;&#x9B0; &#x9A8;&#x9BE;&#x9AE;&#x993; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9AE;&#x9BF;&#x993; (Premio) &#x9B9;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;? &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x993;&#x987; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9DF; &#x9AB;&#x9BE;&#x981;&#x995;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B8;&#x9BE;&#x987;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    name = <span class="hljs-string">&quot;&quot;</span>
    color = <span class="hljs-string">&quot;&quot;</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">()</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)


Car.name = <span class="hljs-string">&quot;Axio&quot;</span>
Car.color = <span class="hljs-string">&quot;Black&quot;</span>
print(<span class="hljs-string">&quot;Name of the car:&quot;</span>, Car.name)
print(<span class="hljs-string">&quot;Color:&quot;</span>, Car.color)

Car.start()
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x964; &#x986;&#x9B0; &#x9AC;&#x987;&#x99F;&#x9BF; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x9AA;&#x9DC;&#x9C7; &#x997;&#x9C7;&#x9B2;&#x9C7; &#x99A;&#x9B2;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x9B8;&#x9AC;&#x995;&#x9BF;&#x99B;&#x9C1; &#x9AC;&#x987;&#x9DF;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7;&#x993; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x995;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x99F;&#x9BF;&#x9B8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code>$ python car.py 
Name of the car: Axio
Color: Black
Starting the engine
</code></pre><p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1;&#x9C7; print(dir(Car)) &#x9B2;&#x9BF;&#x996;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BF; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9AC;&#x9C7;&#x9BE; : &apos;color&apos;, &apos;name&apos;, &apos;start&apos;&#x964; &#x9B8;&#x9C7;&#x987; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x985;&#x9AC;&#x9B6;&#x9CD;&#x9AF; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9AC;&#x9C7;, &#x9AF;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; _ &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1;, &#x986;&#x9AA;&#x9BE;&#x9A4;&#x9A4; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BE; &#x995;&#x9B0;&#x9BE; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9A8;&#x9C7;&#x987;&#x964;</p>
<p>&#x98F;&#x996;&#x9A8; &#x9AA;&#x9B0;&#x9CD;&#x9AF;&#x9A8;&#x9CD;&#x9A4; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B8;&#x9B0;&#x9BE;&#x9B8;&#x9B0;&#x9BF; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF;&#x9B0; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF;&#x995;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9AD;&#x9BE;&#x9B7;&#x9BE;&#x9DF; &#x9AC;&#x9B2;&#x9C7; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9B6;&#x9BF;&#x9DF;&#x9C7;&#x99F; (instantiate) &#x995;&#x9B0;&#x9BE;&#x964; &#x98F;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x995;&#x9C7; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9B8;&#x993; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    name = <span class="hljs-string">&quot;&quot;</span>
    color = <span class="hljs-string">&quot;&quot;</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">()</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

<span class="hljs-comment"># creating a Car object</span>
my_car = Car()
my_car.name = <span class="hljs-string">&quot;Allion&quot;</span>
print(my_car.name)
my_car.start()
</code></pre>
<p>&#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE; : my_car = Car()&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;, my_car - &#x98F;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9A6;&#x9BF;&#x9B2;&#x9BE;&#x9AE; : my_car.name = &#x201C;Allion&#x201D; &#x98F;&#x9AC;&#x982; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x9B6;&#x9C7;&#x9B7; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; my_car-&#x995;&#x9C7; &#x99A;&#x9BE;&#x9B2;&#x9C1; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;, &#x9A4;&#x9BE;&#x9B0; start() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x995;&#x9B2; &#x995;&#x9B0;&#x9C7;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7;&#x987; &#x9AC;&#x9BF;&#x9AA;&#x9A4;&#x9CD;&#x9A4;&#x9BF;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE; :</p>
<pre><code>$ python car.py 
Allion
Traceback (most recent call last):
  File &quot;car.py&quot;, line 12, in &lt;module&gt;
    my_car.start()
TypeError: start() takes 0 positional arguments but 1 was given
</code></pre><p>&#x9A8;&#x9BE;&#x9AE; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9B2;&#x9C7;&#x9BE; &#x9A0;&#x9BF;&#x995;&#x987;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x98F;&#x9B0;&#x9B0; &#x9A6;&#x9BF;&#x9B2;&#x9C7;&#x9BE; &#x9AF;&#x9C7;, start() takes 0 positional arguments but 1 was given&#x964; &#x98F;&#x9B0; &#x985;&#x9B0;&#x9CD;&#x9A5; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, start() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AF;&#x996;&#x9A8; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9A8;&#x9C7;&#x9DF; &#x9A8;&#x9BE; (def start()), &#x9AE;&#x9BE;&#x9A8;&#x9C7; 0&#x99F;&#x9BF; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9A8;&#x9C7;&#x9DF;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; 1&#x99F;&#x9BF; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF; (but 1 was given)! &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9C7;&#x9BE;&#x9A5;&#x9BE;&#x9DF; &#x98F;&#x995;&#x99F;&#x9BF; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9B2;&#x9BE;&#x9AE;? &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A4;&#x9C7;&#x9BE; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF; my_car.start()&#x964; &#x9AC;&#x9CD;&#x9B0;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9B2;&#x9BF;&#x996;&#x9BF; &#x9A8;&#x9BF;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x995;&#x9B2; &#x995;&#x9B0;&#x9BF; (&#x9AF;&#x9C7;&#x9AE;&#x9A8; : my_car.start()), &#x9A4;&#x996;&#x9A8; &#x9B8;&#x9C7;&#x987; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x99F;&#x9BF; &#x986;&#x9AA;&#x9A8;&#x9BE;&#x986;&#x9AA;&#x9A8;&#x9BF; &#x99A;&#x9B2;&#x9C7; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x995;&#x9C7;&#x9A8; &#x9AF;&#x9BE;&#x9DF;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9B0;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9BF; &#x9B8;&#x9AE;&#x9DF;&#x9C7; &#x986;&#x9B2;&#x9C7;&#x9BE;&#x99A;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x98F;&#x996;&#x9A8; &#x9AF;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, def start()-&#x98F;&#x9B0; &#x9AC;&#x9A6;&#x9B2;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; def start(self)&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    name = <span class="hljs-string">&quot;&quot;</span>
    color = <span class="hljs-string">&quot;&quot;</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

my_car = Car()
my_car.name = <span class="hljs-string">&quot;Allion&quot;</span>
print(my_car.name)
my_car.start()
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9A0;&#x9BF;&#x995;&#x9A0;&#x9BE;&#x995; &#x99A;&#x9B2;&#x9AC;&#x9C7;&#x964; self-&#x98F;&#x9B0; &#x9AC;&#x9A6;&#x9B2;&#x9C7; &#x985;&#x9A8;&#x9CD;&#x9AF;&#x995;&#x9BF;&#x99B;&#x9C1; &#x9B2;&#x9BF;&#x996;&#x9B2;&#x9C7;&#x993; &#x99A;&#x9B2;&#x9C7;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x987; &#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9B0;&#x9C0;&#x9A4;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; self &#x9B2;&#x9C7;&#x996;&#x9BE;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x99B;&#x9BF;, &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9A4;&#x996;&#x9A8;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B8;&#x9C7;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AC;&#x9C8;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x9CD;&#x9AF; &#x9AC;&#x9B2;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1;&#x99F;&#x9BF; &#x99F;&#x9BE;&#x987;&#x9AA; &#x995;&#x9B0;&#x9C7; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9B2;&#x9C7;&#x9BE;&#x99A;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    name = <span class="hljs-string">&quot;&quot;</span>
    color = <span class="hljs-string">&quot;&quot;</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, name, color)</span>:</span>
        self.name = name
        self.color = color

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

my_car = Car(<span class="hljs-string">&quot;Corolla&quot;</span>, <span class="hljs-string">&quot;White&quot;</span>)
print(my_car.name)
print(my_car.color)
my_car.start()
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9A0;&#x9BF;&#x995;&#x9A0;&#x9BE;&#x995; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7;&#x964; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;, __init__()&#x964; &#x9AF;&#x996;&#x9A8; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;, &#x9A4;&#x996;&#x9A8; &#x98F;&#x987; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x99F;&#x9BF; &#x986;&#x9AA;&#x9A8;&#x9BE;&#x986;&#x9AA;&#x9A8;&#x9BF; (&#x985;&#x99F;&#x9C7;&#x9BE;&#x9AE;&#x9C7;&#x99F;&#x9BF;&#x995;) &#x995;&#x9B2; &#x9B9;&#x9DF;&#x964; &#x9A4;&#x9BE;&#x987; &#x9AF;&#x996;&#x9A8; my_car = Car(&quot;Corolla&quot;, &quot;White&quot;) &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x99F;&#x9BF; &#x99A;&#x9B2;&#x9C7;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9B8;&#x9B2;&#x9C7; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; __init__ &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x995;&#x9B2; &#x9B9;&#x9DF;&#x964; &#x9B8;&#x9C7;&#x987; &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; self&#x964; &#x98F;&#x99F;&#x9BF; &#x9B8;&#x9AC;&#x9B8;&#x9AE;&#x9DF;&#x987; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9AF;&#x9C7;&#x9B9;&#x9C7;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x997;&#x9BE;&#x9DC;&#x9BF;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x993; &#x9B0;&#x982; &#x9B8;&#x9C7;&#x99F; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x987; name &#x993; color &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x9B0;&#x9BE;&#x996;&#x99B;&#x9BF;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; self.name-&#x98F; name &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B8;&#x9BE;&#x987;&#x9A8; &#x995;&#x9B0;&#x99B;&#x9BF;, &#x986;&#x9B0; self.color-&#x98F; color &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B8;&#x9BE;&#x987;&#x9A8; &#x995;&#x9B0;&#x99B;&#x9BF;&#x964; &#x986;&#x9AE;&#x9BF; &#x9AF;&#x996;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x99B;&#x9BF; self.name, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AC;&#x9C7;&#x9BE;&#x99D;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AF;&#x9C7;, &#x9AF;&#x9C7;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9BF; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x99B;&#x9BF;, &#x9A4;&#x9BE;&#x9B0; name &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x964; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9AF;&#x9C7; name &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF; (name = &quot;&quot;), self.name, &#x986;&#x9B0; init &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; name &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; - &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BF; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE;&#x964; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x98F;&#x9B8;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9BE;&#x9AA;&#x9BE;&#x9B0;&#x99F;&#x9BE; &#x98F;&#x995;&#x99F;&#x9C1; &#x98F;&#x9B2;&#x9C7;&#x9BE;&#x9AE;&#x9C7;&#x9B2;&#x9C7;&#x9BE; &#x9B2;&#x9BE;&#x997;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1;&#x99F;&#x9BF; &#x98F;&#x995;&#x99F;&#x9C1; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, n, c)</span>:</span>
        self.name = n
        self.color = c

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

my_car = Car(<span class="hljs-string">&quot;Corolla&quot;</span>, <span class="hljs-string">&quot;White&quot;</span>)
print(my_car.name)
print(my_car.color)
my_car.start()
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; -</p>
<pre><code>$ python car.py 
Corolla
White
Starting the engine
</code></pre><p>&#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AF;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; my_car = Car(&quot;Corolla&quot;, &quot;White&quot;) &#x9B2;&#x9BF;&#x996;&#x99B;&#x9BF;, &#x9A4;&#x996;&#x9A8; __init__(self, n, c)-&#x98F;&#x9B0; self-&#x98F; &#x9AF;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7; my_car &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B0;&#x9C7;&#x9AB;&#x9BE;&#x9B0;&#x9C7;&#x9A8;&#x9CD;&#x9B8;, n-&#x98F; &#x9AF;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7; &quot;Corolla&quot;, &#x986;&#x9B0; c-&#x9A4;&#x9C7; &#x9AF;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7; &quot;White&quot;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x9AF;&#x996;&#x9A8; self.name = n &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x98F;&#x995;&#x9CD;&#x9B8;&#x9BF;&#x995;&#x9BF;&#x989;&#x99F; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, &#x9A4;&#x996;&#x9A8; my_car &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; name &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; n &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B8;&#x9BE;&#x987;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;&#x964; &#x98F;&#x995;&#x987;&#x9AD;&#x9BE;&#x9AC;&#x9C7; color &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x9B9;&#x9DF;&#x9C7; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; c-&#x9A4;&#x9C7; &#x9AF;&#x9BE; &#x9AA;&#x9BE;&#x9A0;&#x9BF;&#x9DF;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;, &#x9A4;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B8;&#x9BE;&#x987;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;&#x964;</p>
<p>Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7; &#x9AF;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE; (name &#x993; color), &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9BF; &#x9AC;&#x9BE;&#x9A6; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9A6;&#x9BF;&#x9DF;&#x9C7;&#x99B;&#x9BF;&#x964; &#x995;&#x9BE;&#x9B0;&#x9A3; &#x986;&#x9AE;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; init &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; self.name &#x993; self.color &#x9AF;&#x996;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x99B;&#x9BF;, &#x9A4;&#x996;&#x9A8; &#x9B8;&#x9C7;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; name &#x993; color &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x9B9;&#x9DF;&#x9C7; &#x9AF;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7;&#x964; &#x98F;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9B8; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;, &#x9AF;&#x9BE; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x993;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9AF;&#x9BE;&#x9A8;&#x9CD;&#x9B8;&#x9C7;&#x9B0; (&#x9AC;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0;) &#x9A5;&#x9BE;&#x995;&#x9C7;&#x964; &#x9A4;&#x9AC;&#x9C7; &#x98F;&#x996;&#x9A8; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9B0; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9A1;&#x99F; &#x9A6;&#x9BF;&#x9DF;&#x9C7; name (&#x993; color) &#x98F;&#x995;&#x9B8;&#x9C7;&#x9B8; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9B2;&#x9BF;&#x996;&#x9BF; print(Car.name), &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9B0;&#x9B0; &#x9AA;&#x9BE;&#x9AC;&#x9C7;&#x9BE; : AttributeError: type object &apos;Car&apos; has no attribute &apos;name&apos;&#x964; &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; name &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A8;&#x9C7;&#x987;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x98F;&#x9B0;&#x995;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE; -</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    name = <span class="hljs-string">&quot;&quot;</span>
    color = <span class="hljs-string">&quot;&quot;</span>
</code></pre>
<p>&#x9A4;&#x996;&#x9A8;, &#x98F;&#x987; name &#x993; color&#x2013;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x964; &#x9AC;&#x9C7;&#x9B6;&#x9BF;&#x9B0;&#x9AD;&#x9BE;&#x997; &#x9B8;&#x9AE;&#x9DF;&#x987; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x98F;&#x9B0;&#x995;&#x9AE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9AA;&#x9B0;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964;</p>
<p>&#x98F;&#x996;&#x9A8; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x986;&#x99B;&#x9C7;, &#x9A4;&#x9BE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x993;&#x987; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x98F;&#x995;&#x9B8;&#x9C7;&#x9B8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x9DF;, &#x9B8;&#x9C7;&#x987; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;, &#x9A4;&#x9AC;&#x9C7; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x986;&#x997;&#x9C7; &#x985;&#x9AC;&#x9B6;&#x9CD;&#x9AF;&#x987; self &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9A1;&#x99F; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7; &#x9AF;&#x9C7;, &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x99F;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A8; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9B8;&#x982;&#x9B6;&#x9CD;&#x9B2;&#x9BF;&#x9B7;&#x9CD;&#x99F;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, n, c)</span>:</span>
        self.name = n
        self.color = c

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&quot;name: &quot;</span>, self.name)
        print(<span class="hljs-string">&quot;color: &quot;</span>, self.color)
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

my_car = Car(<span class="hljs-string">&quot;Corolla&quot;</span>, <span class="hljs-string">&quot;White&quot;</span>)
my_car.start()
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; start() &#x9AE;&#x9C7;&#x9A5;&#x9A1;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x993; &#x9B0;&#x982; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x99C;&#x9BE;&#x9B0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x987;&#x964; self-&#x98F; &#x9AF;&#x9C7; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9AE;&#x9BE;&#x9A3; &#x9AA;&#x9BE;&#x993;&#x9DF;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9B2;&#x9C7; -</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, n, c)</span>:</span>
        self.name = n
        self.color = c

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&quot;name: &quot;</span>, self.name)
        print(<span class="hljs-string">&quot;color: &quot;</span>, self.color)
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

my_car = Car(<span class="hljs-string">&quot;Corolla&quot;</span>, <span class="hljs-string">&quot;White&quot;</span>)

Car.start(my_car)
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; my_car &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;, Car.start() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x995;&#x9B2; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; my_car &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x98F;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B9;&#x9C1;&#x9AC;&#x9C1;&#x9B9;&#x9C1; &#x986;&#x997;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE;&#x987; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9AC;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9BE; &#x9AD;&#x9BE;&#x9B2;&#x9C7;&#x9BE; &#x9AF;&#x9C7;, &#x9B8;&#x9BE;&#x9A7;&#x9BE;&#x9B0;&#x9A3;&#x9A4; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; start() &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x995;&#x9B2; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;&#x964;</p>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x995;&#x9BE;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, n, c)</span>:</span>
        self.name = n
        self.color = c

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&quot;name: &quot;</span>, self.name)
        print(<span class="hljs-string">&quot;color: &quot;</span>, self.color)
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

my_car1 = Car(<span class="hljs-string">&quot;Corolla&quot;</span>, <span class="hljs-string">&quot;White&quot;</span>)
my_car1.start()
my_car2 = Car(<span class="hljs-string">&quot;Premio&quot;</span>, <span class="hljs-string">&quot;Black&quot;</span>)
my_car2.start()
my_car3 = Car(<span class="hljs-string">&quot;Allion&quot;</span>, <span class="hljs-string">&quot;Blue&quot;</span>)
my_car3.start()
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code>$ python car.py 
name:  Corolla
color:  White
Starting the engine
name:  Premio
color:  Black
Starting the engine
name:  Allion
color:  Blue
Starting the engine
</code></pre><p>&#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, my_car1-&#x98F;&#x9B0; color &#x986;&#x9B0; my_car2-&#x98F;&#x9B0; color &#x986;&#x9B2;&#x9BE;&#x9A6;&#x9BE;&#x964; &#x98F;&#x99F;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x993;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x9C7;&#x9A1; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982;&#x9DF;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9DC; &#x9B8;&#x9C1;&#x9AC;&#x9BF;&#x9A7;&#x9BE;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A4; &#x996;&#x9C1;&#x9B6;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9BE;&#x9B0; &#x9A8;&#x9BF;&#x99C;&#x9B8;&#x9CD;&#x9AC; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A7;&#x9BE;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x995;&#x9A5;&#x9BE; &#x9AC;&#x9B2;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9C7; __init__ &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x99B;&#x9BF;, &#x9AF;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x9B9;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x986;&#x9AA;&#x9A8;&#x9BE;&#x986;&#x9AA;&#x9A8;&#x9BF; &#x995;&#x9B2; &#x9B9;&#x9DF;, &#x98F;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x995;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99F;&#x9B0; (constructor)&#x964;</p>
<p>&#x98F;&#x996;&#x9A8; &#x9A7;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x995;, Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9B0; &#x986;&#x9AE;&#x9BE;&#x9B0; &#x996;&#x9C7;&#x9DF;&#x9BE;&#x9B2; &#x9B9;&#x9B2;&#x9C7;&#x9BE;, &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0;, &#x9AF;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9A8;&#x9C7;&#x987;&#x964; &#x986;&#x9B0; &#x986;&#x9AE;&#x9BF; &#x98F;&#x996;&#x9A8; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x99F;&#x9BF;&#x993; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;&#x99B;&#x9BF; &#x9A8;&#x9BE;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9A4;&#x9BE;&#x9A4;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x9A8;&#x9C7;&#x987;&#x964; &#x986;&#x9AE;&#x9BF; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B8;&#x9AE;&#x9DF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x9AC;&#x9BF;&#x989;&#x99F; &#x99C;&#x9C1;&#x9DC;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, n, c)</span>:</span>
        self.name = n
        self.color = c

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">start</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&quot;Starting the engine&quot;</span>)

car = Car(<span class="hljs-string">&quot;Corolla&quot;</span>, <span class="hljs-string">&quot;White&quot;</span>)
car.year = <span class="hljs-number">2017</span>
print(car.name, car.color, car.year)
</code></pre>
<p><strong>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0;&#x983;</strong> &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B6;&#x9C1;&#x9B0;&#x9C1;&#x9A4;&#x9C7; Car &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AF;&#x9C7; &#x9A1;&#x9BF;&#x99C;&#x9BE;&#x987;&#x9A8; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x9B2;&#x9BE;&#x9AE;, &#x986;&#x9AE;&#x9BF; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AA;&#x9C1;&#x9B0;&#x9C7;&#x9BE;&#x9AA;&#x9C1;&#x9B0;&#x9BF; &#x987;&#x9AE;&#x9AA;&#x9CD;&#x9B2;&#x9BF;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9BF; &#x9A8;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; &#x9B8;&#x9C7;&#x987; &#x9A1;&#x9BF;&#x99C;&#x9BE;&#x987;&#x9A8; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x99F;&#x9BF; &#x9AA;&#x9C1;&#x9B0;&#x9C7;&#x9BE;&#x9AA;&#x9C1;&#x9B0;&#x9BF; &#x987;&#x9AE;&#x9AA;&#x9CD;&#x9B2;&#x9BF;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="module-package.html" class="navigation navigation-prev " aria-label="Previous page: মডিউল ও প্যাকেজ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="appendix.html" class="navigation navigation-next " aria-label="Next page: বই ও ওয়েবসাইটের তালিকা">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"অবজেক্ট ও ক্লাস","level":"1.13","depth":1,"next":{"title":"বই ও ওয়েবসাইটের তালিকা","level":"1.14","depth":1,"path":"appendix.md","ref":"appendix.md","articles":[]},"previous":{"title":"মডিউল ও প্যাকেজ","level":"1.12","depth":1,"path":"module-package.md","ref":"module-package.md","articles":[]},"dir":"ltr"},"config":{"plugins":[""],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Tamim Shahriar","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"পাইথন প্রোগ্রামিং","language":"bn","links":{"sidebar":{"পাইথন প্রোগ্রামিং":"https://www.gitbook.com/book/subeen/python-programming-bangla"},"gitbook":true},"gitbook":"*","description":"পাইথন প্রোগ্রামিং ভাষা (ভার্শন ৩) শেখার বাংলা বই। বইটি প্রোগ্রামিংয়ে যারা নতুন, তাদের জন্য উপযোগি। এছাড়া যারা অন্য প্রোগ্রামিং ভাষা জানে কিন্তু পাইথন শিখতে চায়, তারাও বইটি পড়ে পাইথন শিখতে পারবে।"},"file":{"path":"object-class-python.md","mtime":"2018-03-06T03:14:11.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-03-06T03:33:35.750Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    
<div><script style="display: none;" type="application/javascript">
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','../www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-57505611-7', 'auto', {name: 'microcdn'});
  ga('microcdn.send', 'pageview');

  var _cdn_prev_loc = window.location.pathname;
  window.setInterval(function () {
    if (window.location.pathname !== _cdn_prev_loc) {
      _cdn_prev_loc = window.location.pathname;
      ga('microcdn.send', 'pageview');
    }
  }, 100);

</script></div>
</body>

<!-- Mirrored from pybook.subeen.com/object-class-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:32 GMT -->
</html>

