
<!DOCTYPE HTML>
<html lang="bn" >
    
<!-- Mirrored from pybook.subeen.com/set-dictionary-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:31 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি · পাইথন প্রোগ্রামিং</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Tamim Shahriar">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="module-package.html" />
    
    
    <link rel="prev" href="list-tuple-python.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="অনুসন্ধান" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/subeen/python-programming-bangla" target="_blank" class="custom-link">পাইথন প্রোগ্রামিং</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="index.html">
            
                    
                    ভূমিকা
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="programming-and-python.html">
            
                <a href="programming-and-python.html">
            
                    
                    প্রোগ্রামিং ও পাইথন 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello-world-python.html">
            
                <a href="hello-world-python.html">
            
                    
                    পাইথন দিয়ে প্রথম প্রোগ্রাম
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="variable-data-type-python.html">
            
                <a href="variable-data-type-python.html">
            
                    
                    ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="conditional-logic-python.html">
            
                <a href="conditional-logic-python.html">
            
                    
                    কন্ডিশনাল লজিক
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="turtle-python.html">
            
                <a href="turtle-python.html">
            
                    
                    টার্টলের সঙ্গে পরিচয়
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="loop-python.html">
            
                <a href="loop-python.html">
            
                    
                    লুপ - একই কাজ অনেকবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="function-python.html">
            
                <a href="function-python.html">
            
                    
                    ফাংশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="string-python.html">
            
                <a href="string-python.html">
            
                    
                    স্ট্রিং নিয়ে কাজকারবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="list-tuple-python.html">
            
                <a href="list-tuple-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="set-dictionary-python.html">
            
                <a href="set-dictionary-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="module-package.html">
            
                <a href="module-package.html">
            
                    
                    মডিউল ও প্যাকেজ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="object-class-python.html">
            
                <a href="object-class-python.html">
            
                    
                    অবজেক্ট ও ক্লাস
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix.html">
            
                <a href="appendix.html">
            
                    
                    বই ও ওয়েবসাইটের তালিকা
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com/" target="blank" class="gitbook-link">
            গিটবুকের মাধ্যমে প্রকাশিত
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="" >পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0;-&#x9A1;&#x9C7;&#x99F;&#x9BE;-&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0;---&#x9B8;&#x9C7;&#x99F;-&#x993;-&#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;">&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; - &#x9B8;&#x9C7;&#x99F; &#x993; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;</h1>
<p>&#x9B8;&#x9C7;&#x99F; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x985;&#x9A8;&#x9C7;&#x995;&#x9C7;&#x987; &#x9AA;&#x9DC;&#x9C7;&#x99B;&#x9BF;, &#x9A8;&#x9BE; &#x9AA;&#x9DC;&#x9B2;&#x9C7; &#x9A8;&#x9AC;&#x9AE;-&#x9A6;&#x9B6;&#x9AE; &#x9B6;&#x9CD;&#x9B0;&#x9C7;&#x9A3;&#x9C0;&#x9B0; &#x997;&#x9A3;&#x9BF;&#x9A4; &#x9AC;&#x987; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9AA;&#x9DC;&#x9C7; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9AC;&#x9C7; &#x98F;&#x996;&#x9A8;&#x987; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9A6;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9A8;&#x9C7;&#x987;, &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9AE;&#x9C2;&#x9B2; &#x9A7;&#x9BE;&#x9B0;&#x9A3;&#x9BE;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x986;&#x9AE;&#x9BF; &#x986;&#x9B2;&#x9C7;&#x9BE;&#x99A;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<p>&#x9B8;&#x9C7;&#x99F; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x9C7;&#x9B0; &#x9B8;&#x9AE;&#x9BE;&#x9AC;&#x9C7;&#x9B6;, &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9AF;&#x9BE;&#x9DF; collection of items&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x9AC;&#x9B2;&#x9BF; &#x9AF;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9B0; &#x99F;&#x9C7;&#x9AC;&#x9BF;&#x9B2;&#x9C7; &#x98F;&#x996;&#x9A8; &#x986;&#x99B;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9CD;&#x9AF;&#x9BE;&#x9AA;&#x99F;&#x9AA;, &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9C7;&#x9BE;&#x9AC;&#x9BE;&#x987;&#x9B2;, &#x98F;&#x995;&#x99F;&#x9BF; &#x997;&#x9CD;&#x9B2;&#x9BE;&#x9B8;, &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9C7;&#x9BE;&#x99F;&#x9AC;&#x9C1;&#x995;, &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9B2;&#x9AE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F; &#x9AC;&#x9B2;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7;&#x9B0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x9AC;&#x9A8;&#x9CD;&#x9A7;&#x9A8;&#x9C0;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x964; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x9AC;&#x9A8;&#x9CD;&#x9A7;&#x9A8;&#x9C0;&#x995;&#x9C7; &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9C7; curly braces&#x964;</p>
<pre><code>{laptop, cellphone, glass, notebook, pen}
</code></pre><p>&#x986;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9C7;&#x9AE;&#x9A8; &#x9AC;&#x9B2;&#x9BF;, &#x9B8;&#x9AA;&#x9CD;&#x9A4;&#x9AE; &#x9B6;&#x9CD;&#x9B0;&#x9C7;&#x9A3;&#x9C0;&#x9B0; &#x9AA;&#x9BE;&#x9A0;&#x9CD;&#x9AF;&#x9AC;&#x987;&#x9DF;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x964; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9CD;&#x9B0;&#x9AE;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x9B8;&#x9AA;&#x9CD;&#x9A4;&#x9AE; &#x9B6;&#x9CD;&#x9B0;&#x9C7;&#x9A3;&#x9C0;&#x9B0; &#x9AA;&#x9BE;&#x9A0;&#x9CD;&#x9AF;&#x9AC;&#x987;&#x9DF;&#x9C7;&#x9B0; &#x9B8;&#x9C7;&#x99F;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE;, &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF;, &#x997;&#x9A3;&#x9BF;&#x9A4;, &#x9B8;&#x9AE;&#x9BE;&#x99C;&#x9AC;&#x9BF;&#x99C;&#x9CD;&#x99E;&#x9BE;&#x9A8; ... &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE;, &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF;, &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE;, &#x9B8;&#x9AE;&#x9BE;&#x99C;&#x9AC;&#x9BF;&#x99C;&#x9CD;&#x99E;&#x9BE;&#x9A8;, &#x997;&#x9A3;&#x9BF;&#x9A4; ... &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7;&#x993; &#x9B2;&#x9C7;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9DF;, &#x9A4;&#x9BE;&#x9A4;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x9A8;&#x9C7;&#x987;, &#x9B8;&#x9C7;&#x99F; &#x98F;&#x995;&#x987; &#x9A5;&#x9BE;&#x995;&#x99B;&#x9C7;&#x964; &#x9A4;&#x9AC;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995;&#x9AC;&#x9BE;&#x9B0; &#x9B2;&#x9C7;&#x996;&#x9BE; &#x9AF;&#x9BE;&#x9DF; &#x9A8;&#x9BE;&#x964; &#x986;&#x9AE;&#x9BE;&#x9B0; &#x99F;&#x9C7;&#x9AC;&#x9BF;&#x9B2;&#x9C7; &#x9AF;&#x9A6;&#x9BF; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x9AC;&#x9C7;&#x9B6;&#x9BF; &#x995;&#x9B2;&#x9AE; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7;&#x9BE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7;&#x993; &#x986;&#x9AE;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; pen &#x98F;&#x995;&#x9AC;&#x9BE;&#x9B0;&#x987; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9BE;&#x9AE;&#x964;</p>
<p>&#x9A6;&#x9C1;&#x99F;&#x9C7;&#x9BE; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9B8;&#x9AC;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9AE;&#x9BF;&#x9B2;&#x9C7; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9B8;&#x9C7;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x98F;&#x99F;&#x9BF;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x987;&#x989;&#x9A8;&#x9BF;&#x9DF;&#x9A8; (union) &#x995;&#x9B0;&#x9BE;, &#x9AE;&#x9BE;&#x9A8;&#x9C7;, &#x987;&#x989;&#x9A8;&#x9BF;&#x9DF;&#x9A8; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; : A = {1, 2, 3, 4, 5} &#x993; B = {2, 4, 6, 8, 10} &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F; &#x9B9;&#x9B2;&#x9C7; A &#x987;&#x989;&#x9A8;&#x9BF;&#x9DF;&#x9A8; B &#x9B9;&#x9AC;&#x9C7; : {1, 2, 3, 4, 5, 6, 8, 10}&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9A6;&#x9C1;&#x99F;&#x9C7;&#x9BE; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9B8;&#x9BE;&#x9A7;&#x9BE;&#x9B0;&#x9A8; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; &#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9A6;&#x9C1;&#x99F;&#x9C7;&#x9BE; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x987; &#x986;&#x99B;&#x9C7;, &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9B8;&#x9C7;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9AF;&#x9C7; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9AE;&#x9BE;&#x9A7;&#x9CD;&#x9AF;&#x9AE;&#x9C7; &#x98F;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9B8;&#x9C7;&#x995;&#x9B6;&#x9A8; (intersection)&#x964; A &#x993; B-&#x98F;&#x9B0; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9B8;&#x9C7;&#x995;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9BE;&#x9AC;&#x9C7;&#x9BE; : {2, 4}&#x964;</p>
<p>&#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x9B8;&#x9C7;&#x99F; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9B8;&#x9C7;&#x99F; &#x9A8;&#x9BE;&#x9AE;&#x9C7;&#x987; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x986;&#x99B;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x981;&#x995;&#x9BE; &#x9B8;&#x9C7;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; : A = set()&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x9B9;&#x9B2;&#x9C7;&#x9BE; :</p>
<pre><code class="lang-py">&gt;&gt;&gt; A = set()
&gt;&gt;&gt; A
set()
&gt;&gt;&gt; type(A)
&lt;class &apos;set&apos;&gt;
</code></pre>
<p>&#x986;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99B;&#x9C7; &#x9AF;&#x9A6;&#x9BF; &#x987;&#x9A4;&#x9BF;&#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7;&#x987; &#x995;&#x9BF;&#x99B;&#x9C1; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9A5;&#x9BE;&#x995;&#x9C7;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A5;&#x9C7;&#x995;&#x9C7;&#x993; &#x9B8;&#x9C7;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; :</p>
<pre><code class="lang-py">&gt;&gt;&gt; items = {&quot;pen&quot;, &quot;laptop&quot;, &quot;cellphone&quot;}
&gt;&gt;&gt; items
{&apos;cellphone&apos;, &apos;pen&apos;, &apos;laptop&apos;}
&gt;&gt;&gt; type(items)
&lt;class &apos;set&apos;&gt;
&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99B;&#x9C7; &#x9AF;&#x9A6;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AC;&#x9BE; &#x99F;&#x9BE;&#x9AA;&#x9B2; &#x9A5;&#x9BE;&#x995;&#x9C7;, &#x9B8;&#x9C7;&#x987; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AC;&#x9BE; &#x99F;&#x9BE;&#x9AA;&#x9B2; &#x9A5;&#x9C7;&#x995;&#x9C7;&#x993; &#x9B8;&#x9C7;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; li = [1, 2, 3, 4]
&gt;&gt;&gt; tpl = (1, 2, 3)
&gt;&gt;&gt; A = set(li)
&gt;&gt;&gt; A
{1, 2, 3, 4}
&gt;&gt;&gt; B = set(tpl)
&gt;&gt;&gt; B
{1, 2, 3}
&gt;&gt;&gt; type(A)
&lt;class &apos;set&apos;&gt;
&gt;&gt;&gt; type(B)
&lt;class &apos;set&apos;&gt;
&gt;&gt;&gt;
</code></pre>
<p>&#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9A5;&#x9C7;&#x995;&#x9C7;&#x993; &#x9B8;&#x9C7;&#x99F; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;, &#x9B8;&#x9C7; &#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0;&#x9C7; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x9DF;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x985;&#x995;&#x9CD;&#x9B7;&#x9B0; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0;&#x9C7; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x995;&#x99F;&#x9BF; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8; &#x9AE;&#x9A8;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x986;&#x997;&#x9C7;-&#x9AA;&#x9B0;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;, &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9CD;&#x9B0;&#x9AE; (order) &#x985;&#x9A8;&#x9C1;&#x9B8;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF; &#x9A8;&#x9BE;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; A = set(&quot;Bangladesh&quot;)
&gt;&gt;&gt; A
{&apos;e&apos;, &apos;g&apos;, &apos;h&apos;, &apos;a&apos;, &apos;s&apos;, &apos;l&apos;, &apos;B&apos;, &apos;d&apos;, &apos;n&apos;}
&gt;&gt;&gt; type(A)
&lt;class &apos;set&apos;&gt;
&gt;&gt;&gt; B = set(&quot;Sri Lanka&quot;)
&gt;&gt;&gt; B
{&apos;i&apos;, &apos;k&apos;, &apos;L&apos;, &apos; &apos;, &apos;r&apos;, &apos;a&apos;, &apos;S&apos;, &apos;n&apos;}
&gt;&gt;&gt; type(B)
&lt;class &apos;set&apos;&gt;
&gt;&gt;&gt;
</code></pre>
<p>&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9B8;&#x9A6;&#x9B8;&#x9CD;&#x9AF; &#x995;&#x9BF; &#x9A8;&#x9BE;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>A = {<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-number">1</span> <span class="hljs-keyword">in</span> A
<span class="hljs-keyword">True</span>
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-number">2</span> <span class="hljs-keyword">in</span> A
<span class="hljs-keyword">True</span>
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-number">5</span> <span class="hljs-keyword">in</span> A
<span class="hljs-keyword">False</span>
</code></pre>
<p>&#x98F;&#x996;&#x9A8;, &#x986;&#x9AE;&#x9BE;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F; &#x9A5;&#x9BE;&#x995;&#x9C7;, &#x986;&#x9AE;&#x9BF; &#x9B8;&#x9C7;&#x987; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x993;&#x9AA;&#x9B0; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x99A;&#x9BE;&#x987; &#x9AF;&#x9C7;, A &#x993; B &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9B8;&#x9BE;&#x9A7;&#x9BE;&#x9B0;&#x9A3; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F; C &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; : C = A &amp; B (&#x9AE;&#x9BE;&#x9A8;&#x9C7; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9B8;&#x9C7;&#x995;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9BE;)&#x964; &#x986;&#x9B0; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x987;&#x989;&#x9A8;&#x9BF;&#x9DF;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE;, A &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; B &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9B8;&#x9A6;&#x9B8;&#x9CD;&#x9AF; (&#x9B8;&#x9C7;&#x9B8;&#x9AC; &#x9B8;&#x9A6;&#x9B8;&#x9CD;&#x9AF; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9A6;&#x9C1;&#x99F;&#x9C7;&#x9BE; &#x9B8;&#x9C7;&#x99F;&#x9C7;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7;&#x993; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;), &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE; C = A | B&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x99A;&#x9BE;&#x987;, A &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; B, &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9C7; &#x986;&#x99B;&#x9C7; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x995;&#x987; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x99F;&#x9C7; &#x9A8;&#x9C7;&#x987;, &#x9B8;&#x9C7;&#x9B8;&#x9AC; &#x9B8;&#x9A6;&#x9B8;&#x9CD;&#x9AF; &#x9AA;&#x9C7;&#x9A4;&#x9C7;, &#x9A4;&#x996;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE; C = A ^ B&#x964; &#x986;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x9AE;&#x9A8; &#x9B9;&#x9DF; &#x9AF;&#x9C7;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987; &#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x9B8;&#x9A6;&#x9B8;&#x9CD;&#x9AF; A &#x9B8;&#x9C7;&#x99F;&#x9C7; &#x986;&#x99B;&#x9C7; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; B &#x9B8;&#x9C7;&#x99F;&#x9C7; &#x9A8;&#x9C7;&#x987;, &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AA;&#x9BE;&#x993;&#x9DF;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; : C = A - B&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>A = {<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>B = {<span class="hljs-number">2</span>, <span class="hljs-number">4</span>, <span class="hljs-number">6</span>, <span class="hljs-number">8</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>C = A &amp; B
<span class="hljs-meta">&gt;&gt;&gt; </span>C
{<span class="hljs-number">2</span>, <span class="hljs-number">4</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>C = A | B
<span class="hljs-meta">&gt;&gt;&gt; </span>C
{<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>, <span class="hljs-number">8</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>C = A ^ B
<span class="hljs-meta">&gt;&gt;&gt; </span>C
{<span class="hljs-number">1</span>, <span class="hljs-number">3</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>, <span class="hljs-number">8</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>C = A - B
<span class="hljs-meta">&gt;&gt;&gt; </span>C
{<span class="hljs-number">1</span>, <span class="hljs-number">3</span>, <span class="hljs-number">5</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>C = B - A
<span class="hljs-meta">&gt;&gt;&gt; </span>C
{<span class="hljs-number">8</span>, <span class="hljs-number">6</span>}
</code></pre>
<h2 id="&#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;-dictionary">&#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; (Dictionary)</h2>
<p> &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x996;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF; &#x9AF;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9B8;&#x995;&#x9B2; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9DF; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x9AA;&#x9CD;&#x9A4; &#x9A8;&#x9BE;&#x9AE;&#x9CD;&#x9AC;&#x9BE;&#x9B0; &#x9B0;&#x9BE;&#x996;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;? &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x9AC;&#x9C7; &#x995;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9AF;&#x9C7;&#x987; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; 1, &#x9A4;&#x9BE;&#x9B0; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;, &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x9AC;&#x9C7;, &#x9AF;&#x9C7;&#x987; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; 2, &#x9A4;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x9AA;&#x9CD;&#x9A4; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;, &#x98F;&#x9B0;&#x995;&#x9AE;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; : </p>
<p><code>marks = [78, 72, 68, 80, 63, 75]</code></p>
<p> &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AF;&#x9BE;&#x9B0; &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; 3, &#x9A4;&#x9BE;&#x9B0; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9DF; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x9AA;&#x9CD;&#x9A4; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x9B9;&#x9AC;&#x9C7; marks[2]&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x9AD; &#x995;&#x9B0;&#x9C7; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py">marks = [<span class="hljs-number">77</span>, <span class="hljs-number">76</span>, <span class="hljs-number">65</span>, <span class="hljs-number">78</span>, <span class="hljs-number">62</span>, <span class="hljs-number">64</span>, <span class="hljs-number">60</span>, <span class="hljs-number">77</span>, <span class="hljs-number">75</span>, <span class="hljs-number">79</span>]

roll = input(<span class="hljs-string">&quot;Please enter your roll number: &quot;</span>)

print(<span class="hljs-string">&quot;Your marks is&quot;</span>, marks[int(roll)<span class="hljs-number">-1</span>])
</code></pre>
<p>&#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7;, &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code>$ python marks.py 
Please enter your roll number: 4
Your marks is 78
</code></pre><p>&#x986;&#x9AC;&#x9BE;&#x9B0;, &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x9B0;&#x995;&#x9AE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9A4; &#x9AF;&#x9C7;, &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE; &#x993; &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF;, &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x9C7;&#x9B0; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9DF; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x9AA;&#x9CD;&#x9A4; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x996;&#x9A8; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;? &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE; &#x993; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9DF; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x9AA;&#x9CD;&#x9A4; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;&#x964; &#x986;&#x9B0; &#x9B8;&#x995;&#x9B2; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;&#x9C7;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B0;&#x9AE; (&#x995;&#x9CD;&#x9B0;&#x9AE; &#x9AE;&#x9BE;&#x9A8;&#x9C7; &#x9B8;&#x9BF;&#x9B0;&#x9BF;&#x9DF;&#x9BE;&#x9B2;) &#x985;&#x9A8;&#x9C1;&#x9AF;&#x9BE;&#x9DF;&#x9C0; &#x9B8;&#x9BE;&#x99C;&#x9BE;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>marks = [[<span class="hljs-number">74</span>, <span class="hljs-number">73</span>], [<span class="hljs-number">70</span>, <span class="hljs-number">75</span>], [<span class="hljs-number">68</span>, <span class="hljs-number">72</span>], [<span class="hljs-number">73</span>, <span class="hljs-number">73</span>]]
<span class="hljs-meta">&gt;&gt;&gt; </span>marks[<span class="hljs-number">0</span>]
[<span class="hljs-number">74</span>, <span class="hljs-number">73</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>marks[<span class="hljs-number">1</span>]
[<span class="hljs-number">70</span>, <span class="hljs-number">75</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>marks[<span class="hljs-number">1</span>][<span class="hljs-number">0</span>]
<span class="hljs-number">70</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>marks[<span class="hljs-number">1</span>][<span class="hljs-number">1</span>]
<span class="hljs-number">75</span>
</code></pre>
<p>&#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, &#x985;&#x9A8;&#x9C7;&#x995;&#x995;&#x9BF;&#x99B;&#x9C1; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9AE;&#x9A8;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987; &#x9AF;&#x9C7; &#x9B0;&#x9BE;&#x9AB;&#x9BF; &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9DF; &#x995;&#x9A4; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x9AA;&#x9C7;&#x9DF;&#x9C7;&#x99B;&#x9C7;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9AF;&#x9C7; &#x9B0;&#x9BE;&#x9AB;&#x9BF;&#x9B0; &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x995;&#x9A4;, &#x986;&#x9B0; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;&#x9C7; &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF; &#x995;&#x9A4; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x985;&#x9AC;&#x9B8;&#x9CD;&#x9A5;&#x9BE;&#x9A8;&#x9C7; &#x986;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF;&#x993; &#x99C;&#x9BE;&#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9C7;&#x9BE; &#x98F;&#x987; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x989;&#x9A6;&#x9CD;&#x9A7;&#x9BE;&#x9B0; &#x9AA;&#x9BE;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x99A;&#x9AE;&#x9CE;&#x995;&#x9BE;&#x9B0; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x986;&#x99B;&#x9C7;, &#x9AF;&#x9BE;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x964;</p>
<p>&#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9C7; &#x99C;&#x9C7;&#x9BE;&#x9DC;&#x9BE;&#x9DF; &#x99C;&#x9C7;&#x9BE;&#x9DC;&#x9BE;&#x9DF;&#x964; &#x99C;&#x9C7;&#x9BE;&#x9DC;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x99F;&#x9BF;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x995;&#x9BF; (key) &#x986;&#x9B0; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x99F;&#x9BF;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C1; (value)&#x964; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9AA;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9B2;&#x9C7;, &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9BF; (key) &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C1; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x989;&#x9A6;&#x9CD;&#x9A7;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; :</p>
<pre><code class="lang-py">&gt;&gt;&gt; marks = {1: 77, 2: 76, 5: 62, 4: 78, 3: 65}
&gt;&gt;&gt; type(marks)
&lt;class &apos;dict&apos;&gt;
&gt;&gt;&gt; marks[3]
65
&gt;&gt;&gt; print(&quot;Marks of roll number 4 is&quot;, marks[4])
Marks of roll number 4 is 78
&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9C7;&#x9B2;&#x9BE;&#x9AE;, &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF;&#x964; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9B0; &#x99F;&#x9BE;&#x987;&#x9AA; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; dict &#x9B8;&#x9C7;&#x99F;&#x9BF;&#x993; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF; (key) &#x99C;&#x9BE;&#x9A8;&#x9B2;&#x9C7; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C1; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AA;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9DF;, &#x9B8;&#x9C7;&#x99F;&#x9BF;&#x993; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9B7;&#x9DF; &#x996;&#x9C7;&#x9DF;&#x9BE;&#x9B2; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9AF;&#x9C7;, &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9CD;&#x9B0;&#x9AE; &#x985;&#x9A8;&#x9C1;&#x9B8;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF; &#x9A8;&#x9BE;&#x964; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AE;&#x99C;&#x9BE;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9BE;&#x9AA;&#x9BE;&#x9B0; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;, &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x9AF;&#x9A6;&#x9BF; 1 &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1; &#x9A8;&#x9BE; &#x9B9;&#x9DF;&#x9C7; 1001 &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1; &#x9B9;&#x9A4;&#x9C7;&#x9BE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7;&#x993; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x99B;&#x9BF;&#x9B2; &#x9A8;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>marks = {<span class="hljs-number">1005</span>: <span class="hljs-number">75</span>, <span class="hljs-number">1003</span>: <span class="hljs-number">72</span>, <span class="hljs-number">1002</span>: <span class="hljs-number">70</span>, <span class="hljs-number">1001</span>: <span class="hljs-number">75</span>, <span class="hljs-number">1004</span>: <span class="hljs-number">77</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>marks[<span class="hljs-number">1003</span>]
<span class="hljs-number">72</span>
</code></pre>
<p>&#x986;&#x9AC;&#x9BE;&#x9B0; &#x98F;&#x9AE;&#x9A8; &#x9AF;&#x9A6;&#x9BF; &#x9B9;&#x9DF;, &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;&#x99F;&#x9BF; &#x986;&#x9B8;&#x9B2;&#x9C7; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9A8;&#x9DF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7;&#x993; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x9A8;&#x9C7;&#x987;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; -</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>marks = {<span class="hljs-string">&quot;DH2001&quot;</span>: <span class="hljs-number">75</span>, <span class="hljs-string">&quot;DH1777&quot;</span>: <span class="hljs-number">72</span>, <span class="hljs-string">&quot;KH2050&quot;</span>: <span class="hljs-number">70</span>} 
<span class="hljs-meta">&gt;&gt;&gt; </span>marks[<span class="hljs-string">&quot;DH2001&quot;</span>]
<span class="hljs-number">75</span>
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x996;&#x9BE;&#x9B2;&#x9BF; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; (&#x9AF;&#x9C7;&#x99F;&#x9BF;&#x9A4;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9A8;&#x9C7;&#x987;) &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x995;&#x9BE;&#x9B0;&#x9A3;, &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9B0;&#x9C7;&#x993; &#x98F;&#x9A4;&#x9C7; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x995;&#x9BF;-&#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C1; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; dt = {}
&gt;&gt;&gt; dt
{}
&gt;&gt;&gt; print(dt)
{}
&gt;&gt;&gt; type(dt)
&lt;class &apos;dict&apos;&gt;
&gt;&gt;&gt; dt[1] = &quot;one&quot;
&gt;&gt;&gt; print(dt)
{1: &apos;one&apos;}
&gt;&gt;&gt; dt[2] = &quot;two&quot;
&gt;&gt;&gt; print(dt)
{1: &apos;one&apos;, 2: &apos;two&apos;}
</code></pre>
<p>&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF; (key) &#x9AF;&#x9A6;&#x9BF; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9C7;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x98F;&#x995;&#x9B8;&#x9C7;&#x9B8; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x98F;&#x9B0;&#x9B0; &#x9A6;&#x9C7;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>dt = {<span class="hljs-string">&quot;a&quot;</span>: <span class="hljs-string">&quot;A&quot;</span>, <span class="hljs-string">&quot;b&quot;</span>: <span class="hljs-string">&quot;B&quot;</span>, <span class="hljs-string">&quot;c&quot;</span>: <span class="hljs-string">&quot;C&quot;</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>dt[<span class="hljs-string">&quot;a&quot;</span>]
<span class="hljs-string">&apos;A&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>dt[<span class="hljs-string">&quot;b&quot;</span>]
<span class="hljs-string">&apos;B&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>dt[<span class="hljs-string">&quot;c&quot;</span>]
<span class="hljs-string">&apos;C&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>dt[<span class="hljs-string">&quot;d&quot;</span>]
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
KeyError: <span class="hljs-string">&apos;d&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>dt[<span class="hljs-string">&quot;d&quot;</span>] = <span class="hljs-string">&quot;D&quot;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>dt[<span class="hljs-string">&quot;d&quot;</span>]
<span class="hljs-string">&apos;D&apos;</span>
</code></pre>
<p>&#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9AE;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9AC;&#x9B2; &#x9A8;&#x9DF;, &#x98F;&#x9B0;&#x995;&#x9AE; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x995;&#x9BF; (key) &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;: &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;, &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;, &#x99F;&#x9BE;&#x9AA;&#x9B2;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F;, &#x9B8;&#x9C7;&#x99F; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x995;&#x9BE;&#x9B0;&#x9A3; &#x9B2;&#x9BF;&#x9B8;&#x9CD;&#x99F; &#x9A4;&#x9C7;&#x9BE; &#x9AE;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9AC;&#x9B2;, &#x9AE;&#x9BE;&#x9A8;&#x9C7; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9B8;&#x9C7;&#x99F;&#x993; &#x9A4;&#x9C7;&#x9AE;&#x9A8;&#x9BF;, &#x9AE;&#x9BF;&#x989;&#x99F;&#x9C7;&#x9AC;&#x9B2; &#x9B9;&#x993;&#x9DF;&#x9BE;&#x9DF; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9B0; &#x995;&#x9BF; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF; &#x9A8;&#x9BE;&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; dt = {&quot;a&quot;: &quot;A&quot;, &quot;b&quot;: &quot;B&quot;, &quot;c&quot;: &quot;C&quot;}
&gt;&gt;&gt; dt[(1, 2, 3)] = &quot;tuple&quot;
&gt;&gt;&gt; dt
{(1, 2, 3): &apos;tuple&apos;, &apos;b&apos;: &apos;B&apos;, &apos;d&apos;: &apos;D&apos;, &apos;c&apos;: &apos;C&apos;, &apos;a&apos;: &apos;A&apos;}
&gt;&gt;&gt; 
&gt;&gt;&gt; li = [1, 2, 3]
&gt;&gt;&gt; dt[li] = &quot;list&quot;
Traceback (most recent call last):
  File &quot;&lt;stdin&gt;&quot;, line 1, in &lt;module&gt;
TypeError: unhashable type: &apos;list&apos;
&gt;&gt;&gt; 
&gt;&gt;&gt; s = {1, 2, 3, 4}
&gt;&gt;&gt; s
{1, 2, 3, 4}
&gt;&gt;&gt; type(s)
&lt;class &apos;set&apos;&gt;
&gt;&gt;&gt; dt[s] = &quot;set&quot;
Traceback (most recent call last):
  File &quot;&lt;stdin&gt;&quot;, line 1, in &lt;module&gt;
TypeError: unhashable type: &apos;set&apos;
&gt;&gt;&gt;
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x9AA;&#x9B0;&#x9CD;&#x9AF;&#x9A8;&#x9CD;&#x9A4; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9B0; &#x9AF;&#x9C7;&#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9A4; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x99A;&#x9B0;&#x9CD;&#x99A;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x98F;&#x99B;&#x9BE;&#x9DC;&#x9BE; &#x9AE;&#x9A8;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8; &#x99C;&#x9BE;&#x997;&#x9B2;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8;&#x9C7;&#x9B0; &#x989;&#x9A4;&#x9CD;&#x9A4;&#x9B0; &#x996;&#x9C1;&#x981;&#x99C;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<p><strong>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0;</strong> :</p>
<ul>
<li><p>&#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0; &#x9AB;&#x9B2; &#x9B0;&#x9BE;&#x996;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BF; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x995;&#x9BF; (key) &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x9B0;&#x995;&#x9AE; &#x9B8;&#x9AE;&#x9B8;&#x9CD;&#x9AF;&#x9BE; &#x9B8;&#x9C3;&#x9B7;&#x9CD;&#x99F;&#x9BF; &#x9B9;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;?</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x996;&#x9A8; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE; &#x993; &#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; :</p>
</li>
</ul>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>marks = {<span class="hljs-string">&quot;DH1001&quot;</span>: {<span class="hljs-string">&quot;Bangla&quot;</span>: <span class="hljs-number">74</span>, <span class="hljs-string">&quot;English&quot;</span>: <span class="hljs-number">73</span>}, <span class="hljs-string">&quot;DH1002&quot;</span>: {<span class="hljs-string">&quot;Bangla&quot;</span>: <span class="hljs-number">70</span>, <span class="hljs-string">&quot;English&quot;</span>: <span class="hljs-number">75</span>}}
<span class="hljs-meta">&gt;&gt;&gt; </span>print(marks[<span class="hljs-string">&quot;DH1001&quot;</span>])
{<span class="hljs-string">&apos;Bangla&apos;</span>: <span class="hljs-number">74</span>, <span class="hljs-string">&apos;English&apos;</span>: <span class="hljs-number">73</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>print(marks[<span class="hljs-string">&quot;DH1001&quot;</span>][<span class="hljs-string">&quot;English&quot;</span>])
<span class="hljs-number">73</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>marks[<span class="hljs-string">&quot;DH1003&quot;</span>] = {<span class="hljs-string">&quot;Bangla&quot;</span>: <span class="hljs-number">68</span>, <span class="hljs-string">&quot;English&quot;</span>: <span class="hljs-number">72</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>print(marks)
{<span class="hljs-string">&apos;DH1003&apos;</span>: {<span class="hljs-string">&apos;Bangla&apos;</span>: <span class="hljs-number">68</span>, <span class="hljs-string">&apos;English&apos;</span>: <span class="hljs-number">72</span>}, <span class="hljs-string">&apos;DH1002&apos;</span>: {<span class="hljs-string">&apos;Bangla&apos;</span>: <span class="hljs-number">70</span>, <span class="hljs-string">&apos;English&apos;</span>: <span class="hljs-number">75</span>}, <span class="hljs-string">&apos;DH1001&apos;</span>: {<span class="hljs-string">&apos;Bangla&apos;</span>: <span class="hljs-number">74</span>, <span class="hljs-string">&apos;English&apos;</span>: <span class="hljs-number">73</span>}}
<span class="hljs-meta">&gt;&gt;&gt; </span>print(marks[<span class="hljs-string">&quot;DH1003&quot;</span>])
{<span class="hljs-string">&apos;Bangla&apos;</span>: <span class="hljs-number">68</span>, <span class="hljs-string">&apos;English&apos;</span>: <span class="hljs-number">72</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>print(marks[<span class="hljs-string">&quot;DH1003&quot;</span>][<span class="hljs-string">&quot;Bangla&quot;</span>])
<span class="hljs-number">68</span>
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x993; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995; &#x9B8;&#x9B9;&#x99C; &#x9B9;&#x9DF;&#x9C7; &#x997;&#x9C7;&#x9B2;&#x964; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9B0;&#x9C7;&#x9BE;&#x9B2; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x99C;&#x9BE;&#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9B2;&#x9C7; &#x9B6;&#x9BF;&#x995;&#x9CD;&#x9B7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C0;&#x9B0; &#x9B8;&#x9AC; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x9C7;&#x9B0; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x99C;&#x9BE;&#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x9AA;&#x9CD;&#x9A4; &#x9A8;&#x9AE;&#x9CD;&#x9AC;&#x9B0;&#x993; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AF;&#x9BE;&#x9DF; &#x9B8;&#x9B9;&#x99C;&#x9C7;&#x987;&#x964;</p>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x99A;&#x9B0;&#x9CD;&#x99A;&#x9BE;&#x9B0; &#x9AC;&#x9BF;&#x9B7;&#x9DF;, &#x986;&#x9B0; &#x9A4;&#x9BE;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x996;&#x9A8; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0;&#x9C7;&#x9B0; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE;&#x9A6;&#x9C7;&#x9B6;&#x9C7;&#x9B0; &#x9B8;&#x9AC;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BE;&#x997; &#x9B8;&#x9AE;&#x9CD;&#x9AA;&#x9B0;&#x9CD;&#x995;&#x9C7; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9A4;&#x9A5;&#x9CD;&#x9AF;, &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x9AC;&#x9BF;&#x9AD;&#x9BE;&#x997;&#x9C7;&#x9B0; &#x995;&#x9DF;&#x99F;&#x9BF; &#x99C;&#x9C7;&#x9B2;&#x9BE;, &#x989;&#x9AA;&#x99C;&#x9C7;&#x9B2;&#x9BE; &#x993; &#x987;&#x989;&#x9A8;&#x9BF;&#x9DF;&#x9A8; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;, &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x986;&#x9A6;&#x9B0;&#x9CD;&#x9B6; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0;&#x964; &#x989;&#x987;&#x995;&#x9BF;&#x9AA;&#x9BF;&#x9A1;&#x9BF;&#x9DF;&#x9BE; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9A4;&#x9A5;&#x9CD;&#x9AF; &#x9B8;&#x982;&#x997;&#x9CD;&#x9B0;&#x9B9; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE; -</p>
<p><img src="assets/pydictimg.png" alt=""></p>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; &#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9A4;&#x9A5;&#x9CD;&#x9AF;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info = {}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Barishal&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">6</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">39</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">333</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Chittagong&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">11</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">97</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">336</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Dhaka&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">13</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">93</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">1833</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Khulna&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">10</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">59</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">270</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Mymensingh&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">4</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">34</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">350</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Rajshahi&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">8</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">70</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">558</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Rangpur&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">8</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">58</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">536</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>bd_division_info[<span class="hljs-string">&quot;Sylhet&quot;</span>] = {<span class="hljs-string">&quot;district&quot;</span>: <span class="hljs-number">4</span>, <span class="hljs-string">&quot;upazila&quot;</span>: <span class="hljs-number">38</span>, <span class="hljs-string">&quot;union&quot;</span>: <span class="hljs-number">334</span>}
<span class="hljs-meta">&gt;&gt;&gt; </span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(bd_division_info)
{<span class="hljs-string">&apos;Sylhet&apos;</span>: {<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">38</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">334</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">4</span>}, <span class="hljs-string">&apos;Barishal&apos;</span>:
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">39</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">333</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">6</span>}, <span class="hljs-string">&apos;Rangpur&apos;</span>: {<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">58</span>,
<span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">536</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">8</span>}, <span class="hljs-string">&apos;Rajshahi&apos;</span>: {<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">70</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">558</span>,
<span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">8</span>}, <span class="hljs-string">&apos;Chittagong&apos;</span>: {<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">97</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">336</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">11</span>},
<span class="hljs-string">&apos;Mymensingh&apos;</span>: {<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">34</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">350</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">4</span>}, <span class="hljs-string">&apos;Dhaka&apos;</span>:
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">93</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">1833</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">13</span>}, <span class="hljs-string">&apos;Khulna&apos;</span>: {<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">59</span>,
<span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">270</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">10</span>}}
&gt;&gt;&gt;
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BF; &#x9AF;&#x9A6;&#x9BF; &#x99A;&#x9BE;&#x987; &#x9B8;&#x9AC;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BE;&#x997;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x995;&#x9C0; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;? &#x9AC;&#x9BF;&#x9AD;&#x9BE;&#x997;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9B0; &#x995;&#x9BF; (key) &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AA;&#x9BE;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9C7;&#x9A5;&#x9A1; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7; .keys()&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>divisions = bd_division_info.keys()
<span class="hljs-meta">&gt;&gt;&gt; </span>print(divisions)
dict_keys([<span class="hljs-string">&apos;Sylhet&apos;</span>, <span class="hljs-string">&apos;Barishal&apos;</span>, <span class="hljs-string">&apos;Rangpur&apos;</span>, <span class="hljs-string">&apos;Rajshahi&apos;</span>, <span class="hljs-string">&apos;Chittagong&apos;</span>,
<span class="hljs-string">&apos;Mymensingh&apos;</span>, <span class="hljs-string">&apos;Dhaka&apos;</span>, <span class="hljs-string">&apos;Khulna&apos;</span>])
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x98F;&#x987; &#x995;&#x9BF;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x989;&#x9AA;&#x9B0; &#x9B2;&#x9C1;&#x9AA; &#x99A;&#x9BE;&#x9B2;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x995;&#x9C7; &#x98F;&#x995;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;:</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> division <span class="hljs-keyword">in</span> divisions:
<span class="hljs-meta">... </span>    print(<span class="hljs-string">&quot;Division&quot;</span>, division)
<span class="hljs-meta">... </span>
Division Sylhet
Division Barishal
Division Rangpur
Division Rajshahi
Division Chittagong
Division Mymensingh
Division Dhaka
Division Khulna
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x9AF;&#x9A6;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;, &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9AD;&#x9BE;&#x997;&#x9C7; &#x995;&#x9DF;&#x99F;&#x9BF; &#x989;&#x9AA;&#x99C;&#x9C7;&#x9B2;&#x9BE; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x987; &#x9A4;&#x9A5;&#x9CD;&#x9AF; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B2;&#x9C1;&#x9AA; &#x99A;&#x9BE;&#x9B2;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> division <span class="hljs-keyword">in</span> divisions:
<span class="hljs-meta">... </span>    print(division, <span class="hljs-string">&quot;upazila&quot;</span>, bd_division_info[division][<span class="hljs-string">&quot;upazila&quot;</span>])
<span class="hljs-meta">... </span>
Sylhet upazila <span class="hljs-number">38</span>
Barishal upazila <span class="hljs-number">39</span>
Rangpur upazila <span class="hljs-number">58</span>
Rajshahi upazila <span class="hljs-number">70</span>
Chittagong upazila <span class="hljs-number">97</span>
Mymensingh upazila <span class="hljs-number">34</span>
Dhaka upazila <span class="hljs-number">93</span>
Khulna upazila <span class="hljs-number">59</span>
&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9B8;&#x9B0;&#x9BE;&#x9B8;&#x9B0;&#x9BF; &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF;&#x9B0; &#x989;&#x9AA;&#x9B0; &#x9B2;&#x9C1;&#x9AA; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x995;&#x9BF;-&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AA;&#x9BE;&#x9AC;&#x9C7;&#x9BE;:</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> item <span class="hljs-keyword">in</span> bd_district_info:
<span class="hljs-meta">... </span>    print(item)
<span class="hljs-meta">... </span>
Sylhet
Barishal
Rangpur
Rajshahi
Chittagong
Mymensingh
Dhaka
Khulna
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x995;&#x9BF; &#x993; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C1; &#x9A6;&#x9C1;&#x99F;&#x9C7;&#x9BE;&#x987; &#x9AA;&#x9C7;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9B9;&#x9BE;&#x9A4;&#x9C7; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9AA;&#x9A6;&#x9CD;&#x9A7;&#x9A4;&#x9BF; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9C7;&#x987; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; :</p>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9AA;&#x9A6;&#x9CD;&#x9A7;&#x9A4;&#x9BF;:</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> key <span class="hljs-keyword">in</span> bd_district_info:
<span class="hljs-meta">... </span>    print(key)
<span class="hljs-meta">... </span>    print(bd_district_info[key])
<span class="hljs-meta">... </span>
Sylhet
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">38</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">334</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">4</span>}
Barishal
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">39</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">333</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">6</span>}
Rangpur
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">58</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">536</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">8</span>}
Rajshahi
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">70</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">558</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">8</span>}
Chittagong
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">97</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">336</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">11</span>}
Mymensingh
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">34</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">350</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">4</span>}
Dhaka
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">93</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">1833</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">13</span>}
Khulna
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">59</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">270</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">10</span>}
</code></pre>
<p>&#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x9AA;&#x9A6;&#x9CD;&#x9A7;&#x9A4;&#x9BF;:</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">for</span> key, value <span class="hljs-keyword">in</span> bd_district_info.items():
<span class="hljs-meta">... </span>    print(key)
<span class="hljs-meta">... </span>    print(value)
<span class="hljs-meta">... </span>
Sylhet
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">38</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">334</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">4</span>}
Barishal
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">39</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">333</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">6</span>}
Rangpur
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">58</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">536</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">8</span>}
Rajshahi
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">70</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">558</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">8</span>}
Chittagong
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">97</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">336</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">11</span>}
Mymensingh
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">34</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">350</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">4</span>}
Dhaka
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">93</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">1833</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">13</span>}
Khulna
{<span class="hljs-string">&apos;upazila&apos;</span>: <span class="hljs-number">59</span>, <span class="hljs-string">&apos;union&apos;</span>: <span class="hljs-number">270</span>, <span class="hljs-string">&apos;district&apos;</span>: <span class="hljs-number">10</span>}
</code></pre>
<p><strong>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0;</strong></p>
<ul>
<li>bd_district_info &#x9A1;&#x9BF;&#x995;&#x9B6;&#x9A8;&#x9BE;&#x9B0;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;, &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE;&#x9A6;&#x9C7;&#x9B6;&#x9C7; &#x9AE;&#x9C7;&#x9BE;&#x99F; &#x995;&#x9DF;&#x99F;&#x9BF; &#x99C;&#x9C7;&#x9B2;&#x9BE;, &#x989;&#x9AA;&#x99C;&#x9C7;&#x9B2;&#x9BE; &#x993; &#x987;&#x989;&#x9A8;&#x9BF;&#x9DF;&#x9A8; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x987; &#x9A4;&#x9A5;&#x9CD;&#x9AF; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
</ul>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9A4;&#x995;&#x9CD;&#x9B7;&#x9A3; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x9A6;&#x9C7;&#x996;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x995;&#x996;&#x9A8; &#x995;&#x9C7;&#x9BE;&#x9A8; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9C7; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x986;&#x9B0; &#x9AF;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x985;&#x9AD;&#x9BF;&#x99C;&#x9CD;&#x99E;&#x9A4;&#x9BE; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x9AC;&#x9BE;&#x9DC;&#x9AC;&#x9C7;, &#x9A4;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99A;&#x9BE;&#x9B0;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x9AC;&#x9C7;&#x9B6;&#x9BF; &#x9AD;&#x9BE;&#x9B2;&#x9C7;&#x9BE;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x985;&#x9AD;&#x9BF;&#x99C;&#x9CD;&#x99E;&#x9A4;&#x9BE; &#x9AC;&#x9BE;&#x9DC;&#x9BE;&#x9A8;&#x9C7;&#x9BE;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9DF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8; &#x995;&#x9B0;&#x9BE; &#x993; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x995;&#x9B0;&#x9BE;&#x964; &#x98F;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9B8;&#x9AE;&#x9DF; &#x993; &#x9B6;&#x9CD;&#x9B0;&#x9AE; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x9B2;&#x9BE;&#x997;&#x9C7;&#x964; &#x9A8;&#x9A4;&#x9C1;&#x9A8;&#x9A6;&#x9C7;&#x9B0; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9B6;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995; &#x9B8;&#x9AE;&#x9DF; &#x9B2;&#x9BE;&#x997;&#x9C7;, &#x9A4;&#x9BE;&#x987; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9A8;&#x9BE; &#x9AA;&#x9BE;&#x9B0;&#x9B2;&#x9C7; &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BF;&#x9A4; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x9B9;&#x9A4;&#x9BE;&#x9B6; &#x9B9;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9A8;&#x9C7;&#x987;, &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x99A;&#x9BE;&#x9B2;&#x9BF;&#x9DF;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="list-tuple-python.html" class="navigation navigation-prev " aria-label="Previous page: পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="module-package.html" class="navigation navigation-next " aria-label="Next page: মডিউল ও প্যাকেজ">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি","level":"1.11","depth":1,"next":{"title":"মডিউল ও প্যাকেজ","level":"1.12","depth":1,"path":"module-package.md","ref":"module-package.md","articles":[]},"previous":{"title":"পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল","level":"1.10","depth":1,"path":"list-tuple-python.md","ref":"list-tuple-python.md","articles":[]},"dir":"ltr"},"config":{"plugins":[""],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Tamim Shahriar","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"পাইথন প্রোগ্রামিং","language":"bn","links":{"sidebar":{"পাইথন প্রোগ্রামিং":"https://www.gitbook.com/book/subeen/python-programming-bangla"},"gitbook":true},"gitbook":"*","description":"পাইথন প্রোগ্রামিং ভাষা (ভার্শন ৩) শেখার বাংলা বই। বইটি প্রোগ্রামিংয়ে যারা নতুন, তাদের জন্য উপযোগি। এছাড়া যারা অন্য প্রোগ্রামিং ভাষা জানে কিন্তু পাইথন শিখতে চায়, তারাও বইটি পড়ে পাইথন শিখতে পারবে।"},"file":{"path":"set-dictionary-python.md","mtime":"2018-03-06T03:14:11.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-03-06T03:33:35.750Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    
<div><script style="display: none;" type="application/javascript">
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','../www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-57505611-7', 'auto', {name: 'microcdn'});
  ga('microcdn.send', 'pageview');

  var _cdn_prev_loc = window.location.pathname;
  window.setInterval(function () {
    if (window.location.pathname !== _cdn_prev_loc) {
      _cdn_prev_loc = window.location.pathname;
      ga('microcdn.send', 'pageview');
    }
  }, 100);

</script></div>
</body>

<!-- Mirrored from pybook.subeen.com/set-dictionary-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:31 GMT -->
</html>

