
<!DOCTYPE HTML>
<html lang="bn" >
    
<!-- Mirrored from pybook.subeen.com/turtle-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:26 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>টার্টলের সঙ্গে পরিচয় · পাইথন প্রোগ্রামিং</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Tamim Shahriar">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="loop-python.html" />
    
    
    <link rel="prev" href="conditional-logic-python.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="অনুসন্ধান" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/subeen/python-programming-bangla" target="_blank" class="custom-link">পাইথন প্রোগ্রামিং</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="index.html">
            
                    
                    ভূমিকা
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="programming-and-python.html">
            
                <a href="programming-and-python.html">
            
                    
                    প্রোগ্রামিং ও পাইথন 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello-world-python.html">
            
                <a href="hello-world-python.html">
            
                    
                    পাইথন দিয়ে প্রথম প্রোগ্রাম
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="variable-data-type-python.html">
            
                <a href="variable-data-type-python.html">
            
                    
                    ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="conditional-logic-python.html">
            
                <a href="conditional-logic-python.html">
            
                    
                    কন্ডিশনাল লজিক
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="turtle-python.html">
            
                <a href="turtle-python.html">
            
                    
                    টার্টলের সঙ্গে পরিচয়
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="loop-python.html">
            
                <a href="loop-python.html">
            
                    
                    লুপ - একই কাজ অনেকবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="function-python.html">
            
                <a href="function-python.html">
            
                    
                    ফাংশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="string-python.html">
            
                <a href="string-python.html">
            
                    
                    স্ট্রিং নিয়ে কাজকারবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="list-tuple-python.html">
            
                <a href="list-tuple-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="set-dictionary-python.html">
            
                <a href="set-dictionary-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="module-package.html">
            
                <a href="module-package.html">
            
                    
                    মডিউল ও প্যাকেজ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="object-class-python.html">
            
                <a href="object-class-python.html">
            
                    
                    অবজেক্ট ও ক্লাস
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix.html">
            
                <a href="appendix.html">
            
                    
                    বই ও ওয়েবসাইটের তালিকা
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com/" target="blank" class="gitbook-link">
            গিটবুকের মাধ্যমে প্রকাশিত
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="" >টার্টলের সঙ্গে পরিচয়</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0;-&#x9B8;&#x999;&#x9CD;&#x997;&#x9C7;-&#x9AA;&#x9B0;&#x9BF;&#x99A;&#x9DF;">&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9AA;&#x9B0;&#x9BF;&#x99A;&#x9DF;</h1>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9B0;&#x9BF;&#x99A;&#x9BF;&#x9A4; &#x9B9;&#x9AC;&#x9C7;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x99C;&#x9BE;&#x9B0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; turtle&#x964; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x98F;&#x987; &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x986;&#x99B;&#x9C7;, &#x9AF;&#x9C7;&#x99F;&#x9BF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9B0;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9C7;&#x964; &#x995;&#x9BE;&#x9B0;&#x9C7;&#x9BE; &#x995;&#x9AE;&#x9CD;&#x9AA;&#x9BF;&#x989;&#x99F;&#x9BE;&#x9B0; turtle &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9B0;&#x9BE; &#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; (&#x9AA;&#x9B0;&#x9BF;&#x9B6;&#x9BF;&#x9B7;&#x9CD;&#x99F; &#x985;&#x982;&#x9B6;&#x9C7; turtle &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9A6;&#x9CD;&#x9A7;&#x9A4;&#x9BF; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;)&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; &#x9AF;&#x9C7;, &#x98F;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9B0;&#x9BE; &#x986;&#x99B;&#x9C7; &#x995;&#x9C0; &#x9A8;&#x9C7;&#x987;&#x964; &#x986;&#x9B0; turtle &#x9B6;&#x9AC;&#x9CD;&#x9A6;&#x9C7;&#x9B0; &#x985;&#x9B0;&#x9CD;&#x9A5; &#x995;&#x99A;&#x9CD;&#x99B;&#x9AA;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BE;&#x982;&#x9B2;&#x9BE;&#x9DF; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9A8;&#x9BE;&#x9AE;&#x9C7;&#x987; &#x99A;&#x9BF;&#x9A8;&#x9AC;&#x9CB;, &#x995;&#x9BE;&#x9B0;&#x9A3; &#x98F;&#x99F;&#x9BF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> turtle

turtle.forward(<span class="hljs-number">100</span>)

turtle.exitonclick()
</code></pre>
<p>&#x9AF;&#x9A6;&#x9BF; &#x98F;&#x9B0;&#x995;&#x9AE; &#x98F;&#x9B0;&#x9B0; &#x9A6;&#x9C7;&#x9DF; &#x9AF;&#x9C7;, ImportError: No module named &apos;turtle&apos; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9AF;&#x9C7;, &#x98F;&#x99F;&#x9BF; &#x987;&#x9A8;&#x9B8;&#x9CD;&#x99F;&#x9B2; &#x995;&#x9B0;&#x9BE; &#x9A8;&#x9C7;&#x987;&#x964; &#x986;&#x9B0; &#x9AF;&#x9A6;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x98F;&#x9B0;&#x9B0; &#x9A8;&#x9BE; &#x9A6;&#x9C7;&#x9DF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x99B;&#x9AC;&#x9BF; &#x986;&#x9B8;&#x9AC;&#x9C7; :</p>
<p><img src="assets/turtle.png" alt=""></p>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9B8;&#x9BE; &#x9AF;&#x9BE;&#x995;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BF; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x995;&#x9C0; &#x9B2;&#x9BF;&#x996;&#x9B2;&#x9BE;&#x9AE; &#x9B8;&#x9C7;&#x987; &#x986;&#x9B2;&#x9C7;&#x9BE;&#x99A;&#x9A8;&#x9BE;&#x9DF;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF; import turtle&#x964; &#x98F;&#x9B0; &#x9AE;&#x9BE;&#x9A7;&#x9CD;&#x9AF;&#x9AE;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AF;&#x9C7;&#x987; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1;&#x9C7; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9B8;&#x99B;&#x9BF;&#x964; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9B9;&#x9BE;&#x99C;&#x9BE;&#x9B0; &#x9B9;&#x9BE;&#x99C;&#x9BE;&#x9B0; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x9B8;&#x9AC; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x995;&#x9BE;&#x99C; &#x987;&#x9A4;&#x9BF;&#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x9B8;&#x9AC; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9A4;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9B8;&#x9C7;&#x99F;&#x9BF; import &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF; turtle.forward(100)&#x964; &#x98F;&#x987; &#x995;&#x9AE;&#x9BE;&#x9A8;&#x9CD;&#x9A1; &#x9AC;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9C7;&#x99F;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x995;&#x9C7; 100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x99B;&#x9BF;&#x964; &#x9B8;&#x9C7; &#x995;&#x9C0;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AF;&#x9BE;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AC;&#x9B2;&#x9BE; &#x986;&#x99B;&#x9C7; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9AE;&#x9A1;&#x9BF;&#x989;&#x9B2;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7;, &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9A4;&#x9BE;&#x987; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964; &#x986;&#x9B0; &#x9B9;&#x9CD;&#x9AF;&#x9BE;&#x981;, &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9AE;&#x9BE;&#x9A8;&#x9C7; &#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9C7;&#x9B0; &#x995;&#x9CD;&#x9B7;&#x9C1;&#x9A6;&#x9CD;&#x9B0;&#x9A4;&#x9AE; &#x98F;&#x995;&#x995;, &#x9AF;&#x9BE;&#x995;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9C7;&#x9BE;&#x99D;&#x9BE;&#x9B0; &#x9B8;&#x9C1;&#x9AC;&#x9BF;&#x9A7;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9A8;&#x9CD;&#x9A6;&#x9C1; &#x9A7;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9A4;&#x9C3;&#x9A4;&#x9C0;&#x9DF; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9B2;&#x9BF;&#x996;&#x9C7;&#x99B;&#x9BF; turtle.exitonclick() &#x9AF;&#x9BE; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9A6;&#x9C7;&#x9B6; &#x9A6;&#x9BF;&#x99A;&#x9CD;&#x99B;&#x9BF; &#x9AF;&#x9C7;, &#x9AF;&#x9C7;&#x987; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x989;&#x987;&#x9A8;&#x9CD;&#x9A1;&#x9C7;&#x9BE;&#x99F;&#x9BF; &#x986;&#x9B8;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x99C;&#x9BE;&#x9DF;&#x997;&#x9BE;&#x9DF; &#x995;&#x9CD;&#x9B2;&#x9BF;&#x995; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9AC;&#x9A8;&#x9CD;&#x9A7; &#x9B9;&#x9DF;&#x9C7; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x98F;&#x9AC;&#x9BE;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE;, &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9B0;&#x9CD;&#x997;&#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF; &#x9AC;&#x9BE;&#x9B9;&#x9C1;&#x9B0; &#x9A6;&#x9C8;&#x9B0;&#x9CD;&#x998;&#x9CD;&#x9AF; &#x9AF;&#x9A6;&#x9BF; 100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9A7;&#x9BE;&#x9AA;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x985;&#x9A8;&#x9C1;&#x9B8;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; :</p>
<ol>
<li>&#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; 100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>90 &#x9A1;&#x9BF;&#x997;&#x9CD;&#x9B0;&#x9C0; &#x9AC;&#x9BE;&#x9AE;&#x9C7; &#x998;&#x9C1;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>90 &#x9A1;&#x9BF;&#x997;&#x9CD;&#x9B0;&#x9C0; &#x9AC;&#x9BE;&#x9AE;&#x9C7; &#x998;&#x9C1;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>90 &#x9A1;&#x9BF;&#x997;&#x9CD;&#x9B0;&#x9C0; &#x9AC;&#x9BE;&#x9AE;&#x9C7; &#x998;&#x9C1;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>100 &#x9AA;&#x9BF;&#x995;&#x9CD;&#x9B8;&#x9C7;&#x9B2; &#x9B8;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
<li>90 &#x9A1;&#x9BF;&#x997;&#x9CD;&#x9B0;&#x9C0; &#x9AC;&#x9BE;&#x9AE;&#x9C7; &#x998;&#x9C1;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</li>
</ol>
<p>&#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9AC;&#x9BE;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BF;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> turtle

turtle.shape(<span class="hljs-string">&quot;turtle&quot;</span>)

turtle.forward(<span class="hljs-number">100</span>)
turtle.left(<span class="hljs-number">90</span>)
turtle.forward(<span class="hljs-number">100</span>)
turtle.left(<span class="hljs-number">90</span>)
turtle.forward(<span class="hljs-number">100</span>)
turtle.left(<span class="hljs-number">90</span>)

turtle.exitonclick()
</code></pre>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B8;&#x9C7;&#x9AD; &#x995;&#x9B0;&#x9C7; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; -</p>
<p><img src="assets/turtle2.png" alt=""></p>
<p>&#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AC;&#x9B0;&#x9CD;&#x997;&#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0; &#x9B8;&#x9AE;&#x9CD;&#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3; &#x9B9;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BE;&#x964; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x9A6;&#x9C1;&#x987; &#x9B2;&#x9BE;&#x987;&#x9A8; (&#x995;&#x9AE;&#x9AA;&#x995;&#x9CD;&#x9B7;&#x9C7; &#x98F;&#x995; &#x9B2;&#x9BE;&#x987;&#x9A8;) &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x987; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9BF; &#x9AA;&#x9BE;&#x9A0;&#x995;&#x9C7;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9B0;&#x9C7;&#x996;&#x9C7; &#x9A6;&#x9BF;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9BE;&#x9AA;&#x9BE;&#x9B0; &#x996;&#x9C7;&#x9DF;&#x9BE;&#x9B2; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9AF;&#x9C7;, &#x98F;&#x987; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE;&#x987; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9C7;&#x964; &#x995;&#x9BE;&#x9B0;&#x9A3; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x9A6;&#x9CD;&#x9AC;&#x9BF;&#x9A4;&#x9C0;&#x9DF; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0; &#x997;&#x9A4;&#x9BF; &#x9A8;&#x9BF;&#x9DF;&#x9A8;&#x9CD;&#x9A4;&#x9CD;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x98F;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; speed() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x98F;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; 0 &#x9A5;&#x9C7;&#x995;&#x9C7; 10 &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x964; 1 &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9B8;&#x9AC;&#x99A;&#x9C7;&#x9DF;&#x9C7; &#x9A7;&#x9C0;&#x9B0;&#x997;&#x9A4;&#x9BF;&#x9B0;&#x964; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x9B0; &#x9AE;&#x9BE;&#x9A8; &#x9AC;&#x9BE;&#x9DC;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x997;&#x9A4;&#x9BF; &#x9AC;&#x9BE;&#x9DC;&#x9A4;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7;, &#x9A4;&#x9BE;&#x9B0; &#x9AE;&#x9BE;&#x9A8;&#x9C7; 10 &#x985;&#x9A8;&#x9C7;&#x995; &#x9AC;&#x9C7;&#x9B6;&#x9BF; &#x9A6;&#x9CD;&#x9B0;&#x9C1;&#x9A4;&#x997;&#x9A4;&#x9BF;&#x9B0;&#x964; &#x986;&#x9B0; 0 &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9B8;&#x9AC;&#x99A;&#x9C7;&#x9DF;&#x9C7; &#x9A6;&#x9CD;&#x9B0;&#x9C1;&#x9A4;&#x997;&#x9A4;&#x9BF;&#x9B0;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9A8;&#x9BE; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x997;&#x9A4;&#x9BF;&#x9B0; &#x9A1;&#x9BF;&#x9AB;&#x9B2;&#x9CD;&#x99F; &#x9AE;&#x9BE;&#x9A8; 0 &#x9B9;&#x9DF;, &#x98F;&#x9AC;&#x982; &#x9A4;&#x996;&#x9A8; &#x9B8;&#x9AC;&#x99A;&#x9C7;&#x9DF;&#x9C7; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2;&#x9C7;&#x9B0; &#x997;&#x9A4;&#x9BF; &#x9B9;&#x9DF; &#x9B8;&#x9AC;&#x99A;&#x9C7;&#x9DF;&#x9C7; &#x9A6;&#x9CD;&#x9B0;&#x9C1;&#x9A4;&#x964; &#x9AC;&#x9BE;&#x995;&#x9C0;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9AA;&#x9B0;&#x9C0;&#x995;&#x9CD;&#x9B7;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x986;&#x997;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7; turtle.shape(&#x201C;turtle&#x201D;) &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7;&#x9B0; &#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x98F;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; : turtle.speed(2)&#x964;</p>
<p>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0; &#x983; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9B2; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9B8;&#x9AE;&#x9AC;&#x9BE;&#x9B9;&#x9C1; &#x9A4;&#x9CD;&#x9B0;&#x9BF;&#x9AD;&#x9C2;&#x99C; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; &#x9AF;&#x9C7;&#x987; &#x9A4;&#x9CD;&#x9B0;&#x9BF;&#x9AD;&#x9C2;&#x99C;&#x9C7;&#x9B0; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BF; &#x9AC;&#x9BE;&#x9B9;&#x9C1;&#x9B0; &#x9A6;&#x9C8;&#x9B0;&#x9CD;&#x998;&#x9CD;&#x9AF;&#x987; &#x9B8;&#x9AE;&#x9BE;&#x9A8;&#x964; &#x986;&#x9B0; &#x99B;&#x9C7;&#x9BE;&#x99F;&#x9A6;&#x9C7;&#x9B0; &#x9AA;&#x9BE;&#x9A0;&#x9CD;&#x9AF;&#x9AC;&#x987;&#x9A4;&#x9C7; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AC;&#x9B2;&#x9BE; &#x986;&#x99B;&#x9C7; &#x9AF;&#x9C7; &#x9B8;&#x9AE;&#x9AC;&#x9BE;&#x9B9;&#x9C1; &#x9A4;&#x9CD;&#x9B0;&#x9BF;&#x9AD;&#x9C2;&#x99C;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x995;&#x9C7;&#x9BE;&#x9A3; &#x9B9;&#x9AC;&#x9C7; 60 &#x9A1;&#x9BF;&#x997;&#x9CD;&#x9B0;&#x9C0;&#x964; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x99B;&#x9AC;&#x9BF;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; -</p>
<p><img src="assets/tria.png" alt=""><br>&#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9A8;&#x9BE; &#x9AA;&#x9BE;&#x9B0;&#x9B2;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9AF;&#x9C7; &#x997;&#x9A3;&#x9BF;&#x9A4;&#x9C7;&#x9B0; &#x9AE;&#x9C7;&#x9D7;&#x9B2;&#x9BF;&#x995; &#x99C;&#x9CD;&#x99E;&#x9BE;&#x9A8;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995; &#x998;&#x9BE;&#x99F;&#x9A4;&#x9BF; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7; &#x98F;&#x9AC;&#x982; &#x9A4;&#x996;&#x9A8; &#x9B8;&#x9CD;&#x995;&#x9C1;&#x9B2;&#x9C7;&#x9B0; &#x997;&#x9A3;&#x9BF;&#x9A4; &#x9AC;&#x987; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x9AC;&#x9B8;&#x9C7; &#x9AD;&#x9BE;&#x9B2;&#x9C7;&#x9BE;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AA;&#x9DC;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x997;&#x9A3;&#x9BF;&#x9A4;&#x9C7;&#x9B0; &#x9AC;&#x9C7;&#x9B8;&#x9BF;&#x995; &#x9A6;&#x9C1;&#x9B0;&#x9CD;&#x9AC;&#x9B2; &#x9AC;&#x9B2;&#x9C7; &#x995;&#x9BE;&#x9A8;&#x9CD;&#x9A8;&#x9BE;&#x995;&#x9BE;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x99A;&#x9B2;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x9AC;&#x9C1;&#x99D;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9C7; &#x9AC;&#x987; &#x9AA;&#x9DC;&#x9B2;&#x9C7;&#x987; &#x9AC;&#x9C7;&#x9B8;&#x9BF;&#x995; &#x9AD;&#x9BE;&#x9B2;&#x9C7;&#x9BE; &#x9B9;&#x9DF;&#x9C7; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x964;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="conditional-logic-python.html" class="navigation navigation-prev " aria-label="Previous page: কন্ডিশনাল লজিক">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="loop-python.html" class="navigation navigation-next " aria-label="Next page: লুপ - একই কাজ অনেকবার">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"টার্টলের সঙ্গে পরিচয়","level":"1.6","depth":1,"next":{"title":"লুপ - একই কাজ অনেকবার","level":"1.7","depth":1,"path":"loop-python.md","ref":"loop-python.md","articles":[]},"previous":{"title":"কন্ডিশনাল লজিক","level":"1.5","depth":1,"path":"conditional-logic-python.md","ref":"conditional-logic-python.md","articles":[]},"dir":"ltr"},"config":{"plugins":[""],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Tamim Shahriar","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"পাইথন প্রোগ্রামিং","language":"bn","links":{"sidebar":{"পাইথন প্রোগ্রামিং":"https://www.gitbook.com/book/subeen/python-programming-bangla"},"gitbook":true},"gitbook":"*","description":"পাইথন প্রোগ্রামিং ভাষা (ভার্শন ৩) শেখার বাংলা বই। বইটি প্রোগ্রামিংয়ে যারা নতুন, তাদের জন্য উপযোগি। এছাড়া যারা অন্য প্রোগ্রামিং ভাষা জানে কিন্তু পাইথন শিখতে চায়, তারাও বইটি পড়ে পাইথন শিখতে পারবে।"},"file":{"path":"turtle-python.md","mtime":"2018-03-06T03:14:11.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-03-06T03:33:35.750Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    
<div><script style="display: none;" type="application/javascript">
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','../www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-57505611-7', 'auto', {name: 'microcdn'});
  ga('microcdn.send', 'pageview');

  var _cdn_prev_loc = window.location.pathname;
  window.setInterval(function () {
    if (window.location.pathname !== _cdn_prev_loc) {
      _cdn_prev_loc = window.location.pathname;
      ga('microcdn.send', 'pageview');
    }
  }, 100);

</script></div>
</body>

<!-- Mirrored from pybook.subeen.com/turtle-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:28 GMT -->
</html>

