
<!DOCTYPE HTML>
<html lang="bn" >
    
<!-- Mirrored from pybook.subeen.com/variable-data-type-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:25 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=UTF-8" /><!-- /Added by HTTrack -->
<head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন · পাইথন প্রোগ্রামিং</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Tamim Shahriar">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="conditional-logic-python.html" />
    
    
    <link rel="prev" href="hello-world-python.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="অনুসন্ধান" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/subeen/python-programming-bangla" target="_blank" class="custom-link">পাইথন প্রোগ্রামিং</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="index.html">
            
                    
                    ভূমিকা
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="programming-and-python.html">
            
                <a href="programming-and-python.html">
            
                    
                    প্রোগ্রামিং ও পাইথন 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello-world-python.html">
            
                <a href="hello-world-python.html">
            
                    
                    পাইথন দিয়ে প্রথম প্রোগ্রাম
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="variable-data-type-python.html">
            
                <a href="variable-data-type-python.html">
            
                    
                    ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="conditional-logic-python.html">
            
                <a href="conditional-logic-python.html">
            
                    
                    কন্ডিশনাল লজিক
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="turtle-python.html">
            
                <a href="turtle-python.html">
            
                    
                    টার্টলের সঙ্গে পরিচয়
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="loop-python.html">
            
                <a href="loop-python.html">
            
                    
                    লুপ - একই কাজ অনেকবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="function-python.html">
            
                <a href="function-python.html">
            
                    
                    ফাংশন
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="string-python.html">
            
                <a href="string-python.html">
            
                    
                    স্ট্রিং নিয়ে কাজকারবার
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="list-tuple-python.html">
            
                <a href="list-tuple-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - লিস্ট ও টাপল
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="set-dictionary-python.html">
            
                <a href="set-dictionary-python.html">
            
                    
                    পাইথনের ডেটা স্ট্রাকচার - সেট ও ডিকশনারি
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="module-package.html">
            
                <a href="module-package.html">
            
                    
                    মডিউল ও প্যাকেজ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="object-class-python.html">
            
                <a href="object-class-python.html">
            
                    
                    অবজেক্ট ও ক্লাস
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="appendix.html">
            
                <a href="appendix.html">
            
                    
                    বই ও ওয়েবসাইটের তালিকা
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com/" target="blank" class="gitbook-link">
            গিটবুকের মাধ্যমে প্রকাশিত
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="" >ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;-&#x9A1;&#x9C7;&#x99F;&#x9BE;-&#x99F;&#x9BE;&#x987;&#x9AA;-&#x993;-&#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995;-&#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8;">&#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;, &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x99F;&#x9BE;&#x987;&#x9AA; &#x993; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8;</h1>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x987;&#x9A4;&#x9BF;&#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7;&#x987; &#x99C;&#x9C7;&#x9A8;&#x9C7; &#x997;&#x9BF;&#x9DF;&#x9C7;&#x99B;&#x9BF; &#x9AF;&#x9C7;, &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9B0;&#x995;&#x9AE;&#x9C7;&#x9B0; &#x9A4;&#x9A5;&#x9CD;&#x9AF; &#x9AA;&#x9CD;&#x9B0;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9DF;&#x9BE; &#x995;&#x9B0;&#x9BE;&#x964; &#x9A4;&#x9C7;&#x9BE; &#x98F;&#x987; &#x9A4;&#x9A5;&#x9CD;&#x9AF; &#x9AA;&#x9CD;&#x9B0;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9DF;&#x9BE; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE;&#x9C7; &#x995;&#x9AE;&#x9CD;&#x9AA;&#x9BF;&#x989;&#x99F;&#x9BE;&#x9B0;&#x9C7;&#x9B0; &#x9AE;&#x9C7;&#x9AE;&#x9C7;&#x9BE;&#x9B0;&#x9BF;&#x9A4;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x98F;&#x9AC;&#x982; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x9A7;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x995;, &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x9B9;&#x9B2;&#x9C7;&#x9BE; &#x98F;&#x9AC;&#x982; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x9AF;&#x9C7;&#x9BE;&#x997;&#x9AB;&#x9B2; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x98F;&#x996;&#x9A8;, &#x9AF;&#x9C7;&#x987; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x9A4;&#x9C7;&#x9BE; &#x995;&#x9C7;&#x9BE;&#x9A5;&#x9BE;&#x993; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;, &#x986;&#x9B0; &#x9AF;&#x9C7;&#x9BE;&#x997;&#x9AB;&#x9B2;&#x995;&#x9C7;&#x993; &#x98F;&#x995; &#x99C;&#x9BE;&#x9DF;&#x997;&#x9BE;&#x9DF; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x98F;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; (variable)&#x964; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9A7;&#x9B0;&#x9A8;&#x9C7;&#x9B0; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9AC;&#x9C7;&#x9B0; &#x985;&#x9A7;&#x9CD;&#x9AF;&#x9BE;&#x9DF;&#x9C7; &#x995;&#x9B0;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x98F;&#x996;&#x9A8; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;, &#x98F;&#x9B0;&#x9AA;&#x9B0; &#x9AF;&#x9C7;&#x9BE;&#x997;&#x9AB;&#x9B2; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B9;&#x9AC;&#x9C7; &#x98F;&#x9B0;&#x995;&#x9AE; :</p>
<pre><code class="lang-py">text_to_print = <span class="hljs-string">&quot;Hello World&quot;</span>
print(text_to_print)
</code></pre>
<p>&#x98F;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9AC;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9C7; Hello World &#x9B2;&#x9C7;&#x996;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; text_to_print &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;, &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x986;&#x9AE;&#x9BF; Hello World &#x995;&#x9A5;&#x9BE;&#x99F;&#x9BF; &#x99C;&#x9AE;&#x9BE; &#x9B0;&#x9BE;&#x996;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;&#x964; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9A8;&#x9BF;&#x9DF;&#x9AE;&#x995;&#x9BE;&#x9A8;&#x9C1;&#x9A8; &#x986;&#x99B;&#x9C7;, &#x9AF;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x99F;&#x9C7;&#x995;&#x9CD;&#x9B8;&#x99F; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9A6;&#x9C7;&#x993;&#x9DF;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x996;&#x9A8; &#x9B8;&#x9C7;&#x987;&#x9B8;&#x9AC; &#x9A8;&#x9BF;&#x9DF;&#x9AE; &#x9AE;&#x9C1;&#x996;&#x9B8;&#x9CD;&#x9A5; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AF;&#x9BE;&#x9AC;&#x9C7;&#x9BE; &#x9A8;&#x9BE;, &#x9AC;&#x9B0;&#x982; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9A4;&#x9C7; &#x986;&#x9B0; &#x9B8;&#x9C7;&#x987; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9AD;&#x9C1;&#x9B2; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9B6;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x996;&#x9A8; text_to_print &#x9A8;&#x9BE; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x985;&#x9A8;&#x9CD;&#x9AF; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9A8;&#x9BE;&#x9AE;&#x993; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9A4;&#x9BE;&#x9AE;, &#x9AF;&#x9C7;&#x9AE;&#x9A8; a, b, c, s &#x987;&#x9A4;&#x9CD;&#x9AF;&#x9BE;&#x9A6;&#x9BF;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x996;&#x9C7;&#x9DF;&#x9BE;&#x9B2; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9AF;&#x9C7;&#x9A8; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x985;&#x9B0;&#x9CD;&#x9A5;&#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3; &#x9B9;&#x9DF;, &#x9AE;&#x9BE;&#x9A8;&#x9C7; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x9AF;&#x9C7;&#x9A8; &#x9AC;&#x9C1;&#x99D;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF; &#x9AF;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9C0; &#x995;&#x9BE;&#x99C;&#x9C7; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9C3;&#x9A4; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;&#x964;</p>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9AE;&#x9BF;&#x9A8;&#x9BE;&#x9B2;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x99A;&#x9BE;&#x9B2;&#x9C1; &#x995;&#x9B0;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A5;&#x9AE; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x964; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9B0;&#x9BE;&#x996;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9B0;&#x9BE; number1 &#x993; number2 &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BF; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x986;&#x9B0; &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AF;&#x9C7;&#x9BE;&#x997;&#x9AB;&#x9B2; &#x9B0;&#x9BE;&#x996;&#x9AC;&#x9C7;&#x9BE; result &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>number1 = <span class="hljs-number">10</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>number2 = <span class="hljs-number">5</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>result = number1 + number2
<span class="hljs-meta">&gt;&gt;&gt; </span>print(result)
<span class="hljs-number">15</span>
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x989;&#x9AA;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9BE;&#x9AE;, &#x9AF;&#x9C7;&#x99F;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AF;&#x9C7;&#x9BE;&#x997; (+)&#x964; &#x9A4;&#x9C7;&#x9AE;&#x9A8;&#x9BF; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BF;&#x9DF;&#x9C7;&#x9BE;&#x997; (-), &#x997;&#x9C1;&#x9A3; (*) &#x993; &#x9AD;&#x9BE;&#x997;&#x9C7;&#x9B0; (/) &#x995;&#x9BE;&#x99C;&#x993; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x9AF;&#x9BE;&#x9B0;&#x9BE; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9BF;&#x996;&#x99B;&#x9C7;, &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF; &#x986;&#x9AE;&#x9BE;&#x9B0; &#x9AA;&#x9B0;&#x9BE;&#x9AE;&#x9B0;&#x9CD;&#x9B6; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AF;&#x9C7;, &#x986;&#x9AE;&#x9BF; &#x9AC;&#x987;&#x9A4;&#x9C7; &#x9AF;&#x9C7;&#x9B8;&#x9AC; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;, &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x9AA;&#x9DC;&#x9B2;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x9B8;&#x9C7;&#x987; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x995;&#x9AE;&#x9CD;&#x9AA;&#x9BF;&#x989;&#x99F;&#x9BE;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE; &#x9B8;&#x9B9;&#x99C; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; number1 = 10 &#x9AF;&#x9C7; &#x9B2;&#x9BF;&#x996;&#x9B2;&#x9BE;&#x9AE;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9AC;&#x9C7;&#x9BE;&#x99D;&#x9BE;&#x9DF; &#x9AF;&#x9C7;, number1 &#x9A8;&#x9BE;&#x9AE;&#x9C7;&#x9B0; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; 10 &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;&#x964; &#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x9B0;&#x9AA;&#x9B0; number1 &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7; &#x985;&#x9A8;&#x9CD;&#x9AF; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9B8;&#x9C7;&#x99F;&#x9BF;&#x993; &#x9B8;&#x9AE;&#x9CD;&#x9AD;&#x9AC;&#x964; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9B2;&#x995;&#x9CD;&#x9B7; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9AC;&#x9BF;&#x9B7;&#x9DF;&#x99F;&#x9BF; &#x9AA;&#x9B0;&#x9BF;&#x9B7;&#x9CD;&#x995;&#x9BE;&#x9B0; &#x9B9;&#x9AC;&#x9C7; :</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>number1 = <span class="hljs-number">10</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(number1)
<span class="hljs-number">10</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>number1 = <span class="hljs-number">15</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>number1 = <span class="hljs-number">18</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(number1)
<span class="hljs-number">18</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>number1 = <span class="hljs-string">&quot;hello&quot;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(number1)
hello
&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF; &#x9AF;&#x9C7;, &#x98F;&#x995;&#x99F;&#x9BF; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9B0;&#x995;&#x9AE; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x9A4;&#x9AC;&#x9C7; &#x9B8;&#x9B0;&#x9CD;&#x9AC;&#x9B6;&#x9C7;&#x9B7; &#x9AF;&#x9C7;&#x99F;&#x9BF; &#x9B0;&#x9BE;&#x996;&#x9AC;&#x9C7;&#x9BE;, &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x9B8;&#x9C7;&#x99F;&#x9BF;&#x987; &#x9AE;&#x9A8;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9AC;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x995;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x997;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x9A4;&#x9C1;&#x9B2;&#x9A8;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x98F;&#x995;&#x99F;&#x9BF; &#x997;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7; &#x986;&#x9AE;&#x9BF; &#x9AA;&#x9BE;&#x9A8;&#x9BF; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9B8;&#x9C7;&#x987; &#x997;&#x9CD;&#x9B2;&#x9BE;&#x9B8;&#x9C7; &#x9A6;&#x9C1;&#x9A7; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;, &#x9B6;&#x9B0;&#x9AC;&#x9A4; &#x9B0;&#x9BE;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x985;&#x9A8;&#x9CD;&#x9AF; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9BE;&#x9A8;&#x9C0;&#x9DF;&#x964; &#x98F;&#x995;&#x99F;&#x9BF; &#x997;&#x9CD;&#x9B2;&#x9BE;&#x9B8; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9A6;&#x9BF;&#x9B7;&#x9CD;&#x99F; &#x9B8;&#x9AE;&#x9DF;&#x9C7; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x98F;&#x995; &#x9AA;&#x9CD;&#x9B0;&#x995;&#x9BE;&#x9B0; &#x9A4;&#x9B0;&#x9B2; &#x9AA;&#x9A6;&#x9BE;&#x9B0;&#x9CD;&#x9A5; &#x9A7;&#x9BE;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9C7;&#x9AE;&#x9A8;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9A7;&#x9BE;&#x9B0;&#x9A3; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9C7;&#x996;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9BF;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; number1 = &quot;hello&quot;
&gt;&gt;&gt; number2 = 2
&gt;&gt;&gt; result = number1 + number2
Traceback (most recent call last):
  File &quot;&lt;stdin&gt;&quot;, line 1, in &lt;module&gt; 
TypeError: Can&apos;t convert &apos;int&apos; object to str implicitly
</code></pre>
<p>&#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9AC;&#x9B2;&#x99B;&#x9C7; &#x9AF;&#x9C7;, &#x98F;&#x995;&#x99F;&#x9BF; &#x98F;&#x9B0;&#x9B0; &#x9B9;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x98F;&#x9B0;&#x9B0;&#x99F;&#x9BF; &#x995;&#x9C0;? &#x98F;&#x996;&#x9A8; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x996;&#x9C1;&#x9AC; &#x9AC;&#x9C7;&#x9B6;&#x9BF; &#x9AC;&#x9C7;&#x9BE;&#x99D;&#x9BE;&#x9B0; &#x995;&#x9A5;&#x9BE; &#x9A8;&#x9DF;&#x964; &#x995;&#x9BE;&#x9B0;&#x9A3; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x982; &#x9B6;&#x9C7;&#x996;&#x9BE; &#x9B6;&#x9C1;&#x9B0;&#x9C1; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;&#x964;</p>
<p>&#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9BF;&#x99F;&#x9BF; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x987; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9C7; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9B0;&#x9BE;&#x996;&#x9BF;, &#x9A4;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9BF;&#x9B0;&#x9CD;&#x9A6;&#x9BF;&#x9B7;&#x9CD;&#x99F; &#x9A7;&#x9B0;&#x9A8; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8; 10 &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3;&#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; (&#x987;&#x982;&#x9B0;&#x9C7;&#x99C;&#x9BF;&#x9A4;&#x9C7; integer)&#x964; &#x201C;hello&#x201D; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; (string)&#x964; &#x9A4;&#x9C7;&#x9BE; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x9B0; &#x99F;&#x9BE;&#x987;&#x9AA; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9C7;? &#x9B8;&#x9C7; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BE; &#x9A7;&#x9BE;&#x9B0;&#x9A3;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9A8;&#x9C7;&#x9DF;, &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x9A8;&#x9BF;&#x99C; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9DF; &#x9A8;&#x9BE;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99A;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7; &#x9B8;&#x982;&#x9B0;&#x995;&#x9CD;&#x9B7;&#x9BF;&#x9A4; &#x9A1;&#x9C7;&#x99F;&#x9BE;&#x9B0; &#x99F;&#x9BE;&#x987;&#x9AA; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; v = 10
&gt;&gt;&gt; type(v)
&lt;class &apos;int&apos;&gt;
&gt;&gt;&gt; v = &quot;10&quot;
&gt;&gt;&gt; type(v)
&lt;class &apos;str&apos;&gt;
&gt;&gt;&gt; v = 10.0
&gt;&gt;&gt; type(v)
&lt;class &apos;float&apos;&gt;
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9A4;&#x9BF;&#x9A8; &#x9A7;&#x9B0;&#x9A8;&#x9C7;&#x9B0; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x99F;&#x9BE;&#x987;&#x9AA; &#x9A6;&#x9C7;&#x996;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF; - int, str &#x993; float&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3; &#x9B0;&#x9C2;&#x9AA; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; integer, string &#x993; float&#x964; integer &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AA;&#x9C2;&#x9B0;&#x9CD;&#x9A3;&#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;, &#x986;&#x9B0; float &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x9AF;&#x9C7;&#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AC;&#x9BE;&#x9B8;&#x9CD;&#x9A4;&#x9AC; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AC;&#x9BE; &#x9A6;&#x9B6;&#x9AE;&#x9BF;&#x995; &#x9AF;&#x9C1;&#x995;&#x9CD;&#x9A4; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x964; &#x986;&#x9B0; string &#x9B6;&#x9AC;&#x9CD;&#x9A6;&#x9C7;&#x9B0; &#x985;&#x9B0;&#x9CD;&#x9A5; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99B;&#x9C7; &#x9A6;&#x9DC;&#x9BF; (&#x9AC;&#x9BE; &#x9B0;&#x9B6;&#x9BF;) &#x9AE;&#x9A8;&#x9C7; &#x9B9;&#x9B2;&#x9C7;&#x993; &#x98F;&#x99F;&#x9BF; &#x986;&#x9B8;&#x9B2;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x99F;&#x9BE;&#x987;&#x9AA; &#x9AF;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x98F;&#x995; &#x9AC;&#x9BE; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x985;&#x995;&#x9CD;&#x9B7;&#x9B0; (&#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;, &#x99A;&#x9BF;&#x9B9;&#x9CD;&#x9A8; &#x9AC;&#x9BE; &#x9AC;&#x9B0;&#x9CD;&#x9A3;) &#x9A5;&#x9BE;&#x995;&#x9C7;&#x964; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x9DF;&#x9C7; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x9B9;&#x9DF; &#x9B8;&#x9BF;&#x999;&#x9CD;&#x997;&#x9C7;&#x9B2; &#x995;&#x9C7;&#x9BE;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x99A;&#x9BF;&#x9B9;&#x9CD;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; (&#x9AF;&#x9C7;&#x9AE;&#x9A8; : &apos;abc&apos;), &#x985;&#x9A5;&#x9AC;&#x9BE; &#x9A1;&#x9AC;&#x9B2; &#x995;&#x9C7;&#x9BE;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x99A;&#x9BF;&#x9B9;&#x9CD;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; (&#x9AF;&#x9C7;&#x9AE;&#x9A8; : &#x201C;abc&#x201D;)&#x964; &#x9B8;&#x9BF;&#x999;&#x9CD;&#x997;&#x9C7;&#x9B2; &#x995;&#x9C7;&#x9BE;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9B6;&#x9C1;&#x9B0;&#x9C1;, &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9A1;&#x9AC;&#x9B2; &#x995;&#x9C7;&#x9BE;&#x99F;&#x9C7;&#x9B6;&#x9A8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9B6;&#x9C7;&#x9B7; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x9A4;&#x9BE;&#x9B0; &#x989;&#x9B2;&#x9CD;&#x99F;&#x9C7;&#x9BE;&#x99F;&#x9BF; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x996;&#x9BE;&#x9B2;&#x9BF; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x993; &#x9B8;&#x9AE;&#x9CD;&#x9AD;&#x9AC; (&#x9AF;&#x9C7;&#x9AE;&#x9A8; : &#x201C;&#x201D; &#x9AC;&#x9BE; &apos;&apos;)&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x996;&#x9A8; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x9DF;&#x9C7;&#x9B0; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x989;&#x9A6;&#x9BE;&#x9B9;&#x9B0;&#x9A3; &#x9A6;&#x9C7;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py">&gt;&gt;&gt; s = &quot;100&quot;
&gt;&gt;&gt; print(s)
100
&gt;&gt;&gt; s = &quot;abcd1234-09232&lt;&gt;?323&quot;
&gt;&gt;&gt; print(s)
abcd1234-09232&lt;&gt;?323
&gt;&gt;&gt; s = &apos;abc 123&apos;
&gt;&gt;&gt; print(s)
abc 123
&gt;&gt;&gt; s = &apos;&apos;
&gt;&gt;&gt; print(s)

&gt;&gt;&gt; s = &quot;&quot;
&gt;&gt;&gt; print(s)

&gt;&gt;&gt;
</code></pre>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x996;&#x9A8; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9BF;, &#x9AF;&#x9C7;&#x9AE;&#x9A8; &#x9AF;&#x9C7;&#x9BE;&#x997;-&#x9AC;&#x9BF;&#x9DF;&#x9C7;&#x9BE;&#x997;-&#x997;&#x9C1;&#x9A3;-&#x9AD;&#x9BE;&#x997;, &#x9A4;&#x996;&#x9A8; &#x9AF;&#x9C7;&#x987; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x993;&#x9AA;&#x9B0; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9BE; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x98F;&#x995;&#x987; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x99F;&#x9BE;&#x987;&#x9AA;&#x9C7;&#x9B0; &#x9B9;&#x9A4;&#x9C7; &#x9B9;&#x9DF;, &#x986;&#x9B0; &#x9A8;&#x9BE; &#x9B9;&#x9B2;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9A4;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x98F;&#x995;&#x987; &#x9A1;&#x9C7;&#x99F;&#x9BE; &#x99F;&#x9BE;&#x987;&#x9AA;&#x9C7; &#x9B0;&#x9C2;&#x9AA;&#x9BE;&#x9A8;&#x9CD;&#x9A4;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x9AE;&#x9A8;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x98F;&#x995;&#x99F;&#x9BF; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BF;&#x99C;&#x9BE;&#x9B0; &#x993; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9CD;&#x9B2;&#x9C7;&#x9BE;&#x99F; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9AF;&#x9C7;&#x9BE;&#x997;&#x9AB;&#x9B2; &#x9B9;&#x9AC;&#x9C7; &#x9AB;&#x9CD;&#x9B2;&#x9C7;&#x9BE;&#x99F;&#x964; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BF;&#x99C;&#x9BE;&#x9B0; &#x993; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x9DF;&#x9C7;&#x9B0; &#x9AF;&#x9C7;&#x9BE;&#x997;&#x9C7;&#x9B0; &#x9AC;&#x9C7;&#x9B2;&#x9BE;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x9DF;&#x9C7;&#x9B0; &#x9B8;&#x999;&#x9CD;&#x997;&#x9C7; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BF;&#x99C;&#x9BE;&#x9B0; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9AC;&#x9C7; &#x9A8;&#x9BE;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>a = <span class="hljs-number">1</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>b = <span class="hljs-number">2.5</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>c = a + b
<span class="hljs-meta">&gt;&gt;&gt; </span>print(c)
<span class="hljs-number">3.5</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>
<span class="hljs-meta">&gt;&gt;&gt; </span>a = <span class="hljs-number">1</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>b = <span class="hljs-string">&quot;2&quot;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>c = a + b
Traceback (most recent call last):
 File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
TypeError: unsupported operand type(s) <span class="hljs-keyword">for</span> +: <span class="hljs-string">&apos;int&apos;</span> <span class="hljs-keyword">and</span> <span class="hljs-string">&apos;str&apos;</span>
&gt;&gt;&gt;
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9AE;&#x9BF;&#x9A8;&#x9BE;&#x9B2;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x995;&#x9BF;&#x99B;&#x9C1; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x99F;&#x9B0;&#x9C7;&#x9B0; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x9A8;&#x9C7;&#x9AC;&#x964; &#x98F;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AE;&#x9C1;&#x996;&#x9B8;&#x9CD;&#x9A5; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8; &#x9A8;&#x9C7;&#x987;&#x964; &#x9A0;&#x9BF;&#x995;&#x9A0;&#x9BE;&#x995; &#x99A;&#x9B0;&#x9CD;&#x99A;&#x9BE; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x98F;&#x9AE;&#x9A8;&#x9BF;&#x9A4;&#x9C7;&#x987; &#x9AE;&#x9A8;&#x9C7; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7; &#x986;&#x9B0; &#x9AE;&#x9A8;&#x9C7; &#x9A8;&#x9BE; &#x9A5;&#x9BE;&#x995;&#x9B2;&#x9C7; &#x9AC;&#x987; &#x9AC;&#x9BE; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0;&#x9A8;&#x9C7;&#x99F; &#x998;&#x9C7;&#x981;&#x99F;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9C7; &#x9A8;&#x9BF;&#x9B2;&#x9C7;&#x993; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code>&#x9AD;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BE; -
&gt;&gt;&gt; 5 / 2 
2.5 
&#x9AC;&#x9BF;&#x9DF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BE; - 
&gt;&gt;&gt; 5 - 2
3
&#x997;&#x9C1;&#x9A3; &#x995;&#x9B0;&#x9BE; -
&gt;&gt;&gt; 5 * 2
10
&#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BF;&#x993; &#x9AD;&#x9BE;&#x997;, &#x9A4;&#x9AC;&#x9C7; &#x9AD;&#x9BE;&#x997;&#x9AB;&#x9B2;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9AC;&#x9B2; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BF;&#x99C;&#x9BE;&#x9B0; &#x985;&#x982;&#x9B6; &#x9AA;&#x9BE;&#x993;&#x9DF;&#x9BE; &#x9AF;&#x9BE;&#x9AC;&#x9C7;
&gt;&gt;&gt; 5 // 2
&gt;&gt;&gt; 2
&#x9AE;&#x9A1;&#x9C1;&#x9B2;&#x9BE;&#x9B8; &#x995;&#x9BF;&#x982;&#x9AC;&#x9BE; &#x9AD;&#x9BE;&#x997;&#x9B6;&#x9C7;&#x9B7; -
&gt;&gt;&gt; 5 % 2
1
&#x9AC;&#x9B0;&#x9CD;&#x997; &#x995;&#x9B0;&#x9BE; -
&gt;&gt;&gt; 5 ** 2
25
</code></pre><p>&#x98F;&#x996;&#x9A8; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9B7;&#x9DF; &#x99C;&#x9C7;&#x9A8;&#x9C7; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9C7; print() &#x9B2;&#x9BF;&#x996;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE;&#x995;&#x9BF;&#x99B;&#x9C1; &#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9C7; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x99A;&#x9CD;&#x99B;&#x9BF;, &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; print() &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; (function)&#x964; &#x98F;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9BE; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9AC;&#x9C7;&#x9BE;, &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x9A4;&#x9BE; &#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x995;&#x9B0;&#x9AC;&#x9C7; &#x9AC;&#x9BE; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9AC;&#x9C7;&#x964; &#x98F;&#x996;&#x9A8; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9AD;&#x9C7;&#x9A4;&#x9B0;&#x9C7; &#x9AF;&#x9BE; &#x9AA;&#x9BE;&#x9A0;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9B9;&#x9DF;, &#x9A4;&#x9BE;&#x995;&#x9C7; &#x9AC;&#x9B2;&#x9C7; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; (argument)&#x964; print() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x995;&#x9BF;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x995;&#x9BE;&#x99C; &#x995;&#x9B0;&#x9AC;&#x9C7;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9A8;&#x9BE;, &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7;&#x9B0; &#x9AF;&#x9C7; &#x9B8;&#x9AB;&#x99F;&#x993;&#x9DF;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x99A;&#x9BE;&#x9B2;&#x9BE;&#x9DF;, &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x993;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9AC;&#x9B2;&#x9BE; &#x986;&#x99B;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x987; &#x98F;&#x995;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AC;&#x9B2;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;-&#x987;&#x9A8; (built-in) &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x964; print() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x98F;&#x995; &#x9AC;&#x9BE; &#x98F;&#x995;&#x9BE;&#x9A7;&#x9BF;&#x995; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x995;&#x9CD;&#x9B7;&#x9C7;&#x9A4;&#x9CD;&#x9B0;&#x9C7; &#x986;&#x9B0;&#x9CD;&#x997;&#x9C1;&#x9AE;&#x9C7;&#x9A8;&#x9CD;&#x99F;&#x997;&#x9C1;&#x9B2;&#x9CB;&#x995;&#x9C7; &#x995;&#x9AE;&#x9BE; &#x99A;&#x9BF;&#x9B9;&#x9CD;&#x9A8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AA;&#x9C3;&#x9A5;&#x995; &#x995;&#x9B0;&#x9C7; &#x9A6;&#x9BF;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>a = <span class="hljs-number">1</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>b = <span class="hljs-number">1.2</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>c = <span class="hljs-string">&quot;hello&quot;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(a, b, c)
<span class="hljs-number">1</span> <span class="hljs-number">1.2</span> hello
<span class="hljs-meta">&gt;&gt;&gt; </span>print(a, b, c, <span class="hljs-string">&quot;world&quot;</span>)
<span class="hljs-number">1</span> <span class="hljs-number">1.2</span> hello world
&gt;&gt;&gt;
</code></pre>
<p>print() &#x99B;&#x9BE;&#x9DC;&#x9BE;&#x993; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x987;&#x9A4;&#x9BF;&#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BE; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7;&#x99B;&#x9BF;, &#x9B8;&#x9C7;&#x99F;&#x9BF; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7; type()&#x964; type() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x986;&#x9AE;&#x9BE;&#x9A6;&#x9C7;&#x9B0;&#x995;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AD;&#x9C7;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x9C7;&#x9B0; &#x9A1;&#x9BE;&#x99F;&#x9BE; &#x99F;&#x9BE;&#x987;&#x9AA; &#x9AC;&#x9B2;&#x9C7; &#x9A6;&#x9C7;&#x9DF;&#x964; &#x98F;&#x9B0;&#x995;&#x9AE; &#x986;&#x9B0;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;-&#x987;&#x9A8; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;, &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9DF;&#x9C7;&#x9BE;&#x99C;&#x9A8;&#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x9B6;&#x9BF;&#x996;&#x9C7; &#x9A8;&#x9C7;&#x9AC;&#x964;</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0;&#x995;&#x9BE;&#x9B0;&#x9BF;&#x9B0; &#x995;&#x9BE;&#x99B; &#x9A5;&#x9C7;&#x995;&#x9C7; &#x995;&#x9C7;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x995;&#x9BF;&#x99B;&#x9C1; &#x987;&#x9A8;&#x9AA;&#x9C1;&#x99F; &#x9A8;&#x9BF;&#x9A4;&#x9C7; &#x99A;&#x9BE;&#x987;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9A4;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9AA;&#x9BE;&#x987;&#x9A5;&#x9A8;&#x9C7; input() &#x9A8;&#x9BE;&#x9AE;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9B0;&#x9DF;&#x9C7;&#x99B;&#x9C7;&#x964; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x99F;&#x9BF; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BF; &#x9B8;&#x9B9;&#x99C; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964; &#x98F;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1;&#x99F;&#x9BF; &#x9B9;&#x9C1;&#x9AC;&#x9B9;&#x9C1; &#x99F;&#x9BE;&#x987;&#x9AA; &#x995;&#x9B0;&#x9C7; welcome.py &#x9A8;&#x9BE;&#x9AE;&#x995; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x9AD; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964;</p>
<pre><code class="lang-py">name = input(<span class="hljs-string">&quot;What is your name? &quot;</span>)
print(<span class="hljs-string">&quot;Welcome to Python,&quot;</span>, name, <span class="hljs-string">&quot;!&quot;</span>)
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9AE;&#x9BF;&#x9A8;&#x9BE;&#x9B2;&#x9C7; python welcome.py &#x9B2;&#x9BF;&#x996;&#x9C7; &#x98F;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0; &#x995;&#x9BF; &#x99A;&#x9BE;&#x9AA;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9B2;&#x9BE;&#x987;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9BF;&#x9A8;&#x9CD;&#x99F; &#x9B9;&#x9AC;&#x9C7; :</p>
<p>What is your name?</p>
<p>&#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7;&#x9B0; &#x9A8;&#x9BE;&#x9AE; &#x99F;&#x9BE;&#x987;&#x9AA; &#x995;&#x9B0;&#x9C7; &#x98F;&#x9A8;&#x9CD;&#x99F;&#x9BE;&#x9B0; &#x99A;&#x9BE;&#x9AA;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; : What is your name? Tamim Shahriar Subeen&#x964;</p>
<p>&#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x9AE;&#x9A4;&#x9C7;&#x9BE; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7; :</p>
<p>Welcome to Python, Tamim Shahriar Subeen !</p>
<p>&#x986;&#x9AE;&#x9B0;&#x9BE; &#x98F;&#x9A4;&#x995;&#x9CD;&#x9B7;&#x9A3; &#x9AF;&#x9BE; &#x9B6;&#x9BF;&#x996;&#x9B2;&#x9BE;&#x9AE;, &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x996;&#x9A8; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x9BE;&#x964;</p>
<pre><code class="lang-py">number1 = input(<span class="hljs-string">&quot;Please type an integer and press enter: &quot;</span>)
number2 = input(<span class="hljs-string">&quot;Please type another integer and press enter: &quot;</span>)

print(<span class="hljs-string">&quot;number1 + number2 =&quot;</span>, number1+number2)
</code></pre>
<p>&#x993;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x995;&#x9C7;&#x9BE;&#x9A1; &#x986;&#x9AE;&#x9B0;&#x9BE; arithmetic.py &#x9A8;&#x9BE;&#x9AE;&#x995; &#x9AB;&#x9BE;&#x987;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x9AD; &#x995;&#x9B0;&#x9C7; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x9BE; : python arithmetic.py &#x995;&#x9AE;&#x9BE;&#x9A8;&#x9CD;&#x9A1; &#x9A6;&#x9BF;&#x9DF;&#x9C7;&#x964;</p>
<pre><code>Please type an integer and press enter: 3
Please type another integer and press enter: 6
number1 + number2 = 36
</code></pre><p>&#x995;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9C1; &#x9AB;&#x9B2;&#x9BE;&#x9AB;&#x9B2; &#x9A4;&#x9C7;&#x9BE; &#x986;&#x9B8;&#x9BE;&#x9B0; &#x995;&#x9A5;&#x9BE; 9&#x964; &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x995;&#x9C0; &#x9B9;&#x99A;&#x9CD;&#x99B;&#x9C7;? input() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BF; &#x9B8;&#x9AC;&#x9B8;&#x9AE;&#x9DF; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x987; number1 &#x993; number2 &#x98F;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x964; &#x986;&#x9B0; &#x9A6;&#x9C1;&#x99F;&#x9BF; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982;&#x995;&#x9C7; &#x986;&#x9AE;&#x9B0;&#x9BE; &#x9AF;&#x9A6;&#x9BF; &#x9AF;&#x9C7;&#x9BE;&#x997; &#x995;&#x9B0;&#x9BF;, &#x9A4;&#x9BE;&#x9B9;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE; &#x9AA;&#x9BE;&#x9B6;&#x9BE;&#x9AA;&#x9BE;&#x9B6;&#x9BF; &#x9AC;&#x9B8;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BF; &#x9A8;&#x9A4;&#x9C1;&#x9A8; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x987; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x995;&#x9C7; &#x987;&#x9A8;&#x9CD;&#x99F;&#x9BF;&#x99C;&#x9BE;&#x9B0;&#x9C7; &#x9B0;&#x9C2;&#x9AA;&#x9BE;&#x9A8;&#x9CD;&#x9A4;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x98F;&#x99C;&#x9A8;&#x9CD;&#x9AF; &#x986;&#x9AE;&#x9B0;&#x9BE; int() &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9AC;&#x9CD;&#x9AF;&#x9AC;&#x9B9;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9BF;&#x964; &#x98F;&#x99F;&#x9BF;&#x993; &#x98F;&#x995;&#x99F;&#x9BF; &#x9AC;&#x9BF;&#x9B2;&#x9CD;&#x99F;&#x987;&#x9A8; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x964;</p>
<pre><code class="lang-py">number1 = input(<span class="hljs-string">&quot;Please type an integer and press enter: &quot;</span>)
number2 = input(<span class="hljs-string">&quot;Please type another integer and press enter: &quot;</span>)
number1 = int(number1)
number2 = int(number2)
print(<span class="hljs-string">&quot;number1 + number2 =&quot;</span>, number1+number2)
</code></pre>
<p>&#x98F;&#x996;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B0;&#x9BE;&#x9A8; &#x995;&#x9B0;&#x9B2;&#x9C7; &#x9A0;&#x9BF;&#x995;&#x9A0;&#x9BE;&#x995; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x986;&#x9B8;&#x9AC;&#x9C7;&#x964;</p>
<p>&#x985;&#x9A8;&#x9C1;&#x9B6;&#x9C0;&#x9B2;&#x9A8;&#x9C0;:</p>
<ul>
<li><p>&#x989;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE;&#x99F;&#x9BF; &#x9AA;&#x9B0;&#x9BF;&#x9AC;&#x9B0;&#x9CD;&#x9A4;&#x9A8; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; &#x9AF;&#x9C7;&#x9A8; &#x9B8;&#x995;&#x9B2; &#x9AA;&#x9CD;&#x9B0;&#x995;&#x9BE;&#x9B0;&#x9C7;&#x9B0; &#x997;&#x9BE;&#x9A3;&#x9BF;&#x9A4;&#x9BF;&#x995; &#x985;&#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x9B6;&#x9A8; &#x9A6;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7;&#x9BE; &#x9AF;&#x9BE;&#x9DF; (+, -, *, /, %, //, **)&#x964;</p>
</li>
<li><p>&#x98F;&#x987; &#x985;&#x9A7;&#x9CD;&#x9AF;&#x9BE;&#x9DF; &#x9AA;&#x9DC;&#x9BE;&#x9B0; &#x9B8;&#x9AE;&#x9DF; &#x9A8;&#x9BF;&#x9B6;&#x9CD;&#x99A;&#x9DF;&#x987; &#x9AE;&#x9A8;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8; &#x99C;&#x9C7;&#x997;&#x9C7;&#x99B;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x997;&#x9C1;&#x9B2;&#x9C7;&#x9BE;&#x9B0; &#x989;&#x9A4;&#x9CD;&#x9A4;&#x9B0; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x996;&#x9C1;&#x981;&#x99C;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9AC;&#x9C7; (&#x9AC;&#x9BF;&#x9AD;&#x9BF;&#x9A8;&#x9CD;&#x9A8; &#x9AA;&#x9CD;&#x9B0;&#x9C7;&#x9BE;&#x997;&#x9CD;&#x9B0;&#x9BE;&#x9AE; &#x9B2;&#x9BF;&#x996;&#x9C7;)&#x964;</p>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="hello-world-python.html" class="navigation navigation-prev " aria-label="Previous page: পাইথন দিয়ে প্রথম প্রোগ্রাম">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="conditional-logic-python.html" class="navigation navigation-next " aria-label="Next page: কন্ডিশনাল লজিক">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"ভ্যারিয়েবল, ডেটা টাইপ ও গাণিতিক অপারেশন","level":"1.4","depth":1,"next":{"title":"কন্ডিশনাল লজিক","level":"1.5","depth":1,"path":"conditional-logic-python.md","ref":"conditional-logic-python.md","articles":[]},"previous":{"title":"পাইথন দিয়ে প্রথম প্রোগ্রাম","level":"1.3","depth":1,"path":"hello-world-python.md","ref":"hello-world-python.md","articles":[]},"dir":"ltr"},"config":{"plugins":[""],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Tamim Shahriar","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"পাইথন প্রোগ্রামিং","language":"bn","links":{"sidebar":{"পাইথন প্রোগ্রামিং":"https://www.gitbook.com/book/subeen/python-programming-bangla"},"gitbook":true},"gitbook":"*","description":"পাইথন প্রোগ্রামিং ভাষা (ভার্শন ৩) শেখার বাংলা বই। বইটি প্রোগ্রামিংয়ে যারা নতুন, তাদের জন্য উপযোগি। এছাড়া যারা অন্য প্রোগ্রামিং ভাষা জানে কিন্তু পাইথন শিখতে চায়, তারাও বইটি পড়ে পাইথন শিখতে পারবে।"},"file":{"path":"variable-data-type-python.md","mtime":"2018-03-06T03:14:11.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-03-06T03:33:35.750Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    
<div><script style="display: none;" type="application/javascript">
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','../www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-57505611-7', 'auto', {name: 'microcdn'});
  ga('microcdn.send', 'pageview');

  var _cdn_prev_loc = window.location.pathname;
  window.setInterval(function () {
    if (window.location.pathname !== _cdn_prev_loc) {
      _cdn_prev_loc = window.location.pathname;
      ga('microcdn.send', 'pageview');
    }
  }, 100);

</script></div>
</body>

<!-- Mirrored from pybook.subeen.com/variable-data-type-python.html by HTTrack Website Copier/3.x [XR&CO'2014], Wed, 07 Mar 2018 04:58:25 GMT -->
</html>

